[
  {
    "title": "Bifrost x MCH x Oasys x PLANZ:",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/bifrost-x-mch-x-oasys-x-planz-479e0f604fde",
    "content": "Bifrost x MCH x Oasys x PLANZ:Bifrost·FollowPublished in바이프로스트·8 min read·Jan 28, 2025--ShareDeFi와 GameFi로 $BtcUSD 활용 사례 확장요약:네이티브 비트코인(Native Bitcoin)의 유동성을 제공하는 BTCFi의 운영사 Bifrost가 일본의 게임 블록체인Oasys와 파트너십을 체결하며, $BtcUSD의 게임 생태계를 확장합니다.$BtcUSD는 Oasys의 대표적인 탈중앙화거래소(DEX)인 Gaming DEX에 최초로 도입되며, $BtcUSD로 유동성을 제공하면 보상을 받을 수 있습니다.Oasys 최초의 무기한 DEX인 Ragnarok에도 $BtcUSD가 통합됩니다.Oasys의 다른 개발사인 MCH와 PLANZ 또한 $BtcUSD를 지원하며 네트워크를 함께 성장시킬 예정입니다.개요Bifrost는 Oasys와의 파트너십을 맺었습니다!Oasys와 Bifrost 간의 협업은 단순한 파트너십을 넘어, Oasys와 함께 생태계를 실질적으로 확장하고 $BtcUSD의 새로운 활용 사례를 창출하고 있습니다. Oasys에서 개발된 DApp에 $BtcUSD를 활용함으로써 GameFi와 DeFi의 통합이 더욱 가속화되며, 이는 Bifrost 생태계 확장 및 $BtcUSD의 게임 분야 채택에서 중요한 이정표가 될 것입니다.이번 협업을 통해 $BtcUSD의 새로운 활용 사례를 선보이고 추가적인 수익 흐름을 창출하는 동시에 Bifrost 생태계를 전반적으로 강화하고 Oasys 블록체인의 활용도를 높일 수 있게 되었습니다.https://x.com/Bifrost_Network/status/1871088835029000346협업 강화이번 협업을 가속화하기 위해 Oasys의 주요 개발사인 MCH와 PLANZ와도 파트너십을 맺었습니다.MCH(My Crypto Heroes): 일본의 선도적인 블록체인 게임 퍼블리셔로 현재 Bifrost 노드 검증자로 참여하고 있으며, 7주년을 맞이한 My Crypto Heroes를 제공하고 있습니다.PLANZ: Layer 2, DeFi, GameFi를 포함하여 개발, 마케팅, 컨설팅 서비스도 제공하는 두바이 기반의 Web3 전문 회사입니다.이들과의 협력을 통해 Oasys의 대표 탈중앙화거래소(DEX)인 Gaming DEX 및 첫 무기한 DEX인 Ragnarok와 같은 DApp에서 $BtcUSD를 보다 널리 사용할 수 있도록 하여 DeFi와 Gaming 생태계 활성화에 기여할 것입니다.주요 협업 사항Gaming DEX: $BtcUSD/USD 풀이 Gaming DEX에서 제공되며, 유동성 공급자는 보상을 받을 수 있습니다.Ragnarok: Oasys 최초의 무기한 DEX인 Ragnarok에서도 $BtcUSD가 통합되어 유동성을 제공하면 보상을 받을 수 있습니다.추가 DApp 활용 사례: Oasys 상에서 $BtcUSD와 $BFC를 활용한 새로운 수익 창출 모델이 곧 공개됩니다. 이 모델은 사용자가 더욱 흥미롭게 참여할 수 있는 방법을 제시할 것입니다.MCH 및 PLANZ와의 협력: Gaming DApp에서 $BtcUSD의 추가적인 활용 사례를 설계 및 개발하여 DeFi와 Gaming의 융합을 통해 $BtcUSD를 보다 많은 사용자에게 가치 있는 옵션으로 만들 것입니다.협업의 긍정적 영향이번 협업은 모든 파트너와 사용자들에게 장기적으로 긍정적인 영향을 미칠 것입니다.Bifrost: $BtcUSD의 활용 사례와 수익원을 확장하며 DeFi 생태계를 더욱 활성화합니다.Oasys: 온체인 유동성과 참여도를 높여 새로운 사용자를 유치할 수 있습니다.MCH 및 PLANZ: 자체 DApp을 활성화하여 Gaming과 DeFi를 결합한 혁신적인 서비스를 제공합니다.사용자: 보다 다양하고 흥미로운 DeFi 및 Gaming 서비스를 즐기면서 추가적인 수익을 창출할 기회를 갖게 됩니다.BTCFi의 스테이블코인인 $BtcUSD는 Oasys, MCH, PLANZ와 협업을 통해 DeFi와 게임의 경계를 허물며 새로운 가능성을 열어가고 있습니다. 앞으로도 협업을 통해 다양한 DApp들을 개발할 것입니다.파트너 소개OasysOasys는 게임에 최적화된 블록체인으로, Ethereum Layer 2 확장 솔루션을 활용한 확장 가능한 Layer 1 허브 및 특화된 Layer 2를 제공합니다. 이 생태계는 더 효과적이고 안전한 게임을 위해 게임 개발자에게 안전하고 확장성 높은 블록체인 인프라를 제공하며 SEGA, Ubisoft, Yield Guild Games와 같은 주요 게임 및 Web3 리더들이 PoS 기반 블록체인의 초기 검증자로 참여하고 있습니다.Oasys는 블록체인 기반 게임을 개발하는 게임 개발자들이 직면하는 문제를 해결하기 위해 게이머와 개발자가 게임을 배포하고 개발할 수 있는 생태계 조성에 중점을 둡니다. Oasys의 세 가지 핵심 접근법(trifecta approach)은 다음과 같습니다:게이밍 커뮤니티에 의해 구동되는 빠른 네트워크AAA 게임 개발자들에 의해 구동되는 확장 가능한 네트워크빠른 트랜잭션과 네트워크 비용 없이 최상의 사용자 경험을 제공하는 블록체인이 접근 방식은 참여자들이 Oasys 생태계에 쉽게 진입해 게임을 즐길 수 있도록 돕습니다.공식 X:https://x.com/oasys_gamesMCH 소개2018년에 출시된 My Crypto Heroes(MCH)는 일본에서 큰 주목을 받은 선구적인 블록체인 게임으로, Ethereum DApp 거래량에서 1위를 달성했습니다. MCH는 역사적 인물에서 영감을 받은 영웅들과 게임 내 아이템을 포함한 디지털 자산을 플레이어들이 소유하고 거래할 수 있는 독특한 생태계를 구축했습니다.MCH는 커뮤니티 중심 접근 방식을 통해 블록체인 기술의 장점을 최대한 활용하며, 탈중앙화와 소유권에 중점을 두어 사용자들로부터 높은 신뢰를 얻고 있습니다.빠르게 변화하는 블록체인 게임 시장에서도 MCH는 안정적인 성장을 이뤘으며, Bifrost 네트워크의 보안 및 검증 시스템에 기여할 예정입니다. 더 나아가, MCH는 Bifrost 생태계 확장, $BtcUSD 활용 사례 및 수익 창출을 촉진하고, 게이머들에게 새로운 금융 경험을 제공할 것입니다. 또한, GameFi 분야에서의 확장된 활용 사례를 통해 혁신을 더욱 이끌어 나갈 것입니다.공식 X:https://x.com/mycryptoheroesPLANZ 소개PLANZ.inc는 Web 3.0 제품의 기획, 개발, 운영, 마케팅 및 컨설팅을 전문으로 하는 두바이 기반의 회사입니다.PLANZ 팀은 주로 일본 출신의 멤버들로 구성되어 있으며, 베트남과 인도의 멤버들도 함께하고 있습니다. 이들은 DeFi 제품, Layer 2 블록체인, GameFi 및 서비스 레이어와 관련된 풍부한 전문성을 보유하고 있으며, 다양한 DApp에서 검증된 성과를 기록해왔습니다.PLANZ.inc는$Z라는 기업 토큰을 발행하고 있습니다. 개별 DApp(예: 게임 또는 DeFi)에 특화된 토큰과 달리,$Z는 PLANZ.inc가 관련된 10개 이상의 프로젝트 전반에 연결되어 있습니다. PLANZ는 운영 중이거나 참여 중인 다양한 프로젝트에서 발생한 수익의 일부를 활용해 바이백(buyback)을 실행합니다.공식 웹사이트:https://planz.tech/Gaming DEX:https://x.com/GamingDEX_OasysChain Colosseum Phoenix:https://x.com/ChainColosseum_Bifrost 소개Bifrost 네트워크의 크로스체인 기술로 구동되는BTCFi는 비트코인을 멀티체인 생태계와 연결하는 선구적인 비트코인 자산 관리 서비스입니다. BTCFi는 네이티브 비트코인을 담보로 한 부채 포지션(CDP) 프로토콜로, 사용자가 비트코인을 매도하지 않고도 유동성을 확보할 수 있도록 합니다.BTCFi를 통해 사용자는 비트코인을 스테이킹하여$BtcUSD(비트코인 기반 스테이블코인)를 발행할 수 있으며, 3.5%의 낮은 고정 금리와 함께 비트코인의 가치에 대한 노출을 유지할 수 있습니다. 또한,50% 초과담보 비율과2–3%의 안정적인 연간 수익률(네이티브 BTC 기준)을 제공하며, 비트코인의 유용성을 재정의합니다.이번 협업으로 바이프로스의 스테이블코인 $BtcUSD의 활용처가 더 많아졌습니다. 앞으로 더 확장될 사용처를 기대해주세요!SNS:X(Bifrost)|DiscordBifrost 네트워크 생태계:Bifrost Network|Linktree"
  },
  {
    "title": "MCH(MyCryptoHeroes) Joins as a Node Validator of Bifrost Network",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/mch-mycryptoheroes-joins-as-a-node-validator-of-bifrost-network-d12b1658a513",
    "content": "MCH(MyCryptoHeroes) Joins as a Node Validator of Bifrost NetworkBifrost·FollowPublished inBifrost·3 min read·Dec 23, 2024--ListenShareIntroductionIntroducing MCH Co. Ltd. (referred to as “MCH”) as an official partner of Bifrost!MCH is a game company that develops and provides blockchain games, includingMy Crypto Heroes.With this partnership, MCH has joined the Bifrost network as a validator. Additionally, MCH’s DApps will now be available on the Bifrost network. Through this collaboration, MCH will contribute to the verification process of the Bifrost network, enhancing its stability and activation. Moreover, MCH will supply its upcoming services to the Bifrost network, providing new use cases and yield sources for BtcUSD, thereby contributing to the expansion of the Bifrost ecosystem.This partnership represents an important step towards strengthening the security of the Bifrost network and accelerating its ecosystem growth.Meaning of PartnershipThe key aspect of this partnership is the addition of MCH, an innovative blockchain game platform, as a validator on the Bifrost network. To realize the core blockchain value of decentralization, the Bifrost network has introduced its own Bitcoin Relaying Protocol, enabling decentralized validators to verify the entire process of native BTC deposits and withdrawals.MCH’s participation as a validator marks a groundbreaking milestone that enhances the security and trustworthiness of the Bifrost network. Furthermore, MCH will contribute to strengthening the Bifrost network’s security, expanding the use cases for BtcUSD, and fostering yield generation, ultimately accelerating the growth of the Bifrost ecosystem. This collaboration signifies a major step toward maximizing synergy between the two companies and enabling innovative service offerings.About PartnerLaunched in 2018, My Crypto Heroes (MCH) is a pioneering blockchain game that gained significant attention in Japan and achieved the number one spot in Ethereum DApp transaction volume. MCH has created a unique ecosystem where players can own and trade digital assets, including heroes inspired by historical figures and in-game items. Through its community-driven approach, MCH maximizes the benefits of blockchain technology, focusing on decentralization and ownership, and has earned high trust from its users.In the rapidly changing blockchain gaming market, MCH has achieved stable growth and will contribute to the security and validation system of the Bifrost network. Furthermore, MCH is expected to enhance the expansion of the Bifrost ecosystem, boost the use cases and yield generation of BtcUSD, and offer new financial experiences to its gamers. MCH will also showcase expanded use cases in the GameFi sector, further driving innovation.About BifrostBifrost NetworkBifrost is a multi-chain Layer 1 network that supports both EVM and non-EVM environments, providing an optimized platform for building a wide range of DApps. With decentralization and security as core values, Bifrost has continued to strengthen these aspects since launching its mainnet. The network leverages its proprietary CCCP (Cross-Chain Communication Protocol) and BRP (Bitcoin Relaying Protocol) to enable decentralized relayers to verify all network transactions. This decentralized node operation model, backed by Multi-Sig-based secure Vault structures, ensures the safe custody of assets within the network. Bifrost thus establishes itself as a secure network with thoroughly validated decentralization and security.BTCFiBifrost’s flagship service, BTCFi, aims to deliver optimal Bitcoin liquidity services. BTCFi allows users to borrow the Bitcoin-collateralized stablecoin, BtcUSD, by using Bitcoin as collateral, creating additional income opportunities. For more details on BTCFi, click here.Big Picture of BifrostThe partnership with MCH Co., Ltd. marks an important gateway for Bifrost to connect with Japan’s blockchain gaming ecosystem. Building on this foundation, Bifrost plans to expand collaborations with various Japanese Web3 projects, introducing Bifrost’s innovative technology to the Japanese market. Through this partnership, Bifrost aims to introduce its network services, including BTCFi, to a broader Japanese audience.Bifrost —Website|X|DiscordBTCFi —Website"
  },
  {
    "title": "바이프로스트 네트워크 노드 밸리데이터로 마이크립토히어로즈(MCH) 합류",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EB%85%B8%EB%93%9C-%EB%B0%B8%EB%A6%AC%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A1%9C-%EB%A7%88%EC%9D%B4%ED%81%AC%EB%A6%BD%ED%86%A0%ED%9E%88%EC%96%B4%EB%A1%9C%EC%A6%88-mch-%ED%95%A9%EB%A5%98-23944b9533f1",
    "content": "바이프로스트 네트워크 노드 밸리데이터로 마이크립토히어로즈(MCH) 합류Bifrost·FollowPublished in바이프로스트·4 min read·Dec 23, 2024--Share개요바이프로스트의 공식 파트너로 MCH 주식회사(이하 MCH사)를 소개합니다!MCH사는 My Crypto Heroes를 비롯한 블록체인 게임을 개발·제공하는 게임 회사입니다.이로써 MCH사는 바이프로스트 네트워크의 밸리데이터로 합류함과 동시에 MCH사의 DApp도 바이프로스트 네트워크 에서 서비스하게 되었습니다. 이번 파트너십을 통해 MCH사는 바이프로스트 네트워크의 검증 과정에 참여하며, 네트워크의 안정성과 활성화에 기여할 예정입니다. 또한, 바이프로스트 네트워크에 MCH가 개발 중인 서비스들을 공급하여 BtcUSD의 활용처와 이율의 원천을 제공하는 등, 바이프로스트 네트워크의 생태계를 확장시키는 데에 기여할 예정입니다.이 파트너십은 바이프로스트 네트워크의 보안성을 강화하고, 바이프로스트 생태계 확장을 가속화하는 중요한 걸음이 될 것입니다.파트너십의 의미이번 파트너십의 핵심은 독창적인 블록체인 게임 플랫폼인 MCH사가 바이프로스트 네트워크의 밸리데이터로 합류한다는 점입니다. 바이프로스트는 블록체인 업계의 핵심 가치인 탈중앙화를 실현하기 위해, 자체 개발한 Bitcoin Relaying Protocol을 도입하여 네이티브 BTC의 입출금 전 과정을 탈중앙화된 밸리데이터들이 검증하도록 하고 있습니다. MCH사의 밸리데이터 참여는 바이프로스트 네트워크의 안전성과 신뢰도를 한 단계 높이는 획기적인 이정표가 될 것이며,향후 MCH사가바이프로스트의 네트워크 보안성을 강화하고, BtcUSD의 활용 사례와 이율 생성을 촉진하며, 이를 통해 바이프로스트 네트워크 생태계 확장에 크게 기여할 것으로 기대됩니다.파트너사에 대해2018년에 출시된 My Crypto Heroes(MCH)는 혁신적인 게임성과 일본 내 높은 주목도를 바탕으로 이더리움 DApp 거래량 1위를 기록했던 선도적인 블록체인 게임입니다. MCH사는 역사적 인물 등에서 영감을 얻은 독창적인 히어로와 게임 내 아이템을 디지털 자산으로 소유·거래할 수 있는 독자적인 생태계를 구축했습니다. MCH사는 사용자 중심의 커뮤니티 운영을 통해 탈중앙화와 소유권을 중시하는 블록체인 기술의 장점을 최대한 활용하여 사용자들로부터 높은 신뢰를 얻고 있습니다. 특히, 환경 변화가 큰 블록체인 게임 시장에서 안정적인 성장을 실현하고 있는 MCH사는 바이프로스트 네트워크의 보안성과 검증 시스템에 기여할 예정입니다. 또한, 향후 MCH는 바이프로스트 생태계 확장과 네트워크 보안성 강화에 기여하며, BtcUSD의 활용 사례와 이율 창출을 더욱 촉진할 것으로 기대됩니다. 또한 MCH 게이머들에게도 새로운 금융 경험을 제공하며, GameFi 분야에서 더욱 확장된 Use Case를 선보일 예정입니다.바이프로스트에 대하여바이프로스트 네트워크바이프로스트는 EVM 및 non-EVM을 모두 지원하는 멀티체인 레이어 1 네트워크로, 다양한 DApp 구축에 최적화된 환경을 제공하고 있습니다. 바이프로스트는 탈중앙화와 보안성을 핵심 가치로 삼아왔으며, 메인넷 런칭 이후에는 이를 한층 더 강화하여 구현하고 있습니다. 바이프로스트는 독자적인 CCCP(Cross-Chain Communication Protocol)와 BRP(Bitcoin Relaying Protocol)를 통해 탈중앙화된 릴레이어들이 네트워크의 모든 트랜잭션을 검증하도록 설계되어 있으며, 이러한 탈중앙화된 노드 운영 방식은 Multi-Sig 기반의 안전한 Vault 구성으로 이어져 네트워크의 자산 보관 안정성을 보장합니다. 이처럼 바이프로스트는 탈중앙화와 보안이 철저히 검증된 안전한 네트워크로 자리매김하고 있습니다.BTCFi현재 바이프로스트의 주력 서비스는 BTCFi로, 최적의 비트코인 유동화 서비스를 목표로 하고 있습니다. BTCFi에서는 비트코인을 담보로 비트코인 담보 스테이블코인 BtcUSD를 대출받고, 이를 통해 추가 수익을 창출할 수 있는 기회를 제공합니다.BTCFi에 대해 더 알아보기바이프로스트의 방향성MCH 주식회사와의 파트너십은 바이프로스트가 일본의 블록체인 게임 생태계와 연결되는 중요한 교두보가 될 것입니다. 이를 시작으로 일본의 다양한 Web3 프로젝트와의 협력을 확대하고, 바이프로스트의 혁신적인 기술력을 일본 시장에 전개하여 BTCFi를 포함한 바이프로스트 네트워크의 서비스를 더 많은 일본 사용자들에게 소개해 나갈 계획입니다.Bifrost & BTCFi의 여정에 합류하세요!Bifrost —Website|X|DiscordBTCFi —Website"
  },
  {
    "title": "Bifrost X COREx Partnership",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-x-corex-partnership-6ebf544b29b4",
    "content": "Bifrost X COREx PartnershipBifrost·FollowPublished inBifrost·3 min read·Dec 18, 2024--ListenShareTL;DR:Bifrost, operating BTCFi to provide liquidity for Native Bitcoin, has partnered with COREx — the #1 DEX on Core — to enhance Bitcoin liquidity.This collaboration provides significance in which users on Core network will now have easy access to $BtcUSD. Additionally, this introduces another use case for $BtcUSD as a CDP (Collateralized Debt Position), allowing users to use Bitcoin as collateral with a 50% loan-to-value (LTV) ratio.Users will now be able to swap $USDC through core by using the $BtcUSD <> $USDC pool on COREx, as well as creating additional yields by providing liquidity.OverviewWe’re excited to announce our partnership with COREx!Through this partnership, COREx will support a $BtcUSD <> $USDC pool, where $BtcUSD that was minted through BTCFi can now be swapped to $USDC through COREx, as well as liquidity provision.Following the previous partnership, this partnership establishes $BtcUSD as the official CDP of Core network.We hope to receive continuous support and attention from users, as $BtcUSD will continue to increase its use cases, as well as the expanding BTCFi ecosystem.The Meaning of PartnershipAs $BtcUSD is finally on the #1 DEX on Core, $BtcUSD has secured the position as the official Bitcoin-backed stablecoin on the leading Bitcoin-aligned L1, Core.To add, users will have another use case for $BtcUSD to receive additional incentives.As the only Native-Bitcoin backed CDP, BTCFi is progressing step by step. We hope to increase the usage and support of $BtcUSD, along with the BTCFi ecosystem.About CORExCOREx is a pioneering decentralized exchange (DEX) at the forefront of the Core DAO ecosystem, backed by Core Ventures and HTX Ventures. As a flagship V3-style DEX, COREx revolutionizes the trading experience by seamlessly blending simplicity with cutting-edge technology. With an intuitive interface designed to minimize the learning curve, COREx is accessible to both newcomers and experienced traders in the Web3 space. The platform incorporates robust community features that foster collaboration and knowledge sharing among users, while advanced AI-driven trading assistance enhances decision-making through smart recommendations and real-time transaction monitoring.Dedicated to continuous innovation, COREx integrates unique features of the CoreDAO to enhance liquidity management, improve trading efficiency, and develop sophisticated risk management strategies. By combining an accessible platform with intelligent functionalities, COREx aims to redefine decentralized trading on the Core Chain, lowering entry barriers for DeFi participation and creating a comprehensive trading environment that caters to all users in the decentralized finance landscape.About BifrostBTCFi, powered by Bifrost Network’s cross-chain technology, is a pioneering Bitcoin asset management service that bridges Bitcoin with multichain ecosystems. As the foremost Native-Bitcoin collateralized debt position (CDP) protocol, BTCFi empowers users to unlock liquidity without selling their Bitcoin. With BTCFi, users can stake Bitcoin to mint $BtcUSD, a Bitcoin-backed stablecoin, while enjoying a low, fixed interest rate of 3.5% and maintaining exposure to Bitcoin’s value. Offering features like a 50% over-collateral ratio and the ability to earn a stable annual yield of 2–3% in Native BTC, BTCFi redefines Bitcoin’s utility.ConclusionBTCFi, the one and only Native Bitcoin-backed CDP, has successfully started its expansion into the Bitcoin DeFi ecosystem by becoming an official stablecoin on Core network, the largest Bitcoin-aligned L1.As the one and only Native Bitcoin-backed CDP for Bitcoin DeFi, $BtcUSD will not only stop here but continue to grow and aim to be utilized in a wide range of applications.Thank you for joining us on our journey, and we’ll continue trying our best to becoming bigger and better than ever.Visit now:CORExBifrost —Website|X|DiscordBTCFi —Website"
  },
  {
    "title": "바이프로스트와 COREx, 파트너십 체결",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8%EC%99%80-corex-%ED%8C%8C%ED%8A%B8%EB%84%88%EC%8B%AD-%EC%B2%B4%EA%B2%B0-bcff8da4a996",
    "content": "바이프로스트와 COREx, 파트너십 체결Bifrost·FollowPublished in바이프로스트·4 min read·Dec 18, 2024--Share요약:비트코인 유동화를 위해 BTCFi를 운영하는 바이프로스트와, 코어체인 위의 1위 탈중앙화 거래소(DEX) COREx가 파트너십을 맺었습니다.이번 파트너십을 통해$BtcUSD가 코어체인의 대표 DEX에서 지원되며,비트코인 기반 L1생태계의공식 네이티브 비트코인 담보 스테이블코인으로 자리 잡게 되었습니다.사용자는COREx에 새롭게 추가된$BtcUSD <> $USDC 풀에서 $BtcUSD와 $USDC를 스왑하고, 유동성 제공을 통해 추가 수익을 창출할 수 있습니다.개요바이프로스트와 COREx가 파트너십을 체결했습니다!이번 파트너십으로 COREx에$BtcUSD <> $USDC풀이 생겼습니다. 이제BTCFi를 통해 대출받은 $BtcUSD를 COREx에서 $USDC로 스왑하거나 유동성을 공급할 수 있습니다.이전 협업에 이어 이번 파트너십은$BtcUSD가 코어의 공식 네이티브 비트코인 담보 스테이블코인으로 자리 잡는 중요한 의미를 지닙니다.이제 더욱 확장된$BtcUSD 사용처를 함께 축하하며, 성장해 나갈BTCFi 생태계에 많은 기대 부탁드립니다!파트너십의 의미이번 파트너십은$BtcUSD가 코어체인의1위 탈중앙화 거래소(DEX)인COREx에서 공식적으로 지원됨과 동시에, 비트코인 기반 L1 생태계의 선두주자인코어에서네이티브 비트코인 담보 스테이블코인으로 자리 잡았다는 점에서 중요한 의미를 가집니다.사용자 입장에서는 $BtcUSD의새로운 사용처가 열렸다는 점도 큰 의의입니다.유일한네이티브 비트코인 담보 부채 포지션(CDP)프로토콜인BTCFi는 앞으로도 꾸준히 성장하며 비트코인 디파이 생태계를 확장해 나갈 것입니다. 많은 응원과 참여를 부탁드립니다!COREx에 대하여COREx는Core DAO 생태계의 선두에 있는 혁신적인 탈중앙화 거래소(DEX)로,Core Ventures와HTX Ventures의 투자를 받았습니다. V3 스타일의 탈중앙화 거래소인 COREx는단순함과최첨단 기술을 결합하여 혁신적인 거래 경험을 제공하며, 직관적인 인터페이스를 통해초보자와 전문가 모두쉽게 접근할 수 있습니다. 또한, 강력한커뮤니티 기능을 통해 사용자 간 협업과 지식 공유를 촉진하고,AI 기반 거래 지원을 통해 스마트한 추천과 실시간 거래 모니터링으로 사용자들의 의사결정을 돕습니다. COREx는유동성 관리 강화,거래 효율성 개선,정교한 리스크 관리 전략을 통해 탈중앙화 금융(DeFi) 참여의 진입 장벽을 낮추고, 모든 사용자에게 포괄적인 거래 환경을 제공합니다.바이프로스트에 대하여BTCFi는 바이프로스트 네트워크의 크로스체인 기술로 구동되는 혁신적인 비트코인 자산 관리 서비스로, 비트코인을 멀티체인 생태계와 연결합니다. BTCFi는 최초의네이티브 비트코인 담보 부채 포지션(CDP)프로토콜로, 사용자가 비트코인을 매도하지 않고도 유동성을 확보할 수 있도록 지원합니다.BTCFi를 통해 사용자는 비트코인을 스테이킹하여$BtcUSD라는 비트코인 기반 스테이블코인을 발행할 수 있으며, 3.5%의 낮은 고정 금리로 대출할 수 있습니다. 또한 50%의 과담보 비율과 2~3%의 연간 안정적인 BTC 수익을 제공하여 비트코인의 유용성을 재정의하고 있습니다.결론전 세계에서 유일한 네이티브 비트코인 담보 부채 포지션(CDP)인BTCFi는 비트코인 기반 L1 생태계의 선두주자인코어에서 공식스테이블코인으로 자리 잡으며, 비트코인 디파이 생태계로의 확장을 성공적으로 시작했습니다.앞으로BTCFi의 스테이블코인 $BtcUSD는 비트코인 디파이의 중심이 되어 다양한 사용처에서 더욱 폭넓게 활용될 수 있도록 끊임없이 발전해 나가고자 합니다.저희의 여정에 함께해 주셔서 진심으로 감사드리며, 앞으로도 더욱 성장하고 자랑스러운 모습으로 찾아뵙겠습니다.지금 방문하세요:CORExBifrost —Website|X|DiscordBTCFi —Website"
  },
  {
    "title": "Bifrost X Glyph Exchange Partnership",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-x-glyph-exchange-partnership-22635df24568",
    "content": "Bifrost X Glyph Exchange PartnershipBifrost·FollowPublished inBifrost·3 min read·Dec 17, 2024--ListenShareTL;DR:Bifrost Network, which operates BTCFi to provide liquidity for Native Bitcoin, has collaborated with Glyph Exchange, the Flagship DEX on Core network.This collaboration provides significance in which $BtcUSD is the first CDP (Collateralized Debt Position) on Core, as well as providing more use cases for $BtcUSD in the BTC-fi narrative.Users can now swap $USDC and $BtcUSD on Core through Glyph Exchange’s $BtcUSD <> $USDC pool, as well as earning additional yields by providing liquidity to the pool.OverviewBifrost is announcing a strategic partnership with Glyph Exchange!Through this partnership, Bifrost is building a BtcUSD <> USDC pool on the DEX with the most traffic on Core. Users can mint BtcUSD through BTCFi, trade with $USDC, as well as do liquidity provision.This alliance is the first step to expand the BTCFi ecosystem along with increasing the $BtcUSD adoption.$BtcUSD significance on Core$BtcUSD is the first CDP on Core, the biggest Bitcoin-powered ecosystem measured by TVL and user activities in the BTC-fi narrative. $BtcUSD is going to support many more Core projects alongside the growth of Core.As $BtcUSD is now officially supported on the Core network, another use case of $BtcUSD provides more significance to this partnership.A new addition to creating yield through $BtcUSD is now possible on Glyph Exchange, which $BtcUSD has come a step closer to becoming a valuable tool in leveraging the trillion class asset, Bitcoin.About Glyph ExchangeGlyph Exchange is a decentralized exchange (DEX) built on the Bitcoin-powered Core blockchain, uniquely positioned to cater to the needs of the Bitcoin DeFi landscape. As the Core chain’s flagship DEX, Glyph Exchange serves as a vital trading hub for synthetic BTC assets, offering a robust selection of Bitcoin trading pairs.The platform integrates advanced features such asve(3,3) tokenomicsandAlgebra Integral (V4), along with a new technical standard for user-generated assets (UGA) powered by inscription technology. This innovative approach not only facilitates seamless trading experiences but also empowers users to create and manage their own assets effectively.Glyph Exchange operates with a strong backing from a network of prominent venture partners, including Core Ventures, Marin Ventures, CMS Holdings, Decubate VC, Monday Capital, NxtGen Capital, DEXtools VC, and X Ventures. This extensive support underscores Glyph Exchange’s credibility and its potential as a leader in the BTC-fi ecosystem.With a commitment to transparency and user empowerment, Glyph Exchange is rapidly evolving as an integral bridge between institutional Bitcoin holders and the broader DeFi ecosystem. Through its unique offerings and strategic partnerships, Glyph Exchange is set to redefine the utility of Bitcoin in decentralized finance.About BifrostBTCFi, powered by Bifrost Network’s cross-chain technology, is a pioneering Bitcoin asset management service that bridges Bitcoin with multichain ecosystems. As the foremost native-Bitcoin collateralized debt position (CDP) protocol, BTCFi empowers users to unlock liquidity without selling their Bitcoin. With BTCFi, users can stake Bitcoin to mint $BtcUSD, a Bitcoin-backed stablecoin, while enjoying a low, fixed interest rate of 3.5% and maintaining exposure to Bitcoin’s value. Offering features like a 50% over-collateral ratio and the ability to earn a stable annual yield of 2–3% in native BTC, BTCFi redefines Bitcoin’s utility.ConclusionWith this partnership, Bifrost is taking a step towards expanding the global adoption of $BtcUSD beyond the Bifrost network.As the only Native Bitcoin-backed CDP, Bifrost’s BTCFi showcases sufficient competition to provide Bitcoin DeFi for on-chain users.As more and more people use $BtcUSD, Bifrost’s $BtcUSD will become easier and easier to use.Please continue to support Bifrost and its blueprint for BTCFi.Find out now on Glyph Exchange:Glyph Exchange V4 | Bitcoin-powered DEX on Core DAOContact UsBTCFi:BTCFi — Maximize your Bitcoin earningWebsite:Bifrost NetworkX:BIFROST (@Bifrost_Network) on XDiscord:Join the Bifrost Network Discord Server!"
  },
  {
    "title": "바이프로스트와 Glyph Exchange, 파트너십 체결",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8%EC%99%80-glyph-exchange-%ED%8C%8C%ED%8A%B8%EB%84%88%EC%8B%AD-%EC%B2%B4%EA%B2%B0-db909256995a",
    "content": "바이프로스트와 Glyph Exchange, 파트너십 체결Bifrost·FollowPublished in바이프로스트·5 min read·Dec 17, 2024--Share요약Native Bitcoin의 유동화 서비스인 BTCFi를 운영하는바이프로스트와 코어 네트워크의 대표 탈중앙화거래소(DEX)Glyph Exchange가 파트너십을 맺었습니다.이번 협력을 통해$BtcUSD는 코어 네트워크 최초의 담보 부채 포지션(CDP)이 되며, $BtcUSD는 더욱 많은 사용처로 확장할 수 있게 되었습니다.사용자는 이제 Glyph Exchange의$BtcUSD <> $USDC 풀을 통해 $BtcUSD와 $USDC를 스왑할 수 있으며, 해당 풀에 유동성을 제공함으로써 추가적인 수익도 얻을 수 있습니다.개요바이프로스트는 Glyph Exchange와 전략적 파트너십을 발표합니다!이 파트너십을 통해 바이프로스트는 코어 네트워크에서 가장 많은 트래픽을 가진 DEX인 Glyph Exchange에 $BtcUSD <> $USDC 풀을 구축합니다.이를 통해 사용자는 BTCFi를 통해$BtcUSD를 민팅하고,이를$USDC와 스왑및유동성 제공을 할 수 있습니다.이 협력은 BTCFi 생태계 확장의 첫 단계이며$BtcUSD의 사용을 증가시키는 중요한 첫 걸음입니다.코어에서 $BtcUSD의 중요성이번 협력은$BtcUSD가 코어의 첫 번째 CDP로 자리 잡았다는 점에서 중요합니다. 이는 비트코인 중심의 L1인 코어 네트워크에서 사용성을 확대하기 위한 첫걸음으로 볼 수 있습니다.또한$BtcUSD가 코어에서 공식적으로 지원됨에 따라 새로운 사용처가 추가되었으며, 이는 이번 파트너십의 의미를 더욱 높입니다.이번 파트너십을 통해 $BtcUSD를 활용해 수익을 창출할 수 있는 새로운 방법이 제공되며, $BtcUSD가 비트코인의 유동성을 제공하는가치 있는 자산으로 한 걸음 더 나아가게되었습니다.Glyph Exchange에 대하여Glyph는 비트코인 기반의 코어 블록체인에서 구축된 선구적인 탈중앙화 거래소(DEX)로, 비트코인 디파이 생태계를 강화하는 데 중점을 둔 플랫폼입니다. 코어 체인의 대표 DEX로서 Glyph는 합성 BTC 자산의 주요 거래 허브 역할을 하며, 다양한 비트코인 거래 쌍을 제공합니다.Glyph는ve(3,3) 토크노믹스와Algebra Integral(V4)같은 고급 기능을 통합하고, 사용자가 생성한 자산(UGA)을 지원하는인스크립션 기술기반의 새로운 기술 표준을 제공합니다. 이를 통해 원활한 거래 경험을 제공할 뿐만 아니라 사용자가 자산을 효과적으로 생성하고 관리할 수 있도록 돕습니다.Glyph Exchange는Core Ventures, Marin Ventures, CMS Holdings, Decubate VC, Monday Capital, NxtGen Capital, DEXtools VC, X Ventures등 주요 벤처 파트너 네트워크의 강력한 지원을 받고 있으며, 이는 Glyph의 신뢰성과 BTCFi 생태계에서의 잠재력을 입증합니다.투명성과 사용자 권한 강화를 목표로 하는 Glyph는 전통적인 비트코인 보유자와 더 넓은 디파이 생태계 사이를 잇는중요한 다리로 빠르게 자리 잡고 있습니다. Glyph는 독창적인 기능과 전략적 파트너십을 통해 비트코인 디파이의 활용도를 재정의하고 있습니다.바이프로스트에 대하여BTCFi는 바이프로스트 네트워크의 크로스체인 기술로 구동되는 혁신적인 비트코인 자산 관리 서비스로, 비트코인을 멀티체인 생태계와 연결합니다. BTCFi는 최초의네이티브 비트코인 담보 부채 포지션(CDP)프로토콜로, 사용자가 비트코인을 매도하지 않고도 유동성을 확보할 수 있도록 지원합니다.BTCFi를 통해 사용자는 비트코인을 스테이킹하여$BtcUSD라는 비트코인 기반 스테이블코인을 발행할 수 있으며, 3.5%의 낮은 고정 금리로 대출할 수 있습니다. 또한 50%의 과담보 비율과 2~3%의 연간 안정적인 BTC 수익을 제공하여 비트코인의 유용성을 재정의하고 있습니다.결론이번 파트너십을 통해 바이프로스트는 $BtcUSD의 사용 범위를 바이프로스트 네트워크를 넘어 확장하는 데 한 걸음을 내딛었습니다.유일한 네이티브 비트코인 기반CDP로서 Bifrost의 BTCFi는 온체인 사용자에게 비트코인 디파이를 제공하는 데 충분한 경쟁력을 보여줍니다.$BtcUSD를 사용하는 사람들이 많아질수록, 바이프로스트의 $BtcUSD는 점점 더 사용하기 쉬워질 것입니다.앞으로도 바이프로스트와 BTCFi의 확장에 많은 관심과 응원 부탁드립니다.Glyph 바로가기:Glyph Exchange V4 | Bitcoin-powered DEX on Core DAO바이프로스트와 함께하세요!BTCFi:BTCFi — Maximize your Bitcoin earningWebsite:Bifrost NetworkX:BIFROST (@Bifrost_Network) on XDiscord:Join the Bifrost Network Discord Server!"
  },
  {
    "title": "BTCFi by Bifrost X Core Partnership",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-by-bifrost-x-core-partnership-480123037e9f",
    "content": "BTCFi by Bifrost X Core PartnershipBifrost·FollowPublished inBifrost·4 min read·Dec 5, 2024--ListenShareTL;DR:Bifrost, the leading player of direct-Bitcoin BTCFi, and Core, the leading Bitcoin-aligned Layer 1, have entered into a strategic partnershipNow, Bitcoin assets on the Core can be used as collateral for BTCFi, and BtcUSD issued through BTCFi can be utilized across various DeFi services on Core.BTCFi stands out as the first Collateralized Debt Position (CDP) protocol ever launched on the Core.*CDP (Collateralized Debt Position) refers to a service that allows users to borrow assets like stablecoins using cryptocurrency as collateral.OverviewBifrost has formed a strategic partnership with Core, the leading Bitcoin-aligned Layer 1, boasting the highest TVL.BTCFi now operates as a dApp on the Bifrost Network while fully supportingCore blockchain. Bitcoin assets on Core can now be used as collateral for BTCFi. WBTC and BTCB from Core will be supported initially, and even the soon-to-be-released liquid staking token, LstBTC, will be integrated upon launch. Managed by the Core foundation with a market cap of approximately $1.4B and a TVL of $900M, Core’s LstBTC is distinct from other liquid staking BTC tokens in terms of security. This partnership marks the beginning of a new era for Bitcoin DeFi, combining BTCFi’s innovative Bitcoin liquidity service with the secureinfrastructureof Core.Meaning of the PartnershipBTCFi holds great significance as the first-ever Collateralized Debt Position (CDP) protocol to operate on Core. Through this partnership, Bitcoin assets on Core can now be used as collateral to issue BtcUSD, which can then be utilized across various DeFi services on Core. This transformation turns Bitcoin on Core from a simple store of value into a liquid asset through BTCFi.The partnership will be implemented in two phases:Support for BTCB & WBTCIn the first phase, BTCB and WBTC on Core will be available as collateral assets for BTCFi. This allows users to mint BtcUSD, thereby enabling liquidity for BTCB and WBTC on Core.Support for Core’s LstBTCIn the second phase, Core’s upcoming unique liquid staking token, LstBTC, managed by a foundation overseeing assets worth approximately 2 trillion KRW, will also be supported as collateral for BTCFi. This maximizes the potential of Core’s liquid staking assets and accelerates the liquidity of LstBTC.How Users BenefitThis collaboration opens the door to new opportunities for Bitcoin holders:Mint BtcUSD Using Core-Backed BitcoinStake WBTC, BTCB, and LstBTC on Core to mint BTCFi’s Bitcoin-backed stablecoin,BtcUSD, while retaining exposure to your Bitcoin’s value.Earn Rewards & Core Sparks IncentivesBtcUSD holders can grow their assets by trading or providing liquidity, with additional incentives fromCore Ignition, enhancing earning potential in Core’s thriving ecosystem.About CoreCore serves as the Proof of Stake layer for Bitcoin as the first enabler of Self-Custodial Bitcoin Staking, which secures a fully EVM-compatible BTCfi ecosystem. Since April 2024, over 5,399 BTC valued at more than $522 million have been staked with Core, enhancing Bitcoin’s utility and security. Core is the most Bitcoin-aligned EVM blockchain with more than 78% of Bitcoin mining hash power contributing to the network’s security. This breakthrough has amassed millions of Core adopters — over 30M unique addresses, 323M+ transactions, and over $900M TVL since its mainnet launch in January 2023.About BifrostBTCFi, powered by Bifrost Network’s cross-chain technology, is a pioneering Bitcoin asset management service that bridges Bitcoin with multichain ecosystems. As the foremost native-Bitcoin collateralized debt position (CDP) protocol, BTCFi empowers users to unlock liquidity without selling their Bitcoin. With BTCFi, users can stake Bitcoin to mint BtcUSD, a Bitcoin-backed stablecoin, while enjoying a low, fixed interest rate of 3.5% and maintaining exposure to Bitcoin’s value. Offering features like a 50% over-collateral ratio and the ability to earn a stable annual yield of 2–3% in native BTC, BTCFi redefines Bitcoin’s utility.The Blueprint of BifrostTogether, BTCFi and Core aim to revolutionize Bitcoin DeFi:Maximizing Bitcoin’s UtilityBy integrating Bitcoin-backed assets, users can unlock Bitcoin’s liquidity while retaining its value.Seamless and Secure SolutionsCore and Bifrost’s EVM compatibility ensures a smooth user experience, bridging traditional Bitcoin utility with modern DeFi innovations.Expanding Ecosystem OpportunitiesThis partnership connects Core and Bifrost ecosystems, opening up new horizons for Bitcoin-backed financial products.Looking ahead, Bifrost will continue to support the expansion of Bitcoin DeFi and Bitcoin-based financial products, driving growth in the Bitcoin ecosystem. Stay tuned for more groundbreaking innovations from Bifrost!"
  },
  {
    "title": "바이프로스트의 BTCFi와 Core, 파트너십 체결",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8%EC%9D%98-btcfi%EC%99%80-core-%ED%8C%8C%ED%8A%B8%EB%84%88%EC%8B%AD-%EC%B2%B4%EA%B2%B0-3522f4669a1f",
    "content": "바이프로스트의 BTCFi와 Core, 파트너십 체결Bifrost·FollowPublished in바이프로스트·6 min read·Dec 5, 2024--ShareTL;DR:직접적으로 비트코인을 활용하는 BTCFi의 선두 바이프로스트와 비트코인 기반 L1(Layer1)의 선두 플레이어 코어(Core)가 전략적 파트너십을 체결합니다.이제 코어상에 있는 모든 비트코인은 BTCFi의 담보 자산으로 활용할 수 있으며, 발행한 BtcUSD는 코어의 다양한 DeFi 서비스에서 사용할 수 있습니다.BTCFi는 코어상에서 최초로 작동하는담보 부채 포지션(CDP, Collateralized Debt Position) 프로토콜이라는 점에서 큰 의의를 갖습니다.*CDP는 담보 부채 포지션(Collateralized Debt Position)의 약자로, 암호화폐를 담보로 스테이블코인과 같은 자산을 빌릴 수 있는 서비스를 의미합니다.개요바이프로스트와 비트코인 기반 L1 (Layer1) 중 가장 높은 TVL을 자랑하는 코어(Core)가 전략적 파트너십을 체결했습니다!이제 BTCFi는 바이프로스트 네트워크의 디앱(DApp)으로 작동하는 동시에 코어를 완전히 지원하며,코어상에 존재하는 모든 비트코인이 BTCFi의 담보 자산으로 활용됩니다.코어의 WBTC와 BTCB가 우선적으로 지원되며, 심지어 앞으로 출시될 코어의 유동성 스테이킹 토큰인 LstBTC 또한 출시에 맞춰 추후 활용할 수 있게 될 예정입니다. 코어의 LstBTC는 시가총액 약 2조, 총 락업 자산(TVL, Total Value Locked)이 약 1.2조원으로 가장 높은 재단이 직접 운영하기에 타 유동성 스테이킹 BTC와는 보안적으로 차별이 있는 만큼,이번 파트너십은 혁신적인 비트코인 유동화 서비스인 BTCFi와 코어의 안전한인프라가 결합되며 비트코인 디파이의 새로운 도약을 알리는 시작점이 될 것입니다.파트너십의 의미BTCFi는 비트코인 기반 L1인 코어 상에서 최초로 작동하는담보 부채 포지션(CDP, Collateralized Debt Position)프로토콜이라는 점에서 큰 의미가 있습니다. 이번 파트너십을 통해 코어 상의 모든 비트코인을 담보로 활용하여BtcUSD를 발행할 수 있으며, BtcUSD는 코어의 다양한 디파이 서비스에서 활용이 가능합니다. 즉, 코어 상의 비트코인은 단순한 가치 저장 수단을 넘어 BTCFi를 통해 유동 자산으로 탈바꿈합니다.파트너십은 두 단계로 나누어 진행됩니다.BTCB & WBTC 지원첫 단계에서는 코어 상에 있는BTCB와 WBTC를 BTCFi의 담보 자산으로 활용할 수 있게 됩니다. 이를 통해 BtcUSD를 민팅할 수 있으며, 코어 상의 BTCB와 WBTC 유동화를 실현합니다.코어의 LstBTC 지원두 번째 단계에서는 약 2조원 규모의 재단을 운영하는 코어 상의 앞으로 출시될 독보적 유동성 스테이킹 토큰인LstBTC를 BTCFi의 담보로 활용할 수 있게 됩니다. 2조 규모의 재단을 운영하는 코어가 직접 운영하는 Ls이는 코어의 유동성 스테이킹 잠재력을 극대화하며, LstBTC의 유동화를 가속화합니다.기존 홀더들이 얻을 수 있는 혜택이번 파트너십을 통해 코어의 비트코인 홀더 및 기존 BtcUSD 홀더들은 다음과 같은 새로운 기회를 얻을 수 있습니다:코어 비트코인 유동화 혁신코어네트워크 상에 WBTC, BTCB, LstBTC를 담보로 스테이블코인 발행 가능비트코인을 매도하지 않고 유동성 확보비트코인을 담보로 발행한 스테이블코인으로 디파이 서비스 활용하여 추가 수익을 창출 가능2. 코어 스파크(Core Spark) 인센티브 및 추가 수익 기회 제공디앱(DApp) 포인트 및 네이티브 토큰 지급: 코어 생태계에서 BtcUSD를 활용한 참여만으로 ‘코어 이그니션’ 프로그램으로부터 추가 리워드 수령 가능장기적 수익 잠재력: 빠른 성장중인 코어의 생태계 확장에 따른 높은 수익 가능성코어에 대하여코어는자기 보관(Self-Custodial)방식의 비트코인 스테이킹을 최초로 가능하게 한 지분증명(Proof of Stake)레이어로, 완전한 EVM(Ethereum Virtual Machine) 호환성을 갖춘 BTCFi 생태계를 구축합니다.2024년 4월 이후로 5,399개 이상의 비트코인(약7,385억 원)이 코어에 스테이킹되면서 비트코인의 유용성과 보안이 강화되었습니다. 또한, 코어는 약 78%의 비트코인 채굴 해시 파워가 네트워크 보안에 기여하는, 비트코인과 가장 밀접하게 정렬된 EVM 블록체인입니다.이러한 혁신으로 코어는 수백만 명의 유저를 확보했습니다. 2023년 1월 메인넷 출시 이후 3,000만 개 이상의 고유 주소와 3억 2천만 건 이상의 트랜잭션을 기록했으며, 총 락업 자산(TVL)은 1조 2천억원을 넘어섰습니다.바이프로스트에 대하여바이프로스트 네트워크의 크로스체인 기술로 구동되는BTCFi는 스테이블코인 BtcUSD로 비트코인을 보유하며 추가 수익 창출을 가능하도록 하는 선도적인 비트코인 유동화 서비스입니다. BTCFi는최초의 네이티브 비트코인 담보 부채 포지션(CDP) 프로토콜로, 비트코인을 매도하지 않고도 유동성을 확보할 수 있도록 설계되었습니다.BTCFi를 통해 사용자는 고정 이자율 3.5%라는 낮은 비용으로 비트코인을 담보로BtcUSD를 발행할 수 있습니다. 또한, 50% 초과 담보율과 함께 네이티브 비트코인으로 연 2~3%의 안정적인 수익을 얻을 수 있어 비트코인의 활용성을 크게 확장합니다.바이프로스트의 큰 그림바이프로스트와 코어는비트코인 디파이의 혁신을 목표로 세 가지를 중점적으로 생각합니다:비트코인 활용성 극대화비트코인 기반 자산을 결합하여 유저가 비트코인을 보유한 채로 추가적인 유동성을 얻을 수 있게 합니다.편리하고 안전한 사용자 경험바이프로스트의 EVM 상호운용성을 통해 코어와 결합하여 전통적인 비트코인 금융을 혁신적인 디파이 경험으로 재탄생시킵니다.비트코인 생태계 확장이번 파트너십을 통해 비트코인 기반 금융 상품을 개척하며, 비트코인 생태계를 확장하는 데 기여하고 있습니다.앞으로 바이프로스트는비트코인 디파이및 비트코인 기반 금융 상품의 확장을 통해 비트코인 생태계 성장을 지속적으로 지원할 것입니다. 더 큰 혁신을 가져올 바이프로스트의 미래를 기대해주세요!"
  },
  {
    "title": "바이프로스트 네트워크 노드 밸리데이터로 비트트레이드(BitTrade) 합류",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EB%85%B8%EB%93%9C-%EB%B0%B8%EB%A6%AC%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A1%9C-%EB%B9%84%ED%8A%B8%ED%8A%B8%EB%A0%88%EC%9D%B4%EB%93%9C-bittrade-%ED%95%A9%EB%A5%98-0a04b59b3bf5",
    "content": "바이프로스트 네트워크 노드 밸리데이터로 비트트레이드(BitTrade) 합류Bifrost·FollowPublished in바이프로스트·Nov 29, 2024--ShareIntroduction일본의 암호자산 거래소인비트트레이드 주식회사(BitTrade)가 Bifrost Network의 검증자로서 협력 관계를 맺게 되었습니다. BitTrade는 일본에서 처음으로 Bifrost Network의 밸리데이터로 참여하게 됩니다. BitTrade는 Bifrost Network가 운영하는 노드의 검증에 협력하여, Web3의 더 큰 발전을 목표로 협업할 것입니다.Meaning of Partnership이번 일본의 암호자산 거래소인 비트트레이드와의 파트너십 체결 목적은 Bifrost Network의 검증자로서 참여하는 것입니다. 이번 비트트레이드의 검증자 참여는 Bifrost Network의 안전성과 신뢰성을 한층 더 높이는 획기적인 이정표가 될 것이며, 이는 Bifrost의 글로벌 네트워크 확장에 있어 중요한 전환점이 될 것으로 기대됩니다.About Partner비트트레이드는 자사의 블록체인 기술과 보안 시스템의 강점을 활용하여, 지금까지 다양한 사업자들에게 기술 제공 지원 등을 해왔습니다. 취급 종목은 42종류로 풍부한 종목을 구비하고 있습니다(2024년 11월 기준). 또한, 거래소의 수수료는 무료이며, 룰렛 캠페인 등 다양한 캠페인을 전개하여 많은 분들의 사랑을 받고 있습니다.BitTrade SNSX:https://x.gd/kqtiE"
  },
  {
    "title": "BitTrade Joins as a Node Validator of Bifrost Network",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bittrade-joins-as-a-node-validator-of-bifrost-network-fcad05b367b0",
    "content": "BitTrade Joins as a Node Validator of Bifrost NetworkBifrost·FollowPublished inBifrost·1 min read·Nov 29, 2024--ListenShareIntroductionBitTradeCo., Ltd., a Japanese cryptocurrency exchange, has established a strategic partnership as a validator for Bifrost Network. BitTrade will participate from Japan as a validator for Bifrost Network. The company will cooperate in validating nodes operated by Bifrost Network, aiming for further development of the Web3 industry.Meaning of PartnershipThe purpose of this partnership with BitTrade, a Japanese cryptocurrency exchange, is to have BitTrade as a validator for Bifrost Network. BitTrade’s participation as a validator will serve as a groundbreaking milestone in enhancing the security and reliability of Bifrost Network, and is expected to become a crucial turning point in Bifrost’s global network expansion.About PartnerBitTrade has been providing technical support to various businesses by leveraging its strengths in blockchain technology and security systems. The exchange offers a rich variety of 42 different cryptocurrencies (as of November 2024). Additionally, the exchange offers zero trading fees and conducts various campaigns including roulette promotions, earning the loyalty of many users.BitTrade’s SNSX:https://x.gd/kqtiE"
  },
  {
    "title": "Biquid 공식 출시: 바이프로스트의 혁신적인 유동성 스테이킹 서비스",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/biquid-%EA%B3%B5%EC%8B%9D-%EC%B6%9C%EC%8B%9C-%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8%EC%9D%98-%ED%98%81%EC%8B%A0%EC%A0%81%EC%9D%B8-%EC%9C%A0%EB%8F%99%EC%84%B1-%EC%8A%A4%ED%85%8C%EC%9D%B4%ED%82%B9-%EC%84%9C%EB%B9%84%EC%8A%A4-1174c34fed26",
    "content": "Biquid 공식 출시: 바이프로스트의 혁신적인 유동성 스테이킹 서비스Bifrost·FollowPublished in바이프로스트·6 min read·Nov 28, 2024--ShareBiquid 개요바이프로스트의 혁신적인 유동성 스테이킹 서비스인 Biquid가 공식 출시되었습니다.Biquid는 BFC 보유자가약 10%의 안정적인 스테이킹 수익과 더불어 유동성까지 제공할 수 있도록 하는 혁신적 접근을 제시합니다. 기존 스테이킹 방식에서는 자산을 일정 기간 동안 락업(Lockup)해야 하며 추가적인 유동화가 불가능해 활용에 제한적이었습니다. 그러나 이제는Biquid에 BFC를 스테이킹하여 손쉽게 stBFC 또는 wstBFC를 수령하고, 다양한 디파이 서비스에서 유연하게 활용할 수 있습니다.Biquid는 사용자들에게 높은 수익성과 유연성을 제공하며, 바이프로스트 생태계 확장과 더불어 디파이 시장에서 새로운 가능성을 열어갈 것입니다.Biquid의 매커니즘은 다음과 같습니다:Biquid 매커니즘Biquid가 무엇인지 더 자세히 알아보겠습니다.Biquid의 유동성 스테이킹 토큰: stBFC & wstBFCstBFC와 wstBFC는 Biquid에 BFC를 스테이킹할 시 얻는 토큰입니다.두 토큰 모두 BFC를 스테이킹하여 얻을 수 있으며 다른 디파이 서비스를 활용하여 수익을 창출할 수 있다는 공통점이 있지만, 보상을 반영하는 방식이 다르다는 특징이 있습니다. (wstBFC는 stBFC가 한번 더 wrapped 된 토큰입니다.) stBFC는 시간이 지남에 따라 토큰의 수량이 증가하는 반면, wstBFC는 토큰의 가치가 상승하므로 각각의 특성에 맞는 활용처가 다릅니다.그러나 어느 토큰을 선택하더라도 동일한 보상을 받을 수 있으니 안심하셔도 좋습니다!stBFC와 wstBFC 보상 방식 차이stBFC와 wstBFC의 차이점stBFC와 wstBFC 활용 방법BiFi 담보 대출을 통한 레버리지 활용:BiFi에 wstBFC를 담보로 예치하여 다른 자산을 대출받고, 이를 통해 추가적인 수익을 창출할 수 있습니다.Everdex 유동성 공급으로 추가 수익:Everdex의 wstBFC가 포함된 풀에 유동성을 공급함으로써 유동성 공급 보상과 스테이킹 보상을 동시에 얻을 수 있습니다.Biquid는 앞으로도 지속적으로 (w)stBFC를 지원하는 디파이 서비스를 확대할 계획입니다. 이를 통해 BFC의 활용도는 더욱 높아질 것이며, 사용자는 더 많은 수익 기회를 얻을 수 있을 것입니다.Biquid의 강점최적의 사용자 경험과 높은 수익성Biquid에 BFC를 스테이킹하면대략 연 10%수준의 보상(변동 가능)을 받을 수 있으며, stBFC나 wstBFC로 추가 수익을 창출할 수 있습니다. 기존 스테이킹 방식에서는 노드마다 이자율과 수수료의 차이가 존재하여, 사용자가 최대 수익을 얻기 위해서는 최적의 노드를직접 선택후 스테이킹을 진행해야 했습니다.그러나 Biquid는 이러한 불편함을 해소하면서 사용자가 더욱 손쉽게 높은 수익을 얻을 수 있도록 개발되었습니다.Biquid는 수익성이 가장 높은 노드에 BFC를 자동으로 위임하여, 사용자에게 최적의 경험과 높은 수익을 제공합니다. Biquid는 기존 스테이킹 방식보다 BFC 보유자들에게 훨씬 매력적인 선택지가 될 것입니다.자유로운 유동성기존 스테이킹 방식과 달리,Biquid를 통해 스테이킹된 BFC는 락업(Lockup) 부담 없이 자유롭게 사용할 수 있습니다.그 이유는 사용자가 Biquid에 BFC를 스테이킹한 증표로 (w)stBFC를 받기 때문입니다. 사용자는 12시간마다 BFC로 인한 스테이킹 보상을 받으면서도, stBFC 또는 wstBFC를 디파이에서 활용하여 스테이킹된 BFC와 동일한 금액을 자유롭게 유동화하는 효과를 누릴 수 있습니다. 즉, BFC 스테이킹 시 stBFC와 wstBFC를 다른 디파이에서 활용하더라도 스테이킹 보상을 받을 수 있게 함으로써 BFC의 유동성과 활용성을 더욱 높였습니다.안정성과 기술적 독보성Biquid는 바이프로스트 네트워크의 레이어 1 프로토콜 보안성에 기반하여 고도의 안전성을 제공합니다. 크로스체인 통신 과정에서 릴레이어의 교차검증을 통해 안정적인 검증 절차를 유지하며, 유명 보안 업체인 Theori의 검증을 통해 더욱 견고한 보안을 보장합니다. 기술적으로는 온체인에서 직접 보상을 수집하는 방식으로, 외부 오라클 의존도를 낮추고, 보상 수령 과정을 간소화했습니다. 또한, 자체 검증자 노드를 운영하지 않고 기존 네트워크 검증자에게 위임함으로써 중앙화 위험을 줄이고 네트워크 탈중앙성을 유지합니다. 이러한 구조로 인해 슬래싱 위험이 없어 Biquid 사용자는 자산 손실의 걱정 없이 안전하게 스테이킹할 수 있습니다.스테이킹 및 언스테이킹 절차BFC 스테이킹 절차사용자가 스테이킹한 BFC는수익성과 안정성 측면에서 최적의 검증인에게 자동으로 위임됩니다. 검증인은 이를 활용하여 네트워크의 규칙에 따라 트랜잭션을 검증하고 새로운 블록을 생성하며, 바이프로스트 네트워크 안정성 강화에 활용합니다. 이 과정에서 검증인과 사용자 모두에게 보상이 분배됩니다.BFC 언스테이킹 절차언스테이킹은 바이프로스트 네트워크에 스테이킹된 BFC를 다시 사용할 수 있도록 잠금 해제하는 과정입니다. 사용자는 stBFC 또는 wstBFC로 언스테이킹을 요청할 수 있으며,언스테이킹 요청 후 일정 기간(최대 7일)이 지나면 BFC를 출금할 수 있습니다.사용자가 언스테이킹을 요청하면, 다음과 같은 과정으로 진행됩니다.언스테이킹 요청 시 해당 요청에 사용된 토큰은 소각되고, 언스테이킹 요청 일시와 수량 등의 정보를 담은Withdrawal NFT가 발행됩니다.언스테이킹 처리 기간이 지나면 사용자는 Withdrawal NFT를 이용하여 BFC 출금을 요청할 수 있으며, NFT 정보 기반으로 BFC가 출금됩니다.출금이 완료되면 Withdrawal NFT가 소각됩니다.Withdrawal NFT는 언스테이킹에서 출금까지의 과정을 위한 도구입니다.지갑에서 해당 NFT가 보이지 않더라도, 계정 내에 정상적으로 존재하니 걱정하지 마세요!Biquid를 통한 디파이의 혁신Biquid는 최적의 사용자 경험으로 스테이킹 보상과 유동성 확보를 동시에 누릴 수 있는 혁신적인 서비스입니다. 안정적인 수익 창출과 높은 유동성을 원하는 투자자들에게 Biquid는 최고의 선택이 될 것입니다. 앞으로도 다양한 디파이 플랫폼과의 연계를 통해 BFC의 활용도를 극대화하고, 사용자에게 더 많은 기회를 제공할 계획입니다.Biquid와 함께 디파이 세계에서 새로운 가능성을 탐험하며, 바이프로스트 생태계의 확장을 기대해주세요!"
  },
  {
    "title": "Biquid Official Launch: Bifrost’s Innovative Liquid Staking Service",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/biquid-official-launch-bifrosts-innovative-liquid-staking-service-9df85c2a5591",
    "content": "Biquid Official Launch: Bifrost’s Innovative Liquid Staking ServiceBifrost·FollowPublished inBifrost·4 min read·Nov 28, 2024--ListenShareOverview of BiquidWe are thrilled to announce the launch of Biquid, a liquid staking service designed to bring new flexibility to BFC stakers.Biquid allows users to earn staking rewards ofapproximately 10%while simultaneously gainingadditional profitsthroughstBFC or wstBFC.Traditional staking required assets to be locked up, limiting liquidity and usability. With Biquid,users can easily stake BFC to receive stBFC or wstBFC, enabling flexible use across various DeFi services.Biquid offers high profitability and flexibility, driving the growth of the Bifrost ecosystem while unlocking new opportunities in the DeFi market.Here’s how the Biquid mechanism works:Biquid MechanismLet’s take a closer look at what Biquid is.stBFC & wstBFC: Liquid Staking Tokens of BiquidstBFC and wstBFC are tokens obtained by staking BFC through Biquid.Both tokens share the common feature of being earned through BFC staking and can be used to generate additional income through various DeFi services. However, they differ in how they reflect rewards. (wstBFC is a wrapped version of stBFC.) While stBFC increases in quantity over time, wstBFC gains value instead, making each token suited for different use cases.Regardless of which token you choose, you’ll receive the same rewards, so there’s nothing to worry about!Difference in the Reward Mechanism between stBFC and wstBFCComparison of stBFC & wstBFCHow to Use stBFC & wstBFCLend Assets on BiFi:Deposit wstBFC on BiFi as a collateral then lend assets to generate additional profits.Provide Liquidity on Everdex Pool:Anyone can provide liquidity on the wstBFC pool to earn LP rewards from Everdex and staking rewards from Biquid at the same time.Biquid will continue to expand DeFi services that support stBFC and wstBFCshortly to increase the usage of BFC and provide more opportunities to generate profits with BFC.Strengths of BiquidOptimal User Experience and High ProfitabilityBy staking BFC on Biquid, users can earnapproximately 10% APY(variable) and generate additional rewards using stBFC and wstBFC. Previously, staking rewards and interest fees varied across validators,requiring users to manually compare optionsto maximize profits — a time-consuming and tedious process.Biquid automatically delegates BFC to the most profitable nodes with optimized returns.Not only does Biquid provide higher APY when compared to the preexisting staking service, but also provides enhanced user experience. Biquid will be a far more attractive option for BFC holders compared to traditional staking methods.Flexible LiquidityUnlike traditional staking methods,Biquid allows staked BFC to be used freely without the burden of a lockup period.This is because users receive (w)stBFC as proof of their staked BFC. While earning staking rewards every 12 hours, users can also utilize stBFC or wstBFC in DeFi, effectively achieving liquidity equivalent to the staked BFC.In other words, even when stBFC or wstBFC is used in other DeFi platforms, staking rewards for BFC continue to accumulate. This significantly enhances the liquidity and usability of BFC, making it a more versatile asset in the DeFi ecosystem.Industry Leading SecurityBifrost Network ensures layer 1 protocol-level security via cross-validation by relayers for cross-chain communication and has been audited by Theori, a leading security firm. Biquid is a decentralized liquid staking service operating on top of highly secured network, with all transactions recorded on-chain for transparency.Staking and Unstaking ProcessBFC Staking ProcessBFC staked on Biquid areautomatically delegated to validators that offer optimal profitability and reliability.These validators use the staked BFC to validate transactions, create new blocks, and contribute to the stability of the Bifrost network. During this process, rewards are distributed to both the validators and the users, ensuring mutual benefit.BFC Unstaking ProcessUnstaking is the process of unlocking staked BFC on the Bifrost network. Users can request to unstake with either stBFC or wstBFC, andafter a designated period (up to 7 days) following the unstaking request, they will be able to withdraw their BFC.When a user submits an unstaking request, the process proceeds as follows:Upon the unstaking request, the tokens used in the request are burned, and aWithdrawal NFTis issued. This NFT contains information such as the timestamp of the request and the amount being unstaked.After the unstaking period is completed, the user can request a BFC withdrawal using the Withdrawal NFT. The BFC is then withdrawn based on the information stored in the NFT.Once the withdrawal is complete, the Withdrawal NFT is burned.The Withdrawal NFT serves as a tool to manage the process from unstaking to withdrawal.Even if the NFT doesn’t appear in your wallet, don’t worry — it exists within your account and is functioning correctly!Driving DeFi Innovation with BiquidBiquid is an innovative service that offers the perfect combination of staking rewards and liquidity, delivering an optimal user experience. For investors seeking stable returns and high liquidity, Biquid will be the ultimate choice.Moving forward, Biquid plans to maximize the utility of BFC by integrating with various DeFi platforms, providing users with even more opportunities.Explore new possibilities in the world of DeFi with Biquid and look forward to the expansion of the Bifrost ecosystem!"
  },
  {
    "title": "바이프로스트, 일본 메인넷 Japan Open Chain에 투자",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EC%9D%BC%EB%B3%B8-%EB%A9%94%EC%9D%B8%EB%84%B7-japan-open-chain%EC%97%90-%ED%88%AC%EC%9E%90-5f4f86f0b828",
    "content": "바이프로스트, 일본 메인넷 Japan Open Chain에 투자Bifrost·FollowPublished in바이프로스트·3 min read·Sep 26, 2024--Share바이프로스트는 일본 시장으로의 생태계 확장을 위해 일본 스테이블코인 분야를 선도하는 Japan Open Chain(JOC)에 전략적 투자를 진행하였습니다. 이번 파트너십을 통해 바이프로스트는 자사가 보유한 멀티체인 기술의 네트워크 확장과 일본 및 글로벌 Web2 기업들의 Web3 진입을 촉진하는 실용적인 블록체인 생태계 구축을 목표로 삼고 있습니다.Japan Open Chain(JOC) 소개Japan Open Chain(JOC)은 일본의 블록체인 기술 도입을 선도하는 핵심 프로젝트입니다. JOC는 이더리움 호환 레이어1 블록체인으로, 실용적인 비즈니스 응용에 초점을 맞추어 빠르고 저렴하며 안전한 거래를 지원합니다.JOC는 일본을 넘어 글로벌 시장을 목표로 하는 일본 블록체인 업계의 선도적인 프로젝트 입니다. 엔화 스테이블코인 인프라를 제공하며, 소니 그룹, NTT 도코모, 후지쯔, 덴쯔 등 세계적인 기업들과 협력하고 있습니다. 이러한 파트너십을 통해 JOC는 일본 국내 뿐만 아니라 국제 시장에서의 입지를 강화하고 있습니다.또한 검증인, 상호운용성 제공자, 스테이블코인 파일럿 파트너로 구성된 포괄적인 Web3 인프라를 구축하여 일본 및 국제 규정을 준수하고 있습니다. 이를 통해 일본 블록체인 생태계에서 주요 플레이어로 자리매김하고 있습니다.JOC의 파트너사 목록주요 협력 내용크로스체인 기술 지원: 바이프로스트는 JOC 체인의 상호운용성 개선을 위한 기술 지원을 제공합니다.네트워크 활성화: 바이프로스트는 BTCFi를 활용한 DApp 등 서비스를 JOC 네트워크에 배포하여 네트워크 활성화에 기여합니다.브릿지 배포:JOC는 Bifrost의 브릿지를 JOC 상에 배포하는 것을 지원합니다.공동 마케팅 활동: 양사는 각 시장에서의 인지도 향상을 위한 공동 마케팅 활동을 진행합니다.기대 효과이번 파트너십을 통해 바이프로스트는 일본 시장 진출을 가속화하고, JOC는 글로벌 크로스체인 생태계와의 연결성을 강화할 것입니다. 양사는 이번 협력이 Web3 기술의 실용적인 응용을 촉진하고, 대중화에 중요한 기여를 할 것으로 기대하고 있습니다.구체적인 협력 방안과 마케팅 전략에 대한 세부 사항은 추후 공식 발표를 통해 공개될 예정입니다."
  },
  {
    "title": "Bifrost Announces Strategic Partnership and Investment in Japan Open Chain (JOC)",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-announces-strategic-partnership-and-investment-in-japan-open-chain-joc-160fabaa3e48",
    "content": "Bifrost Announces Strategic Partnership and Investment in Japan Open Chain (JOC)Bifrost·FollowPublished inBifrost·2 min read·Sep 26, 2024--ListenShareWe are pleased to announce that Bifrost has entered into a strategic partnership and made a strategic investment with Japan Open Chain (JOC). This collaboration aims to expand blockchain networks through multichain technology and create a true blockchain ecosystem that facilitates the entry of Web2 businesses into Web3.About Japan Open Chain (JOC)Japan Open Chain(JOC) is a leading project driving blockchain technology adoption in Japan, focusing on practical business applications. It is an Ethereum-compatible Layer 1 blockchain known for its fast, affordable, and secure transactions. JOC is not only focused on Japan but also aims to expand into global markets. JOC boasts a robust infrastructure with yen-denominated stablecoins and extensive collaborations with global top players like Sony Group, NTT Docomo, Dentsu, and Fujitsu. Its ecosystem includes validators, interoperability providers, and stablecoin pilot partners, ensuring a comprehensive and compliant Web3 infrastructure, solidifying its place as a key player in the Japanese blockchain ecosystem.The list of JOC partnersKey Aspects of the CollaborationTechnical Support for Cross-Chain Technologies: Bifrost will provide technical support to enhance the interoperability of the JOC chain.Network Activation: Bifrost will contribute to network activation by deploying services such as DApps utilizing BTCFi on the JOC network.Bridge Adoption: JOC will provide support for the deployment of Bifrost’s bridge on the JOC networkJoint Marketing Activities: Both parties will conduct joint marketing activities to increase awareness in their respective markets.Expected OutcomesThis partnership is expected to accelerate Bifrost’s entry into the Japanese market while strengthening JOC’s connectivity with the global cross-chain ecosystem. Through this strategic investment, Bifrost also seeks to expand its ecosystem in Japan’s stablecoin sector, contributing to the practical application and popularization of Web3 technologies.More detailed announcements regarding specific collaborative projects and marketing initiatives will be made in the near future."
  },
  {
    "title": "바이프로스트 파트너로 ‘THEPOL’ 합류",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%ED%8C%8C%ED%8A%B8%EB%84%88%EB%A1%9C-thepol-%ED%95%A9%EB%A5%98-f0dd01c5bd8e",
    "content": "바이프로스트 파트너로 ‘THEPOL’ 합류Bifrost·FollowPublished in바이프로스트·3 min read·Sep 12, 2024--Share바이프로스트의 공식 파트너로 블록체인 기반 온라인 폴 서비스를 제공하는 THEPOL을 소개합니다!THEPOL은 이번 파트너십을 통해 바이프로스트 네트워크의 디앱(DApp)으로 합류합니다! 이로써 THEPOL에서는 획득한 포인트를 BFC로 교환할 수 있게 되었으며, THEPOL 내에서 BFC가 지원됩니다. 또한 THEPOL에서 발생하는 상당한 수의 트랜잭션이 바이프로스트 네트워크의 활성화를 더욱 촉진할 것으로 기대됩니다. 앞으로 지속적으로 확장해나갈 바이프로스트 네트워크를 기대해주세요!THEPOL에 관하여THEPOL은 블록체인 기반 온라인 폴 서비스를 제공하는 설문조사 앱테크 플랫폼으로, 유저는 여러 투표에 참여하고 포인트를 획득할 수 있습니다. 적립된 포인트는 인앱에서 상품 구매에 활용할 수 있으며, 기존에는 일반 포인트와 META 토큰으로 포인트가 지급되어왔습니다.THEPOL은 38만 KYC 인증 사용자, 일간 활성 사용자(DAU) 3만, 일일 앱 접속자 참여율 80%이라는 강력한 지표와 높은 리텐션율을 자랑합니다. 설문조사 외에도 뉴스폴, 퀴즈폴, 예측폴 등 다양한 기능을 업데이트하며 이러한 성과를 이뤄냈으며, 앞으로 더 많은 기능 업데이트를 진행하며 서비스를 확장할 계획입니다.바이프로스트에 관하여바이프로스트는 EVM, non-EVM을 모두 지원하는 멀티체인 레이어 1 네트워크입니다. 체인간 호환을 통해 다양한 크로스체인 기능을 제공하며, 멀티체인 디앱(DApp)이 구동될 수 있는 최적의 환경을 제공합니다. 현재 바이프로스트의 주력 서비스는 BTCFi로, 최적의 비트코인 유동화 서비스를 목표로 하고 있습니다. BTCFi에서는 비트코인을 담보로 비트코인 담보 스테이블코인 BtcUSD를 발행하고, 이를 통해 추가 수익을 창출할 수 있는 기회를 제공합니다.BTCFi에 대해 더 알아보기에어드랍 이벤트바이프로스트와 THEPOL의 파트너십 발표를 기념하며 THEPOL에서는 현재 2개의 에어드랍 이벤트를 진행하고 있습니다. 모두 참여하여 보상을 놓치지 마세요!1. THEPOL에서 진행하는 BFC 오픈기념 1/N 에어드랍THEPOL에서 BFC를 보유하기만 해도 이벤트에 참여가 완료됩니다.9월 2일부터 진행하여 9월 19일까지 진행하므로, 잊지 말고 참여해보세요!이벤트 참여 링크 바로가기2. THEPOL에서 진행하는 BTCFi 퀴즈폴THEPOL의 퀴즈폴 탭에서 BTCFi에 대한 퀴즈를 풀면 보상을 받을 수 있습니다.9월 12일부터 진행하며 9월 19일까지 진행하므로, 이 이벤트도 놓치지 마세요!바이프로스트의 주력 서비스인 BTCFi를 이해하고 포인트 파밍까지, 일석이조의 기회를 놓치지 마세요!이벤트 참여 링크 바로가기"
  },
  {
    "title": "Announcing ‘THEPOL’ as a Partner of Bifrost",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/announcing-thepol-as-a-partner-of-bifrost-a4fe221bc76d",
    "content": "Announcing ‘THEPOL’ as a Partner of BifrostBifrost·FollowPublished inBifrost·2 min read·Sep 12, 2024--ListenShareIntroducing THEPOL, a blockchain-based online polling service, as an official partner of the Bifrost network!Through this partnership, THEPOL joins Bifrost as a decentralized application (DApp). With this integration, users of THEPOL can now exchange their earned points for BFC and BFC will be supported within the THEPOL platform. The significant number of transactions occurring within THEPOL is expected to further activate the Bifrost network. Stay tuned for the continued expansion of Bifrost Network!About THEPOLTHEPOL is a survey app-tech platform offering blockchain-based online polling services. Users can participate in various polls and earn points. These accumulated points can be used to purchase items within the app. Previously, points were provided in the form of standard points and META tokens.THEPOL boasts impressive user engagement statistics, including 380K KYC-verified users, 30K daily active users (DAU), and an 80% daily participation rate. These results have been achieved through a diverse array of features such as survey polls, news polls, quiz polls, and prediction polls. THEPOL plans to continue expanding its services by introducing more features in the future.About BifrostBifrost is a multi-chain Layer 1 network that supports both EVM and non-EVM environments. By enabling cross-chain interoperability, it provides an optimal environment for multi-chain decentralized applications (DApps). Bifrost’s flagship service is BTCFi, which aims to offer comprehensive Bitcoin liquidation services. Through BTCFi, users can issue the Bitcoin-backed stablecoin BtcUSD by using Bitcoin as collateral, creating opportunities for additional revenue generation.Learn more about BTCFi here.Airdrop EventsTo celebrate the partnership between Bifrost and THEPOL, two airdrop events are currently underway. Don’t miss out on your chance to earn rewards!1. BFC Launch 1/N Airdrop on THEPOLSimply hold BFC on THEPOL, and you will automatically participate in this event.The event runs from September 2 to September 19, so make sure to join before it ends!Join event here2. BTCFi Quiz Poll on THEPOLParticipate in the BTCFi quiz through THEPOL’s Quiz Poll tab to earn rewards.The event starts on September 12 and runs until September 19, so be sure to participate!Learn more about Bifrost’s flagship service, BTCFi, and earn points through farming — a two-in-one opportunity!Join event here"
  },
  {
    "title": "Bifrost x Slash Vision Labs Airdrop",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-x-slash-vision-labs-airdrop-7e1946e409de",
    "content": "Bifrost x Slash Vision Labs AirdropBifrost·FollowPublished inBifrost·2 min read·Jul 31, 2024--ListenShareIntroductionAfter a partnership with Slash Vision Labs, we are thrilled to have collaborative airdrop campaigns.Bifrost Network and Slash Vision Labs will airdrop $30,000 worth of BFC and Alice NFTs to our users. Through this airdrop, Bifrost Network users and Slash Vision Labs users can benefit and learn more about Bifrost Network’s BTCFi and Slash Vision Labs ecosystem.Here are the detail information of the airdrop:How to ParticipateStep 1: Stake $SVL on Slash Vision Portal (Embed URL)Stake $SVL on the SVL Portal to gain over 10,000 Voting Power.Voting Power can be calculated in the following way.Your Current Voting Power (non-boosted) = Staked SVL * Voting Power Potential (In reward calculations, the voting power is multiplied by the boost rate)Example:10000 Voting Power = 10000 SVL * 100% (2 Years Staked)Table：Percentage of Voting Power acquired when SVL is lockedStep 2: Use Bifrost Network’s BTCFi (Embed URL) After staking $SVL tokens, engage with Bifrost Network’s BTCFi by following these steps:Stake BTC and mint BtcUSD on Bifrost Network’s BTCFiDeposit at least 100 BtcUSD into BiFiBy completing these steps, you’ll be eligible to receive $50 worth of BFC tokens. This offer is limited to the first 200 participants who complete both steps.NotesApart from airdrop, you can earn an extra 14.53% APY by staking BtcUSD on BiFi. When you supply BtcUSD on BiFi, you don’t need to repurchase BtcUSD to withdraw.Apart from airdrop, you can earn an extra 10.69% APY by staking BtcUSD/USDC pool on Everdex.There is a fixed borrow rate of 3.5% for BtcUSD.Instructions on how to utilize BTCFi are available in our Gitbook and YouTube videos.Participants who fulfill both steps will receive an exclusive Alice NFT from Slash Vision Labs valued at $170.TimeframeStaking period: August 1, 2024 — August 10, 2024Holding period: Until September 10, 2024Airdrop distribution: After September 10, 2024, to users who maintained their stake throughout the holding periodDon’t miss this opportunity to experience Bifrost Network’s BTCFi and Slash Vision Labs ecosystems while earning rewards!Note: This event is limited to the first 200 eligible participants. We will closely monitor participation, especially during the first three days of the event. The campaign may close early if the participant limit is reached."
  },
  {
    "title": "바이프로스트, 글로벌 1위 Perp DEX 신퓨처스와 전략적 파트너십 체결",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EA%B8%80%EB%A1%9C%EB%B2%8C-1%EC%9C%84-perp-dex-%EC%8B%A0%ED%93%A8%EC%B2%98%EC%8A%A4%EC%99%80-%EC%A0%84%EB%9E%B5%EC%A0%81-%ED%8C%8C%ED%8A%B8%EB%84%88%EC%8B%AD-%EC%B2%B4%EA%B2%B0-5f89a0f0a836",
    "content": "바이프로스트, 글로벌 1위 Perp DEX 신퓨처스와 전략적 파트너십 체결Bifrost·FollowPublished in바이프로스트·3 min read·Jul 30, 2024--Share바이프로스트가 세계 최고의 Perp DEX인 신퓨처스(SynFutures)와 전략적 파트너십을 체결했습니다. 이번 협력은 바이프로스트의 크로스체인 기술과 신퓨처스의 전문적인 합성자산 기술을 결합하여 디파이(DeFi) 생태계에 새로운 혁신을 가져오기 위한 것입니다.2020년 출범한 신퓨처스는 안전하고 사용자 중심적인 서비스를 제공하기 위해 지속적인 제품 개발과 발전을 거듭해왔습니다. Pantera, Hashkey Capital, Polychain, Framework Ventures, Standard Crypto, Dragonfly, Bybit, CMS, Wintermute, Woo, IOSG Ventures 등 업계를 선도하는 투자사들로부터 투자를 유치하며 가치를 높여오고 있습니다. 신퓨처스 V3에 이른 지금 약 138조원의 거래량을 기록하며, 모든 탈중앙화 거래소 중에서 단연 돋보이는 최고의 거래량을 달성하였습니다.이번 파트너십의 핵심은 BtcUSD가 BTCFi를 넘어 신퓨처스 플랫폼으로 통합되는 새로운 단계로 접어들었다는 것입니다.이를 통해 BtcUSD는 신퓨처스의 DAOPerps에서 거래 가능한 자산으로 등록되어, 사용자들에게 더 많은 거래 옵션을 제공할 예정입니다. 특히, 사용자들은 BtcUSD/USDC 페어에 유동성을 공급하고 최대 10배의 레버리지로 거래할 수 있습니다. 처음 2주간은 50배의 Oyster Odyssey(O_O) 부스트를 받고, 그 이후부터 10배의 부스트를 받을 수 있습니다.BtcUSD는 이러한 협력을 통하여 계속 확장되어 갑니다. 이번 신퓨처스와의 통합도 BtcUSD 사용자들에게 더 높은 수익을 기대할 수 있는 다양한 전략의 길을 열어주며, 이는 곧 BtcUSD의 유동성과 수요 증가로 이어질 것입니다.더불어 이번 파트너십을 통해 바이프로스트 네트워크의 확장성과 안정성이 더욱 강화되었습니다. 신퓨처스의 고도화된 거래 인프라와 바이프로스트의 크로스체인 기술이 결합됨으로써, 양 플랫폼의 사용자들은 더욱 안전하고 효율적인 거래 환경을 경험할 수 있게 될 것입니다.바이프로스트와 신퓨처스는 적극적인 공동 마케팅을 통해 BtcUSD의 활용성을 높일 것이며, AMA, 팟캐스트 등 다양한 채널을 활용하여 사용자들에게 핵심 자산으로서 BtcUSD의 가치를 알릴 계획입니다. 또한, 신퓨처스 x 바이프로스트 퀘스트를 통해 사용자들에게 추가적인 보상 기회를 제공하고자 합니다.바이프로스트와 신퓨처스는 이번 파트너십을 통해 글로벌 디파이 생태계의 발전에 기여하고, 전 세계 사용자들에게 보다 나은 가치를 제공할 수 있기를 기대합니다."
  },
  {
    "title": "Bifrost Announces Strategic Partnership with SynFutures, Global Leader in Perpetual DEXs",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-announces-strategic-partnership-with-synfutures-global-leader-in-perpetual-dexs-37452cd34740",
    "content": "Bifrost Announces Strategic Partnership with SynFutures, Global Leader in Perpetual DEXsBifrost·FollowPublished inBifrost·2 min read·Jul 30, 2024--ListenShareWe are proud to announce that Bifrost has entered into a strategic partnership with SynFutures, the world’s leading decentralized perpetual exchange (Perp DEX). This collaboration aims to accelerate innovation in the DeFi ecosystem by combining Bifrost’s cross-chain technology with SynFutures’ expertise in synthetic asset trading.Since its inception in 2020, SynFutures has consistently developed and updated its products to provide a secure and user-centric service experience. The platform’s commitment to excellence has been recognized by leading industry investors, including Pantera, Hashkey Capital, Polychain, Framework Ventures, Standard Crypto, Dragonfly, Bybit, CMS, Wintermute, Woo, and IOSG Ventures. This consistent growth and development have culminated in SynFutures V3 recently achieving the highest trading volume among all decentralized exchanges, with a remarkable $100 billion in trading volume since 2021, showcasing its dominance in the DeFi space.A key aspect of this partnership is that BtcUSD is advancing to a new phase by integrating beyond BTCFi into the SynFutures platform.This integration will enable BtcUSD to be listed as a tradable asset on SynFutures’ DAOPerps, providing users with expanded trading options. Notably, users will be able to trade and provide liquidity for the BtcUSD/USDC pair with up to 10x leverage. For the first 2 weeks, they will receive a 50x Oyster Odyssey (O_O) boost, followed by a 10x boost afterwards.BtcUSD will continue to expand through this type of collaboration. The integration with SynFutures will open up a range of strategies for BtcUSD users to potentially achieve higher returns, which is expected to lead to increased liquidity and demand for BtcUSD.Furthermore, this partnership has further strengthened the scalability and stability of the Bifrost network. The combination of SynFutures’ advanced trading infrastructure and Bifrost’s cross-chain technology will provide users of both platforms with a safer and more efficient trading environment.Both companies are committed to joint marketing efforts to increase the utility of BtcUSD. We plan to leverage various channels, including AMAs and podcasts, to showcase BtcUSD as a core asset to users. Additionally, users will have the opportunity to participate in the SynFutures x Bifrost Quest for additional rewards.Bifrost and SynFutures are excited about this partnership and look forward to contributing to the advancement of the DeFi ecosystem while delivering greater value to our users globally."
  },
  {
    "title": "Inflation Model",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/inflation-model-4e4a62d920d0",
    "content": "Inflation ModelBifrost·Follow2 min read·May 10, 2024--1ListenShareBFC enables community-driven innovation to benefit global users, relying on contributions from community members, validators, nominators, and developers. This post provides detailed insights into Bifrost Network’s inflation model and estimated BFC supply.The BFC inflation model aims to incentivize Bifrost Network participants and network expansion. Holding BFC without utilizing them incurs an opportunity cost under the current inflation model, resulting in BFC dilution over time.Economic research underscores the importance of maintaining an optimal inflation rate to incentivize network participants and drive growth. Lowering the inflation rate may impede growth, while raising it could disrupt the token’s model. As the inflation rate dynamically adjusts based on network status, it remains subject to change through governance, rather than being permanently fixed.BFC functions as the native currency of the Bifrost Network, operating as a POS network with an inflationary nature. The inflation rate of the Bifrost Network depends on the number of tokens staked, dynamically adjusting to optimize rewards for validators and nominators.To learn more about our inflation system, please refer to ourdocumentation.Below is a chart showing the circulating supply of BFC. The left side shows the circulating of BFC based on the status of the Bifrost Network as of May 2024. Meanwhile, the right side displays the maximum supply of BFC. These predictions reflect the circulating supply of BFC, subject to change based on staking and network conditions."
  },
  {
    "title": "바이프로스트, 일본 가상화폐 결제 플랫폼 Slash Vison Labs에 투자",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EC%9D%BC%EB%B3%B8-%EA%B0%80%EC%83%81%ED%99%94%ED%8F%90-%EA%B2%B0%EC%A0%9C-%ED%94%8C%EB%9E%AB%ED%8F%BC-slash-vison-labs%EC%97%90-%ED%88%AC%EC%9E%90-15833a584886",
    "content": "바이프로스트, 일본 가상화폐 결제 플랫폼 Slash Vison Labs에 투자Bifrost·FollowPublished in바이프로스트·2 min read·May 1, 2024--Share일본 시장으로의 생태계 확장을 위해 가상자산 결제 분야를 선도하는 Slash Vision Labs(SVL)에 투자했습니다. SVL은 안전하고 원활한 가상자산 결제 경험을 제공하기 위해 설립된 프로젝트로, 가상자산의 사용 사례를 확장하여 현실 세계에서 가상자산을 실용적으로 활용할 수 있는 서비스를 개발하는 것에 주력하고 있는 프로젝트입니다.SVL의 주요 서비스인 Slash Payment 및 Slash Card는 가상자산 결제 산업에서 중요한 이정표로 자리매김하고 있습니다. 2022년 10월에 서비스가 시작된 이래, Slash Payment는 2억 달러 이상의 거래를 처리하고 4,000개 이상의 가맹점이 다양한 토큰을 활용할 수 있도록 지원했습니다. 또한, Slash Card는 일본에서 처음으로 승인된 가상자산 담보 신용카드로, 2024년 여름에 출시될 예정입니다. SVL은 Slash Card를 통해 법정 화폐와 가상자산을 원활하게 연결하여 다양한 소비자, 상인, 개발자 및 기관이 가상자산 세계에 진입할 수 있는 길을 열고 있습니다.이번 투자를 통해 양사는 SVL의 주요 서비스에 바이프로스트의 크로스체인 기술을 접목시켜 다양한 블록체인 네트워크 간의 상호 운용성 및 거래 유연성 향상을 지원할 계획입니다. 또한 최근 바이프로스트가 발표한 BTCFi를 활용하여 Slash 서비스 내의 BTC와 스테이블 코인에 대한 결제 대기 자금에 추가 이율을 줄 수 있는 통합 서비스를 구축하기 위해 협력할 예정입니다. Slash Payment는 향후 Bifrost 네트워크를 지원하고 네트워크 상의 토큰들에 대한 결제 지원도 예정하고 있습니다.양사는 이번 파트너십을 통해 가상 자산의 실생활 이용에 필요한 기술적 협력은 물론, 양사가 보유한 마케팅 자원을 활용하여 가상자산 결제의 보편화에 힘을 기울일 예정입니다."
  },
  {
    "title": "Bifrost announces strategic investment into Slash Vision Labs",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-announces-strategic-investment-into-slash-vision-labs-3af0244aad7a",
    "content": "Bifrost announces strategic investment into Slash Vision LabsBifrost·FollowPublished inBifrost·2 min read·May 1, 2024--ListenShareWe are proud to announce Bifrost’s strategic investment in Slash Vision Labs, a pioneer in the cryptocurrency payments landscape. Slash’s innovative ecosystem and its governance token, SVL, are revolutionizing the way we think about crypto payments. This partnership is poised to expand the use cases of cryptocurrencies into daily life, aiming to create tangible, real-life applications for crypto that enhance accessibility and practicality for consumers and businesses alike.Slash’s premier offerings, Slash Payment and Slash Card, mark significant milestones in the industry. Since its inception in October 2022, Slash Payment has processed over $200 million in transactions and enabled more than 4,000 merchants to accept a diverse array of tokens. Additionally, the Slash Card stands out as the first and only crypto-backed credit card in Japan, scheduled to launch in the summer of 2024. It seamlessly bridges fiat and crypto economies, paving the way for a wide range of consumers, merchants, developers, and institutions to enter the cryptocurrency world.This strategic partnership will see Bifrost’s proprietary cross-chain technology applied to Slash’s existing infrastructures. This will have an effect on functionality and reach of Slash’s payment and card services benefiting from improved interoperability and increased transactional flexibility across different blockchain networks. In addition, BTCFi, the ground-breaking service Bifrost recently unveiled, will be used to provide yields on BTC, and both parties will work towards developing a system to utilize assets pending payments.Both companies are committed to joint marketing efforts that utilize our extensive marketing resources. This partnership is poised to propel the real-world adoption and utility of cryptocurrencies and blockchain technology.More detailed announcements regarding our joint efforts will be announced soon."
  },
  {
    "title": "바이프로스트,JCBA 정식 가입",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-jcba-%EC%A0%95%EC%8B%9D-%EA%B0%80%EC%9E%85-6097647282a5",
    "content": "바이프로스트,JCBA 정식 가입Bifrost·FollowPublished in바이프로스트·Apr 19, 2024--Share바이프로스트가 일본가상자산사업자협회(JCBA)의 회원으로 정식 가입했다는 소식을 전해드립니다. JCBA는 일본의 블록체인 산업과 웹3 생태계 성장을 촉진하기 위해 설립된 조직으로, 웹2부터 웹3 기업까지 다양한 회원사로 구성되어 있습니다.JCBA의 회원사들은 전문 지식을 바탕으로 웹3 디지털 자산의 개발 기술과 일본의 암호화폐 관련 법안 마련에 기여하고 있으며, 일본 내 블록체인과 암호화폐를 위한 건전한 환경 조성을 목표로 활동하고 있습니다. 회원사들은 다양한 분야의 세계적인 기업들로, Binance Japan, Coincheck, Deloitte, Rakuten Wallet, Mercari 등으로 구성되어 있습니다.이번 협력을 통해 바이프로스트는 자사의 다양한 인프라를 제공하여 일본 블록체인 산업에서 EVM과 Non-EVM 환경이 원활하게 소통할 수 있도록 기술을 지원하는 등, 일본 내 암호화폐 기술 발전에 기여할 것입니다.또한 바이프로스트는 JCBA 회원사들과 함께, 일본 블록체인 기술의 잠재적 이용자를 위한 서비스 범위를 확대하고, 일본의 블록체인 기술 발전에 기여할 것입니다.JCBA 회원사 소개 —https://bit.ly/3xRcFyL"
  },
  {
    "title": "Bifrost Joins JCBA",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-joins-jcba-60baa74088db",
    "content": "Bifrost Joins JCBABifrost·FollowPublished inBifrost·1 min read·Apr 19, 2024--ListenShareWe are proud to announce that we have joined the Japanese Crypto Asset Blockchain Association. The JCBA is an association with various members from Web2 to Web3 firms to expand the blockchain industry and Web3 ecosystem.JCBA and its members bring their expertise to contribute to the growth of Web3 digital asset development technology and crypto-legislation to create a healthy environment for blockchain and crypto assets in Japan.JCBA members come from various backgrounds and some of the well-known members are Binance Japan, Coincheck, Deloitte, Rakuten wallet, and Mercari. In joining these esteemed members, we aim to play a pivotal role in providing Bitcoin-related interoperability technology, along with other technical capabilities Bifrost is capable of.Bifrost is ready to employ its proprietary technologies and services to the members of JCBA, as part of the frontier that pushes the envelope in blockchain technology in Japan. In doing so, we will be providing seamless integration to EVM and non-EVM environments, as to broaden the horizon in providing services to Japanese B2C customers and in utilizing blockchain as a whole.JCBA official announcement—https://bit.ly/3xRcFyL"
  },
  {
    "title": "BTCFi 공식 출시",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/btcfi-%EA%B3%B5%EC%8B%9D-%EC%B6%9C%EC%8B%9C-aad7bd112087",
    "content": "BTCFi 공식 출시Bifrost·FollowPublished in바이프로스트·4 min read·Apr 17, 2024--ShareBTCFi가 정식 출시되었습니다.블록체인과 디파이 생태계의 확장을 이끌어갈 BTCFi가 정식 출시되었습니다. BTCFi는 바이프로스트 네트워크의 크로스체인 기능을 활용하여 비트코인을 더욱 활용도 높은 자산으로 재탄생할 수 있게 해주는 서비스입니다.BTCFi는 비트코인 기반의 탈중앙화 금융 서비스입니다. 앞으로의 가능성으로 더욱 주목 받고 있는 비트코인을 그대로 보유하면서도 손실에 대한 걱정없이 활용하실 수 있는 길을 열어드립니다. BTCFi 사용자는 비트코인을 기반으로 자산을 빌려서 레버리지의 기회를 얻거나, BtcUSD를 빌려주어 추가 수익을 확보하는 등, 다양한 수익의 기회를 얻을 수 있습니다.너무나 감사하게도, 3월 14일의 Pre-launch 이벤트로 시작하여 BTCFi는 테스트 네트워크 기간 동안 많은 관심을 받았습니다. 참여자 여러분 덕분에 Pre-launch 이벤트 기간이 끝나기도 전에 목표로 하던 120 BTC 이상의 비트코인이 예치되어 이벤트를 예상보다 일찍 마감할 수 있었습니다. 이제 진짜 모습을 드러내는 BTCFi의 공식 출시 이후에도 뜨거운 관심 부탁드립니다.비트코인의 거대한 물결에 여러분과 함께 하고자 BTCFi는 아래와 같은 강력한 특징들을 중심으로 개발되었습니다.탈중앙성과 안정성BTCFi는 바이프로스트 네트워크에서 운영되며 스마트 컨트랙트를 통해 작동함으로써 중앙화 요소를 제거했습니다. 그렇기에 BTCFi는 탈중앙적으로 운영되며, 모든 과정이 바이프로스트 네트워크에 안전하게 기록됩니다. 더욱이 BTCFi는 완벽하게 탈중앙화되어있는 CDP(부채담보부포지션) 방식을 따르고 있으며, 온전하게 탈중앙화되어있는 비트코인만을 담보로 사용합니다. 이러한 노력들을 통하여 BTCFi와 BtcUSD에서는 중앙화 서비스의 불확실한 안정성에 대한 걱정들을 덜어내실 수 있습니다.낮은 대출 금리BTCFi의 가장 매력적인 특징 중 하나는 매우 낮은 대출 금리입니다. 사용자들은 3.5%의 낮은 대출 금리로 BtcUSD를 민팅하여 사용하실 수 있습니다. 이는 디파이 업계 평균 대출 금리보다 훨씬 낮은 수준입니다. 접근성 좋고 매력적인 금리를 바탕으로 비트코인 장기 보유자들이 굳이 비트코인을 매도하지 않고도 BtcUSD를 활용하여 추가 수익을 얻을 수 있습니다안전하고 범용성이 넓은 BtcUSD가 가져 올 새로운 기회들비트코인을 담보로 발행되는 스테이블 코인인 BtcUSD는 BTCFi와 디파이 생태계에 혁명을 가져올 게임 체인저가 될 것입니다. 특히 BtcUSD는 타 가상자산들과 비교하여 가격 변동성 측면에서 매우 안정적인 비트코인을 담보로 하여 발행되므로, 상대적으로 높은 가격 안정성을 갖추고 있습니다. 또한 BtcUSD를 통해 비트코인을 유동화시켜 예금, 대출, 유동성 제공 등 다양한 목적으로 활용하실 수 있습니다.크로스체인 인프라를 바탕으로 한 멀티체인 확장여러 블록체인 네트워크로의 확장이 특기인 바이프로스트 네트워크를 바탕으로 BTCFi 또한 다른 네트워크로 광범위하게 확장하며 활용도를 높여나갈 예정입니다. 앞으로 BTCFi 사용자는 바이프로스트 네트워크를 넘어 다양한 네트워크의 디파이 프로토콜에서 BtcUSD를 사용하실 수 있습니다. 바이프로스트 네트워크는 BTCFi를 중심으로 멀티체인의 비트코인 디파이 발전을 선도하고자 합니다.BTCFi의 자유로운 활용BTCFi는 비트코인을 보유하시는 분이나 보유하지 않으시는 분 모두가 다양하게 활용하실 수 있습니다. 여러분 모두가 BTCFi와 함께하며 수익을 극대화하는 자신만의 최적의 전략을 찾으시길 기대합니다. 예를 들어, 다음과 같은 전략들을 적용하실 수 있습니다.바이프로스트 네트워크의 예금 및 대출 플랫폼인 BiFi에서 안정적인 수익을 올리실 수 있습니다. BiFi에 BtcUSD를 예치한 후 다른 자산을 대출하여 손실 걱정 없이 안정적인 수익을 창출할 수 있습니다.추후 지원될 스택스 생태계의 서비스인ALEX에서도 위에서 언급된 활용법과 동일한 방법으로 BtcUSD를 활용하여 안정적인 수익을 얻으실 수 있습니다.비트코인을 보유하면서 타 가상자산을 보유하고 싶으시다면, BTCFi에 비트코인을 예치하신 다음 BtcUSD를 발행 후 스왑을 통해 타 가상자산도 동시에 보유하실 수 있습니다.BtcUSD를 바이프로스트의 크로스체인 기능을 통해 타 네트워크에서 사용가능한 가상자산으로 교환하여 디파이 프로토콜 등에서 사용하실 수 있습니다.BTCFi의 출시와 함께 바이프로스트 네트워크는 디파이의 세계를 끊임없이 탐구하고 개발하는 개척자로서의 소명을 잊지 않으려고 합니다. 비트코인 생태계는 계속 발전해 나갈 것입니다. BTCFi는 새로운 비트코인 기반의 금융 생태계에서 누구보다 가치있는 서비스를 제공하기 위해서 노력하겠습니다.BTCFi를 활용하여 디파이 생태계에 많은 참여 부탁드립니다!"
  },
  {
    "title": "BTCFi Launched",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-launched-482c563bf6fa",
    "content": "BTCFi LaunchedBifrost·FollowPublished inBifrost·4 min read·Apr 17, 2024--ListenShareBTCFiofficially launchedIn what we believe to be a significant step forward for the blockchain ecosystem, we are proud to announce the official launch of BTCFi, a service that leverages Bitcoin to empower Bitcoin users like never before.BTCFi is a decentralized finance (DeFi) solution that puts the power of Bitcoin in the hands of individuals, allowing them to borrow, lend, and generate yields while maintaining their BTC holdings. Built atop Bifrost’s robust cross-chain infrastructure, BTCFi offers a suite of innovative features that redefine the way users interact with their Bitcoin.During our pre-launch we saw over 120 BTC deposited to get first access to the service, and we are overwhelmed by the reception and enthusiasm BTCFi is met with. We hope many more will actively utilize the service to broaden the usage of Bitcoin, and in turn, contribute to the ever-growing Bitcoin ecosystem.Here are some of many features that differentiates BTCFi from its competitors.Decentralization and SecurityAt the core of BTCFi lies an ethos that closely follows that of Bifrost Network, a commitment to decentralization and security. By operating on the Bifrost Network, BTCFi is one of the first completely decentralized CDPs that uses only Bitcoin as a collateral, an equally decentralized asset. In doing so, BTCFi eliminates the need for centralized intermediaries, ensuring that users’ assets and BtcUSD minted are immune from any centralized parties and possible risks they pose.Competitive Borrowing RatesOne of the standout features of BTCFi is its industry-leading borrowing rates. Users can access stable BtcUSD loans at a mere 3.5% — a rate significantly lower than the industry standard, making it an attractive option for those seeking to leverage their BTC holdings without compromising their long-term investment.BtcUSD — versatile, stable, and completely decentralizedThe introduction of BtcUSD, a Bitcoin-backed stablecoin, is a game-changer within the BTC ecosystem. Less susceptible to volatility than any other cryptocurrency-backed stablecoin, BtcUSD provides users with the option of having stablecoin to use while maintaining exposure to the upside potential of Bitcoin. This versatile token can be used for a variety of purposes, from borrowing to generating passive income through lending and liquidity provisioning.Expanding Horizons Beyond BifrostThe integration of BTCFi with other blockchain networks further amplifies its utility. Users can now bridge their BtcUSD tokens to external platforms, unlocking a world of possibilities beyond the Bifrost ecosystem. This cross-chain compatibility empowers Bitcoin holders to seamlessly participate in a diverse range of DeFi applications and services.How BTCFi can be usedBTCFi can be used in myriad ways to generate profit for BTC holders. While there are no right or wrong answers in formulating your strategies, we have listed some of the examples in which BTCFi can be used to generate yield for you.Bifrost’s own decentralized application, BiFi, an excellent way to generate yield while minimizing exposure to price fluctuations and risks involved. You can deposit BtcUSD to BiFi to lend to others to generate yield without risk of Impermanent Loss.You can also use BtcUSD in other DApps that support it, asALEXon Stacks will, in a similar fashion as described above.If you have a strategy of investing into another cryptocurrency, you can do so through BtcUSD. For example, if you wanted to hold Bitcoinandhave Ethereum as well, you can do so through BTCFi. By swapping BtcUSD for Ethereum, now you can hold both, and enjoy the upside provided by both.Another way is to export BtcUSD out to other blockchain ecosystems, in a currency that is supported by them. Leveraging the robust cross-chain engine Bifrost empowers BTCFi with, users can access DApps across Ethereum, Stacks, BNB Chain, Arbitrum and more.These are all but a few of the possibilities enabled by BTCFi, and we expect that there will be many more creative users out there that can maximize their earning through various means. This is a new expansion into DeFi space for BTC holders, and we are excited to see how BTCFi will evolve.With the launch of BTCFi, Bifrost Network has solidified its position as a pioneer in the DeFi space, offering a comprehensive solution that puts the power of Bitcoin-backed finance in the hands of users. As the Bitcoin ecosystem continues to evolve, BTCFi will prove to be an invaluable service for expansion of the ecosystem and in providing additional capabilities to Bitcoin users. UseBTCFito expand the DeFi ecosystem!"
  },
  {
    "title": "BTCFi Testnet Live",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-testnet-live-4229f882cbbb",
    "content": "BTCFi Testnet LiveBifrost·FollowPublished inBifrost·3 min read·Apr 11, 2024--ListenShareBTCFi is a Bitcoin-based DeFi platform that extends the use of Bitcoin from centralized services to the decentralized ecosystem, enhancing its mainstream adoption. Following the Pre-Launch event on March 14th, we are thrilled to announce the official launch of BTCFi, the Bitcoin-centric asset management platform, with the unveiling of our testnet today.BTCFi — Bitcoin-based Asset Management PlatformBTCFi allows users to deposit Bitcoin and mint BtcUSD, a stablecoin backed by Bitcoin collateral, all in a completely decentralized manner. In our newly unveiled BTCFi Testnet, users can deposit WBTC and BTCB from the Bifrost Network to mint BtcUSD, enabling a seamless transition to Bitcoin-backed stablecoin assets. Minted BtcUSD can be utilized as assets on BiFi, a cross-chain deposit and lending service, and Everdex, a decentralized exchange. Unlike single staking services, BTCFi offers diverse asset utilization beyond Bitcoin staking with BtcUSD.BTCFi aims to revolutionize the DeFi space by providing various use cases for Bitcoin as an asset within DeFi and contributing to the innovation of Bitcoin-based DeFi ecosystems.BTCFi TestnetGuideYou can get BTCFi testnet tokens onBTCFi testnet websiteand below are the few steps to get testnet tokens.To receive testnet tokens visit BTCFi website, and head over to the Dashboard.ClickConnect Walletbutton to connect your wallet.3. Then clickfaucetbutton next to Connect Wallet.4. As seen in the image above, after clicking faucet button, you will be directed to the Bifrost Network faucet website. Choose types of tokens you want to receive shown as number 1.5. As seen above, enter your wallet address in number 2 and click request button in number 3.How to Use BiFi TestnetAfter receiving tokens using faucet and minting BtcUSD, you can lend or borrow assets using BtcUSD. Follow two steps to use BiFi testnet.Visit BiFi website and clickConnect Walletbutton.2. Click menu button shown as number 1 next to Connect Wallet and click network shown as number 2 to switch to testnet.That concludes the tutorial for how to connect, and to enable testnet for these services. Before the official launch of BTCFi, you can use the testnet versions of BTCFi, and BiFi to plan your DeFi strategies to optimize your yields. If you want more details on how to deposit on BiFi, please refer to ourGitBook guide. Don’t miss out on your opportunity to test it out, and please let us know if you have any feedback regarding the service. Thank you."
  },
  {
    "title": "BTCFi 테스트 네트워크 출시",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/btcfi-%ED%85%8C%EC%8A%A4%ED%8A%B8-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EC%B6%9C%EC%8B%9C-e74db2601c71",
    "content": "BTCFi 테스트 네트워크 출시Bifrost·FollowPublished in바이프로스트·4 min read·Apr 11, 2024--ShareBTCFi는 중앙화 서비스에 주로 사용되는 비트코인을 디파이 생태계로 확장, 대중적인 사용을 촉진하는 비트코인 기반의 디파이 플랫폼입니다. 3월 14일 Pre-launch 공개 이후, 오늘 비트코인 중심의 자산 관리 플랫폼인 BTCFi의 정식 출시에 앞서 테스트 네트워크를 공개합니다.BTCFi — 비트코인 기반의 자산 관리 플랫폼BTCFi는 비트코인을 예치하고, 이를 바탕으로 비트코인 담보 기반의 스테이블 코인 BtcUSD를 발행하는 탈중앙화 자산 관리 플랫폼입니다. 오늘 저희가 공개한 BTCFi 테스트 네트워크에서는 Bifrost Network의 WBTC와 BTCB를 예치하고, 이를 활용하여 비트코인 기반의 스테이블 코인인 BtcUSD를 발행할 수 있습니다. 발행된 BtcUSD는 크로스체인 예금 및 대출 서비스인 BiFi와 탈중앙화 거래소인 Everdex에서 자산으로 이용할 수 있습니다. 단일 스테이킹 서비스들과 달리 BTCFi는 비트코인 스테이킹 외에도 BtcUSD를 이용하여 자산을 다양하게 활용하실 수 있습니다.이렇듯, BTCFi는 디파이에서 비트코인을 자산으로써의 다양한 활용처를 제공하고, 비트코인 기반의 디파이 분야 혁신에 기여할 것입니다.BTCFi 테스트 네트워크참여 방법BTCFi 테스트 네트워크의 원활한 사용을 위해 BTCFi 사이트에서 쉽고 빠르게 테스트 네트워크 토큰을 얻으실 수 있는 방법입니다.테스트 네트워크 토큰 수령을 위해서는BTCFi 대시보드 페이지에 접속해 주세요.접속 후 테스트 네트워크 토큰 수령을 위해지갑 연결하기버튼을 클릭하여 지갑을 연결해 주세요.3. 지갑 연결 후 지갑 옆 수도꼭지 버튼을 클릭해 주세요.4. 버튼 클릭 시 Bifrost Network의 테스트 네트워크 토큰들을 받을 수 있는 파우셋(Faucet) 페이지로 이동하게 됩니다. 해당 페이지에서 1번 버튼을 클릭하여 수령을 원하시는 토큰을 선택해 주세요.5. 2번으로 표기된 곳에 토큰을 수령하실 지갑주소를 입력해 주세요. 그 후 3번으로 표기된 Request 버튼을 클릭하시면 테스트 네트워크 토큰을 수령하실 수 있습니다.BiFi 테스트 네트워크 사용법BTCFi에서 수령하신 비트코인을 BTCFi에 예치 후 BtcUSD까지 민팅하셨다면, BiFi에서도 BtcUSD를 자산으로 활용하여 다른 자산들을 대출받으실 수 있습니다. BiFi 테스트 네트워크는 아래 2가지 과정을 거쳐 사용 가능합니다.BiFi 페이지 접속 후 지갑을 연결해 주세요.2. 지갑 연결하기 버튼 옆에 있는 1번으로 표기된 설정 메뉴를 클릭 후, 2번으로 표기된 네트워크 버튼 클릭하여 Mainnet을 Testnet으로 변경해 주세요.지금까지 BTCFi 테스트 네트워크에서 활용하실 수 있는 자산들을 파우셋을 통해 수령하는 방법부터 BiFi의 테스트 네트워크의 접속 방법까지 알아보았습니다. BTCFi의 테스트 네트워크를 통해 정식 출시에 앞서 서비스를 이용해 볼 뿐만 아니라 타 서비스들 (BiFi)과의 연계를 통한 추가적인 수익 전략 수립까지 BTCFi에서 미리 시작해 볼 수 있습니다. BTCFi에서 BiFi를 활용하는 자세한 방법은여기를 참고해 주세요. 서비스 개선을 위한 여러분의 소중한 의견도 언제든 환영입니다. 지금 BTCFi 테스트 네트워크에 참여해 보세요."
  },
  {
    "title": "Bifrost Network, XLink, and ALEX Lab Collaboration Announced",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/bifrost-network-xlink-and-alex-lab-collaboration-announced-b34e7717e473",
    "content": "Bifrost Network, XLink, and ALEX Lab Collaboration AnnouncedBifrost·Follow2 min read·Mar 22, 2024--ListenShareWe are thrilled to announce a partnership between three Bitcoin-oriented projects in the game: Bifrost Network, XLink, and ALEX. This trilateral collaboration brings together the powerful capabilities of these platforms, paving the way for unprecedented cross-chain interoperability and seamless asset transfers across multiple blockchain ecosystems.Bifrost Network, which recently announced support for sBTC on BTCFi, has joined forces with XLink, the bridge protocol for the Stacks ecosystem, and ALEX, a Bitcoin infrastructure layer project. This strategic alliance aims to create a seamless bridge between the Stacks ecosystem and other leading blockchain networks, fostering enhanced liquidity, interoperability, and composability for decentralized applications on both Bifrost and Stacks ecosystem.Through this partnership, users will be able to move assets, including STX (the native token of the Stacks ecosystem), aBTC, sBTC, BFC (the native token of the Bifrost ecosystem), BtcUSD and other cryptocurrencies, between the Stacks blockchain and various supported networks facilitated by Bifrost Network and XLink. This cross-chain asset transfer capability will open up new opportunities for DApp developers, enabling them to leverage the strengths and capabilities of multiple blockchain ecosystems within their applications.Furthermore, the integration with ALEX will allow users to seamlessly access and utilize decentralized finance services built on the Stacks and Bifrost ecosystem, such as swaps, stacking, lending, borrowing, and yield farming, while leveraging assets from other blockchain networks. This unlocks a world of possibilities for DeFi users, providing them with greater liquidity, diversification, and access to a wider range of financial instruments and opportunities.“We are thrilled to join forces with Bifrost Network and ALEX to revolutionize cross-chain capabilities within the Stacks ecosystem.” — The XLink DAO Foundation. “This collaboration aligns with XLink’s mission to simplify access to Bitcoin to a global audience. By enhancing cross-chain composability and liquidity with Bifrost Network, we broaden accessibility and interoperability, catering to the diverse needs of Bitcoin enthusiasts, newcomers, and ecosystem developers alike.”Dohyun Pak, the founder of the Bifrost Foundation added, “Our collaboration with XLink and ALEX represents a significant step towards achieving true interoperability across blockchain networks, including that of Stacks and Bifrost. We are proud to contribute our capabilities to this partnership, unlocking new possibilities for BTC enthusiasts.”“ALEX is at the forefront of Bitcoin DeFi innovation, and our partnership with Bitfrost Network and XLink is a strategic step towards broadening our ecosystem” said Dr. Chan Ahn, CTO of ALEX. “This collaboration enables us to offer users a diverse array of Bitcoin assets and opportunities. Through this integration, we are not just expanding our offerings; we are also reinforcing our commitment to providing secure, efficient and flexible access to Bitcoin economy.”Stay tuned for further updates and exciting developments as we continue to push the boundaries of cross-chain interoperability and decentralized finance."
  },
  {
    "title": "Bifrost To Explore Innovative Bitcoin Use Cases with Support from the Stacks Foundation",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/bifrost-to-explore-innovative-bitcoin-use-cases-with-support-from-the-stacks-foundation-d04d94293b75",
    "content": "Bifrost To Explore Innovative Bitcoin Use Cases with Support from the Stacks FoundationBifrost·Follow4 min read·Mar 14, 2024--ListenShareToday, we are excited to announce an ongoing collaboration between the Bifrost Foundation and the Stacks Foundation aimed at increasing the utility and interoperability of Bitcoin-based assets and protocols.This effort aims to open up new possibilities for the Bitcoin ecosystem by exploring new ways Bitcoin can be utilized. The Stacks Foundation will provide technical guidance and support as the Bifrost team integrates various products from their ecosystem with Stacks, the leading Bitcoin L2.Collaborating to unlock Bitcoin’s capabilitiesAt the core of this collaboration is the Bifrost Foundation’s launch of BTCFi, a service that pioneers the use of Bitcoin to mint BtcUSD, a stablecoin backed by Bitcoin. This innovation represents a big step in providing Bitcoin holders a secure and decentralized avenue to leverage their assets. By enabling users to engage with Bitcoin in novel ways, BTCFi stands as a testament to the possibilities that emerge when technology aligns with vision.The Stacks network is expecting an upgrade this year that will enable sBTC — a non-custodial, programmable 1:1 Bitcoin-backed asset that enables decentralized movement of BTC in/out of Bitcoin layers.With sBTC, builders can create products backed by Bitcoin, the most secure, decentralized blockchain, and activate $1T in BTC capital. The anticipation surrounding sBTC speaks volumes about the community’s eagerness for solutions that broaden Bitcoin’s applicability beyond its traditional confines. The introduction of sBTC is poised to be a pivotal moment, potentially altering the perception and utility of Bitcoin across diverse blockchain ecosystems.The dynamic between BTCFi and sBTC under this collaboration is especially compelling. By using sBTC as collateral in the BTCFi service, a seamless and innovative application of Bitcoin is facilitated. The integration can also enable the use of BtcUSD within the Stacks ecosystem, illustrating a unique blend of two pioneering technologies. Through this collaboration, the utility of Bitcoin is not only enhanced but also diversified, offering new use cases for Bitcoin holders as well as enriching the Stacks and Bifrost ecosystems.Dohyun Pak, the founder of the Bifrost Foundation states, “We are excited to be part of the future of Bitcoin as envisioned by the Stacks community, and for them to share the same vision in pushing the infrastructural limits of Bitcoin. We look forward to creating services that will benefit users of both ecosystems.”“At the Stacks Foundation, our commitment lies in fostering innovation and utility within the Bitcoin ecosystem,” says Mitchell Cuevas, Executive Director at the Stacks Foundation. “As innovation on Bitcoin continues to blossom, we’re honored to be able to offer guidance to teams like Biforst as they explore bringing new technology and integrations to the Stacks layer. With BTCfi and BtcUSD, we’re excited to see the options users have on the Stacks layer grow and look at this as another step toward interoperability across a growing number of Bitcoin-focused protocols and networks.”What the future holdsThe Bifrost Foundation and Stacks Foundation share a commitment to unlocking Bitcoin’s full potential. By supporting each other’s efforts, we are expanding Bitcoin’s use cases and reaffirming its foundational role in the digital economy. This initiative promises to open up new avenues for engagement, investment, and innovation for Bitcoin enthusiasts, contributing to the dynamic evolution of the blockchain landscape.Learn more about Bifrost & BTCFi:https://bifrostnetwork.com/http://btcfi.one/Learn more about Stacks & sBTC:https://www.stacks.co/https://docs.stacks.co/sbtc/introductionAbout StacksStacks is a Bitcoin L2 that enables smart contracts and decentralized applications to use Bitcoin as a secure base layer. The 2024 Nakamoto and sBTC releases will bring faster speeds and transactions backed by 100% Bitcoin finality. ‍Stacks is the current leading Bitcoin L2 by developer traction and market cap and is poised to help unlock Bitcoin and its $500B in passive capital as a fully programmable, productive asset. The Stacks (STX) token, used as gas on the L2, was the first to undergo an SEC-qualified sale in the United States. The project explicitly decentralized with the mainnet launch in 2021. In the Stacks ecosystem, there are currently 30+ contributing entities including a non-profit Stacks Foundation, a developer tooling company Hiro, Xverse, Trust Machines, Mechanism, Bitcoin L2 Labs, ALEX, Bitcoin Frontier Fund, and more.About BifrostThe Bifrost Foundation is behind some of the most decentralized, secure innovations in DeFi to date. In addition to launching Bifrost Network, a network dedicated to providing decentralized cross-chain environment for DApps and applications alike, the Bifrost Foundation is also behind BiFi, one of the first lending protocol that actively uses native BTC. Their latest innovation in Bitcoin infrastructure is BTCFi, a protocol that allows users to unlock BTC from various networks for use in DeFi across different ecosystems, that will be supporting native Bitcoin, Stacks, Ethereum, Polygon, BNB and more."
  },
  {
    "title": "BTCFi Pre-Launch Event",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-pre-launch-event-a91b3f25e4c7",
    "content": "BTCFi Pre-Launch EventBifrost·FollowPublished inBifrost·5 min read·Mar 14, 2024--ListenShareWith Bitcoin reaching unprecedented heights, it’s increasingly evident that investing in Bitcoin is a strategy that consistently proves its merit. As we anticipate the upcoming Bitcoin halving, our team has been diligently preparing BTCFi — a groundbreaking platform engineered to transform your Bitcoin investment journey.The launch of this service is imminent, and our excitement is through the roof. To spread the enthusiasm, we’re inviting you to get a firsthand glimpse of what BTCFi offers. This platform empowers you to generate passive income from your BTC, and through our pre-launch campaign, you have the opportunity to earn rewards by depositing BTC, mirroring the benefits of the full service.During this campaign, we’re distributing a total of1.2 BTCamong participants! Valued at around$73,000 USDas of March 14th, this giveaway is our way of expressing our gratitude to our early users, and to have our users experience what it’s like to generate passive income from just holding BTC.Depending on how many BTC is deposited, the amount of reward received during this pre-launch period will be anywhere between 6% to 30% APY for users during the event period. When considering that most centralized BTC custody services offer returns of less than 1% for BTC, the potential yields from BTCFi present a compelling case for transferring your BTC from centralized exchanges to explore the advantages of a DeFi service.Until now you’ve only seen the articles and the diagrams — but now it’s time for you to experience BTCFi.BTCFi is the new way of investing in Bitcoin — it acts as a risk-minimized, revenue-earning DeFi finance service, as well as a convenient self-custody platform. By enabling Bitcoin holders to earn additional revenue through decentralized staking, BTCFi offers users unparalleled flexibility, autonomy, and the ability to participate in the decentralized finance ecosystem without compromising their Bitcoin holdings.And now, you can experience what it is, by participating in our pre-launch. The details are as follows:[How to participate]Go to BTCFi WebsiteEvent detailsThis event is an event that rewards users that deposit BTC prior to the official launch of BTCFi, and to experience the actual service upon launch by minting BtcUSD to deposit into Everdex pool (BtcUSD-USDC).Pre-launch period: March 14, 2024 ~ April 17th, 2024The first 120 BTC depositors will be eligible for participation.The total amount of reward is 1.2 BTC, and will be distributed according to how much point the user accumulates in comparison to the overall points given out.The reward will be paid in BTC(BTCB).The deposited amount will be rounded to the nearest 0.001 BTC.2. Point calculations0.001 BTC deposited, or equivalent, will be counted as 1 point.Points earned will be proportional to the BTC the user deposits, and to the deposits made by users referred by the referrer.Example) 1 BTC deposited = 1,000 points, 0.1 BTC deposited = 100 pointsIf Alice refers Bob, and Bob deposits 1 BTC, both Alice and Bob are eligible for 1,000 points.3. Referral detailsUpon connecting a wallet(i.e. Pockie) at the “Points” page, the wallet address is imbued with a referral code automatically.The referrer will receive points proportional to deposits made through their referral link.There is no limit to how many users a referral link can invite, and only the person who the referral link originated from will be eligible for the referral points.Example 1) Bob deposits 1 BTC, through Alice’s referral link, both will receive points proportional to 1 BTC. (1,000 points)Example 2) If Bob is referred by Alice, but Bob does not deposit; instead, Bob refers Charlie, and Charlie deposits 1 BTC. Bob and Charlie will receive points proportional to 1 BTC (1,000 points), and Alice will not receive any points.If the user connects their wallet through a referral link, their wallet will remain locked to that referral code.-The referral link will stay the same until the user connects using a different referral link.- To use a different referral link, you must connect using the referral link you want.If the user deposit at least once using a referral code, then the wallet is locked to that referral code and will not be able to use another referral code.4. Event participationAll of the below conditions must be fulfilled to be eligible to receive your reward. Please read the below carefully.The deposit must be made during the pre-launch period, through the BTCFi pre-launch page to be eligible for points.- BTC can be deposited from variety of different networks, using Bifrost Network’s cross-chain capabilities.- The supported networks are as follows .— WBTC: Bifrost, Ethereum, Arbitrum, Polygon— BTCB: BNB ChainAfter the launch of the service, use the “Migration” function within the service to migrate your deposited BTC.Mint up to 50% of the deposited amount in BtcUSD-You can mint an amount of worth up to 50% of your deposited BTC.Example) Deposit 10 BTC, mint up to 5 BTC worth of BtcUSDDeposit to Everdex BtcUSD-USDC Poola. From the “Earn” page, click on “Deposit to Everdex”|b. Deposit minted BtcUSD to [BtcUSD-USDC] pool to complete your event participation.-The more BtcUSD you deposit, the higher the reward amount.Reward will be distributed over 4 weeks after the service launch.-The reward is calculated as per points earned at the end of the event, and stays constant throughout the distribution.- The reward is calculated with the updated total deposit amount, on a weekly basis.- If you withdraw during this period, your reward distribution will be halted.<Timeline for reward distribution>First week reward will be calculated 7 days after service launch.First week reward will be distributed 9 days after service launch.Second week reward will be calculated 14 days after service launch.Second week reward will be distributed 16 days after service launch.Third week reward will be calculated 21 days after service launch.Third week reward will be distributed 23 days after service launch.Fourth week reward will be calculated 28 days after service launch.Fourth week reward will be distributed 30 days after service launch.The Fine PrintPoints are not updated in real-time.The Bifrost Foundation, and any of the related entities, are not responsible for changes in prices of related tokens.Any and all parts of this event are subject to change."
  },
  {
    "title": "BTCFi 사전 이벤트 진행",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/btcfi-%EC%82%AC%EC%A0%84-%EC%9D%B4%EB%B2%A4%ED%8A%B8-%EC%A7%84%ED%96%89-5eaf8d7881ad",
    "content": "BTCFi 사전 이벤트 진행Bifrost·FollowPublished in바이프로스트·6 min read·Mar 14, 2024--Share비트코인이 전례없는 최고점에 도달하면서, 비트코인에 투자하는 것이 얼마나 좋은 전략인지 다시 한 번 명확히 드러나고 있습니다. 비트코인 반감기가 가져올 기대감에 부쳐, 저희는 여러분의 비트코인 투자에 대한 생각을 획기적으로 바꾸기 위한 BTCFi 플랫폼을 열심히 만들고 있습니다.이제 BTCFi의 출시가 다가오고 있습니다. 저희가 벼르는 BTCFi의 기대감을 여러분과 함께하고 싶은 마음이 가득합니다. 그래서 이러한 투자의 즐거움이 어떠할지 미리 느껴보실 수 있도록 사전 출시 이벤트를 준비하였습니다. BTCFi는 저희와 함께하는 BTC 마다 추가 수익을 얻어가실 수 있도록 고안된 서비스입니다. BTCFi의 사전 출시 이벤트에서도 BTC를 예치하는 것만으로 포인트와 보상을 얻을 수 있습니다.BTCFi 사전 출시 이벤트에서는 총 1.2 BTC의 리워드를 참가자들에게 나누어 드립니다! 2024년 3월 14일 기준, 약 125,000,000 원 상당의 이번 리워드는 저희와 믿음을 함께 해주시는 초기 사용자들에게 감사한 마음으로 준비하였습니다. 이번 기회를 통해서 BTC의 상승 물결을 타면서 동시에 추가 수익을 얻을 수 있는 즐거운 경험을 선사해드리고자 합니다.참여하는 분들은 예치하는 BTC 수량에 따라 이벤트 기간 동안 6%~30%의 연수익율(APY)의 리워드를 받으실 수 있습니다. 중앙화된 BTC 수탁 서비스에서 대부분 1% 미만의 이율을 제공한다는 점을 비교해보신다면, 실제 BTCFi가 시작되어 BTC가 탈중앙화된 금융을 만났을 때의 강력함을 익히 느끼실 수 있으리라 생각합니다.그동안 글과 그림으로 BTCFi에 대해서 말씀드렸습니다. 이제 BTCFi를 하나씩 경험해보실 차례입니다.BTCFi는 비트코인을 보유하는 새로운 방법을 제시합니다. BTCFi는 보유한 비트코인으로 리스크를 최소화하며 추가 수익을 만드는 탈중앙 금융 상품이자, 편리하고 안전한 자기수탁(self-custody) 플랫폼의 역할을 합니다. 비트코인 투자자 여러분, 저희는 BTCFi를 통해 기존 탈중앙금융 투자자들만이 누렸던 투자의 자유와 유연성을 여러분께 찾아드리며 그동안 안타깝게 놓쳐왔던 투자의 기회 또한 돌려드리고자 합니다.이제 사전 이벤트에 참여하여 BTCFi를 직접 체험해 볼 시간입니다. 자세한 이벤트 내용은 아래와 같습니다.[이벤트 안내]BTCFi 웹사이트 바로가기이벤트 개요본 이벤트는 BTCFi 서비스 런칭 전 BTC를 사전 입금하고, 서비스 런치 이후에 입금했던 BTC를 BtcUSD로 민팅하여 에버덱스 풀(BtcUSD-USDC)에 예치하는 이벤트 입니다.사전 예치 기간: 2024년 3월 14일(목) ~ 4월 17일(수)선착순 120 BTC 입금까지 이벤트 참여 가능합니다.리워드는 총 1.2 BTC 이며 모든 포인트 총합 대비 획득한 포인트 비율에 따라 리워드가 지급 됩니다.리워드는 BTC(BTCB)로 지급됩니다.입금액은 0.001 BTC 단위로 절사하여 반영됩니다.2. 포인트 산정 방법0.001 BTC를 1포인트로 평가획득 포인트는 본인이 입금한 BTC와 레퍼럴을 통해 입금된 BTC 수량에 비례하여 책정예시1) 1 BTC 입금 시 1,000 포인트 지급, 0.1 BTC 입금 시 100 포인트 지급 B가 A 추천 링크로 1 BTC 입금 시, A와 B 모두 1,000 포인트 지급3. 레퍼럴 조건<포인트> 페이지에서 지갑(예: Pockie)을 연결하면 사용자의 레퍼럴 코드가 자동 생성 됩니다.레퍼럴 링크를 통해 입금된 수량에 따라 추천인에게 레퍼럴 포인트가 지급됩니다.추천은 무제한 가능하며 레퍼럴로 발생한 포인트는 추천인에게만 지급됩니다.예시 1) A의 추천 링크로 B가 1 BTC 예치 하는 경우, A와 B 모두 1 BTC에 해당하는 포인트 (1,000 포인트) 지급A의 추천 링크로 B가 이벤트 진입하였으나 예치하지 않고 (0 BTC), B의 추천 링크로 C가 1 BTC를 예치하는 경우, B와 C에게 1 BTC에 해당하는 포인트 지급, A는 포인트 없음레퍼럴 링크는 연결될 때 고정됩니다.- 레퍼럴 링크로 접속하면 새로 연결하기 전까지 접속한 레퍼럴 코드로 고정됩니다.- 다른 레퍼럴 코드를 사용하시려면. 변경을 원하는 레퍼럴 코드의 링크로 재접속 하셔야 합니다.레퍼럴 코드를 입력하여 한번이라도 입금하면, 이후에 다른 레퍼럴 코드를 사용할 수 없습니다.4. 이벤트 참여 상세모든 조건을 충족하는 경우에만 리워드가 지급되니 아래 상세 사항을 반드시 확인해주세요.사전 이벤트 기간(이벤트 오픈 ~ 메인넷 출시 전)에 BTC(BTCB 또는 WBTC)를 BTCFi 사전 출시 이벤트 페이지를 통하여 입금합니다. (Native BTC는 추후 지원 예정입니다.)- Bifrost Network의 cross chain 기능을 이용하여 다양한 네트워크에서의 입금을 지원합니다.- 지원되는 네트워크는 다음과 같습니다. WBTC : Ethereum, Polygon, Arbitrum BTCB : BNB Chain서비스 런칭 후, BTCFi의 포인트 페이지에서 ‘마이그레이션’ 기능을 통해 예치한 BTC를 BTCFi 서비스로 이동합니다.입금액의 최대 50%까지를 BtcUSD로 민팅 합니다.- 담보 비율은 최대 50%까지 가능합니다.예) 10 BTC 입금 후 최대 5 BTC 상당의 BtcUSD 민팅 가능에버덱스 BtcUSD-USDC 풀(Pool)에 예치하기a. <Earn 페이지>에서 <에버덱스 바로가기>를 클릭하여 에버덱스 이동합니다.b. 에버덱스 상단의 [BtcUSD-USDC] 풀에 BtcUSD를 예치하면 이벤트 참여가 완료됩니다.-민팅한 BtcUSD를 많이 예치할수록 리워드 수량이 증가합니다.리워드는 총 4주 동안 분할 지급됩니다.- 이벤트 종료 시점의 포인트를 기준으로 하며 포인트는 변동되지 않습니다.- 1주 단위로 예치되어 있는 이벤트 참여 물량을 계산하여 리워드를 지급합니다.- 중도에 인출 시 더 이상 리워드를 지급 받을 수 없습니다. 참고하세요!< 기준 >1주차 리워드 계산 시점: 서비스 런칭 ~ + 7일1주차 리워드 지급 시점: 서비스 런칭 ~ + 9일2주차 리워드 계산 시점: 서비스 런칭 ~ + 14일2주차 리워드 지급 시점: 서비스 런칭 ~ + 16일3주차 리워드 계산 시점: 서비스 런칭 ~ + 21일3주차 리워드 지급 시점: 서비스 런칭 ~ + 23일4주차 리워드 계산 시점: 서비스 런칭 ~ + 28일4주차 리워드 지급 시점: 서비스 런칭 ~ + 30일유의 사항포인트는 실시간 업데이트 되지 않습니다.가격 변동은 바이프로스트 재단 및 관련된 모든 주체가 책임지지 않습니다.이벤트 상세 사항은 바이프로스트 재단 및 관련된 모든 주체 사정에 따라 변경될 수 있습니다.무엇을 기다리시나요?전세계의 많은 사람들이 이미 BTC를 보유하고 있으며, 이를 더 활용하여 또 다른 가치를 창출할 준비를 하고 있습니다. 사전참여를 통해 리워드를 획득하고, BTCFi의 초기 사용자가 되어 혜택을 누려보세요. 여러분의 소중한 자산 BTC를 더욱 가치있게 만들겠습니다."
  },
  {
    "title": "Pockie Extension v1.2 Update",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/pockie-extension-v1-2-update-bf0d14a42f4e",
    "content": "Pockie Extension v1.2 UpdateBifrost·FollowPublished inBifrost·3 min read·Mar 8, 2024--ListenSharePockie was designed with a focus on better user experience and security from the get-go. This update is an extension of this ethos. To make the dangerous land of DeFi more safe and fun to navigate, we are introducing Pockie Extension v1.2 Update — an update that would improve usability for power users, and security for those venturing out into DeFi for first time.Let’s take a look at the new features in depth.Powerful features for the power userNetwork gas fees, on the goThe users of decentralized exchanges and other DApps will likely have had times when they’ve run out of gas, and subsequently experienced the frustration that comes with it. Now such situations can be solved within seconds through the Gas Top-up function.Instead of having to buy a token, and withdrawing at a large cost, Pockie Gas Top-up allows you to purchase gas tokens so you can resume your transactions within seconds! Did we mention that the service comes at the lowest fee on the market as well?This feature is available through a pop-up screen that appears when you have run out of gas fees.DApp transaction history and detailsNow, instead of having to check explorers for details regarding your transactions, you can see the details right in your Extension! The details can be found in History screen, as well as wallet connection screen. Details include contract addresses of dApps, the tokens involved in the transaction as well as their fiat amounts, and gas fee. This update will include support for Everdex and Uniswap, and Curve to a limited degree. We will continue to add more dApp support over time.Import multiple wallets!Pockie can now import all wallets derivative of a single mnemonic phrase, all at once. Previously, users could only import 1 wallet at a time, but with this update, by entering a seed phrase in Import Wallet menu, users can now import up to 100 wallets that share the same seed phrase. This function is designed to improve usability and to manage wallets more efficiently.All the information you need, right inside PockieAddress Book function to manage your favorite addressesRegister the addresses you use often to send assets conveniently without mistakes. Now you can send assets to specified addresses with a single click! Register the addresses for exchanges and friends in your Address Book, and save time copying and pasting and confirming addresses. If you register an address as a favorite, it will be fixed to the top of the Address Book.Find details on your NFTIf you are using multiple tabs to manage your NFT, this feature is for you. Pockie can now display current price, bid prices, and traits of your NFT, all within Pockie.Scam filtering, to improve user securityPockie’s auto-filter for scam NFTsScams are becoming more commonplace nowadays. This new feature automatically detects and filters out possible scam attempts through NFT.If you have an NFT that is not a scam in nature but want to hide it, you can now also edit your NFT screen to hide it. Through these two new features, you can now manage and show off your NFT collection precisely the way you want.We continue to look forward to various user feedbacks that make Pockie even better! We thank all the community members for their support, and ask that you continue to give us valuable feedback throughDiscordand/orService Desk.Experience the new Pockie Extension features now!Pockie Chrome Extension Installation (Previous installs will update automatically.)Install Pockie Chrome Extension v1.2"
  },
  {
    "title": "포키 익스텐션 v1.2 업데이트",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%ED%8F%AC%ED%82%A4-%EC%9D%B5%EC%8A%A4%ED%85%90%EC%85%98-v1-2-%EC%97%85%EB%8D%B0%EC%9D%B4%ED%8A%B8-12d2c028a02a",
    "content": "포키 익스텐션 v1.2 업데이트Bifrost·FollowPublished in바이프로스트·4 min read·Mar 8, 2024--Share포키는 시작부터 지금까지 편리한 사용자 경험과 안전을 최고의 가치로 생각합니다. 이번 업데이트도 포키가 추구하는 가치에 기반하여 진행되었습니다. 위험천만한 디파이를 안전하고 재밌게 하기 위해 파워 유저분들 뿐만 아닌 처음 디파이를 사용하시는 분들 모두에게 도움이 되는 기능들로 구성된 익스텐션 v1.2 업데이트! 파워 유저분들에게는 더욱 편리하고, 초보자분들에게는 더욱 안전한, 새로운 포키를 소개합니다.파워 유저를 위한 강력한 기능들네트워크 비용, 필요할 때 바로 충전하세요탈중앙화거래소(DEX)나 디앱 거래를 빈번하게 하는 익스텐션 사용자 분들, 한 번쯤은 겪으셨을 겁니다. 네트워크 비용이 모자라서 지금 바로 거래를 못할 때의 답답함, 바로 해결할 수 있습니다. Gas Top-up 기능을 이용하면 수십 초 내에 네트워크 비용을 충전할 수 있습니다.중앙화 거래소에서 코인을 거래하고, 출금 네트워크와 주소를 확인하고, 비싼 수수료를 지불하며 긴 시간 출금 승인을 기다릴 필요가 없습니다. 포키의 Gas Top-up으로 필요한 네트워크 비용만큼 소량으로 빠르고 간편하게 충전하시면 됩니다. 게다가 업계 최저 수수료입니다!이 기능은 ‘거래하기’ 화면에서 네트워크 비용이 부족할 때, [네트워크 비용을 충전해주세요] 팝업 안내 페이지를 통해 부족한 네트워크 비용 알림과 함께 표시됩니다.디앱 거래내역과 거래 상세 정보를 확인하며 거래하세요!디앱 거래내역과 거래 관련 상세 정보 제공 범위를 확대했습니다.거래 관련 상세 정보 확인을 위해 웹브라우저 화면을 클릭하거나 탭을 이동하면서 닫힌 지갑을 또 열게 되는 불편함은 이제 없습니다. 상세 정보를 포키에서 바로 보여드리기 때문입니다. 거래내역 또는 거래 전 지갑 연결 요청 화면에서 거래 관련 상세정보인 디앱의 컨트랙트 주소, 거래하는 토큰과 그 수량, 달러 환산 가치, 네트워크 비용을 확인하며 거래를 진행할 수 있습니다.이번 업데이트에서는 에버덱스, 유니스왑을 온전히 지원하며, 커브는 현재 제한적으로 지원하고 있습니다. 지원하는 디앱과 기능의 범위는 계속해서 늘려갈 계획입니다.여러 개의 지갑을 한 번에 불러오세요!포키에서는 하나의 복구 구문(니모닉, mnemonic)에 파생된 지갑들을 원하는 만큼 선택하여 한 번에 불러올 수 있습니다.기존에는 지갑 불러오기 기능이 1개의 지갑만 불러올 수 있었다면, 이 업데이트를 통해 복구 구문 입력 시, [같은 그룹 지갑 불러오기] 화면에서 최대 100개까지 선택하여 한 번에 불러올 수 있습니다. 이 기능은 번거로움을 최소화하고, 혼동을 방지하여 지갑 관리를 더 효율적으로 할 수 있게 돕습니다.내게 필요한 정보는 모두 포키에서 관리주소록 기능으로 더 편리하게 관리하세요포키 주소록을 사용해서 자주 사용하는 주소를 등록 및 관리하고 실수 없이 자산을 전송하세요.포키에서는 한 번의 클릭으로 신속하게 선택하고 안전하게 전송할 수 있습니다. 주로 사용하는 내 다른 지갑 혹은 거래소들의 주소와 지인들의 주소를 주소록에 등록하면 거래마다 주소를 찾아 복사하고 붙여 넣고, 재차 확인하는 번거로운 과정을 거치지 않아도 됩니다. 또한 많은 주소들 중 자주 사용하는 주소는 즐겨찾기 해두세요, 주소록 상단에 고정됩니다.NFT 상세정보 한눈에 확인하세요익스텐션 지갑 사용자라면 누구나 공감하실 거예요. 수많은 탭과 웹 브라우저를 오가는 상황에서 느끼는 피로감이요. 포키에서는 NFT 상세정보 중 가장 중요한 정보인 가격, 제안 내역, 특징 정보를 한눈에 확인할 수 있습니다. 탭 열지 마시고 포키에서 바로 확인하세요.스캠으로 부터의 사용자 보호스캠 NFT, 포키가 필터링할게요지갑 사용자들의 자산을 노리는 방법들이 다양해지고 있습니다. 그중에서도 NFT를 이용한 스캠이 증가하고 있는데요, 포키는 이를 자동으로 감지하고 필터링 합니다!스캠 NFT는 아니지만 가리고 싶은 NFT가 있다면요? 물론 수동으로 직접 편집도 할 수 있습니다.포키는 스캠 NFT를 감지하여 자동으로 필터링하는 기능과 사용자가 직접 편집할 수 있는 기능을 균형 있게 구현해주어 편리하고 세밀한 관리가 가능합니다.저희는 계속해서 사용자 여러분의 의견을 적극 수렴하며, 사용자 중심 서비스로 발전하고자 합니다. 커뮤니티 여러분의 지지에 항상 감사드리며, 앞으로도디스코드 커뮤니티또는서비스데스크를 통해 자유롭게 의견을 나눠주세요.이제 업그레이드된 포키 익스텐션의 기능들을 살펴보고 경험해 보세요!포키 크롬 익스텐션 설치(기존 설치자의 경우 자동 업데이트됩니다.)Pockie Chrome Extension v1.2 설치 바로가기"
  },
  {
    "title": "Gas Top-up 베타 서비스 출시",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/gas-top-up-%EB%B2%A0%ED%83%80-%EC%84%9C%EB%B9%84%EC%8A%A4-%EC%B6%9C%EC%8B%9C-f98bf30d7326",
    "content": "Gas Top-up 베타 서비스 출시Bifrost·FollowPublished in바이프로스트·3 min read·Feb 14, 2024--Share블록체인을 사용하면서 가장 당황스러운 일 중의 하나는 네트워크 수수료(일명 가스비)를 준비하는 일입니다. 특히 멀티체인 넘나드는 사용자들에게는 단연코 가장 귀찮은 일입니다. 단돈 천 원의 가스비를 채우기 위해 중앙화 거래소에서 코인을 거래하고 출금 네트워크와 주소를 확인하고 비싼 수수료를 지불하며 출금 승인을 한참 기다리는 긴 과정을 거쳐야 합니다. (비슷한 서비스도 있지만 거기는 수수료가 만만치 않습니다.) 이러한 불편함을 해소하고자 Gas Top-up 서비스를 가장 낮은 수수료로 선보입니다. 어느 체인의 네이티브 코인이든지 (BFC, BNB, MATIC, Arbitrum ETH 등) 가지고 계신 토큰으로 바로 구매해서 준비하실 수 있습니다.조금이라도 일찍 불편함을 해소해드리기 위해서 베타 서비스로 먼저 시작합니다(https://www.pockie.io/). Gas Top-up 서비스는 이후에 포키의 기능으로 포함될 예정입니다.가스비에 알맞은 소액 중심으로 운영하며 전달 비용을 고려해 수수료는 업계 최저인 10%가 부과됩니다. 예를 들어 $10 어치의 가스비 충전을 위해서는 $11 어치의 토큰을 받습니다. 예를 들어,ex) BNB 네트워크 비용 충전 $10 을 선택하고, 지불할 토큰을 Polygon MATIC 으로 선택한다면, Polygon MATIC $11 + gas fee 를 지불하고, Bifrost BFC 를 $10 수령하게 됩니다.Pockie, Metamask 뿐만 아니라 대부분의 지갑을 통해서 손쉽게 이용하실 수 있습니다. 현재 지원하는 네트워크로는 Bifrost, BNB(Binance), Polygon, Arbitrum이 포함되어 있으며 각 체인별 네이티브 토큰(BFC, BNB, Matic, ETH)과 스테이블 토큰(USDC)을 지원합니다.포키는 사용자를 위하는 서비스로 계속 발전하고자 합니다. 사용자분들의 필요를 반영하여 블록체인을 쉽고 즐겁게 만들고 있습니다. 많은 피드백 및 관심 부탁드립니다.*2월 22일부터 이더리움(Ethereum) 메인넷을 추가 지원합니다. 업데이트된 표를 참고해주세요."
  },
  {
    "title": "Beta Function Launch: Gas Top-up",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/beta-function-launch-gas-top-up-8b2183f97691",
    "content": "Beta Function Launch: Gas Top-upBifrost·FollowPublished inBifrost·2 min read·Feb 14, 2024--ListenShareOne of the biggest hassles in using blockchain services is having a balance for Network fees, commonly known as gas. For those who transverse different networks, it has proven to be a pain time and time again. Users are often forced to trade tokens at a centralized exchange and to go through the long and arduous, and often costly, process of withdrawing only for a dollar’s worth of gas. Other services provide this function, often at even higher cost.To solve this problem, we are introducing theGas Top Up service, at an extremely competitive fee. Native gas tokens of different networks (BFC, BNB, ETH, MATIC, etc.) can be instantly purchased using the tokens you own.To provide our users with a viable solution to the aforementioned problem, we are launching this service, albeit in beta. Gas Top-up will be implemented into Pockie once the beta phase is complete.Token amounts suitable for gas usage (depending on the gas price of the network) will be provided with a fee rate of 10%, which is competitive against most services out there. So if you were to purchase $10 worth of gas, it would only cost you $11. Below is an example of how such a transaction would work out.ex) If you chose to top up Bifrost Network with $10 worth of BFC, and chose to pay using Polygon MATIC, you would be paying $11 in MATIC and a small amount of MATIC gas. You will be receiving, in return, $10 worth of BFC tokens.This service is compatible not only with Pockie and Metamask but with most other wallets. Currently, networks supported are Bifrost, BNB Chain, Polygon, and Arbitrum. You can use native tokens of each network, and USDC, to pay for this service.We strive to make Pockie more useful for our users. We ask for your continued support and feedback, as to make blockchain easier and more fun for all. Thank you.Starting February 22nd, the Gas Top-up service will support Ethereum mainnet. Please refer to the updated table."
  },
  {
    "title": "[BTCFi #3] The limitless possibilities of BtcUSD",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-3-the-limitless-possibilities-of-btcusd-a072e817150a",
    "content": "[BTCFi #3] The limitless possibilities of BtcUSDBifrost·FollowPublished inBifrost·3 min read·Mar 5, 2024--ListenShareIn our last article, we discussed the significance of BtcUSD, and how a Bitcoin-backed stablecoin may serve as a game changer for those who are strong believers of Bitcoin. Today, the topic is on how BtcUSD can be utilized, and to what impact this has on the utilization of Bitcoin.Bitcoin (BTC), the progenitor of all cryptocurrencies, has historically been somewhat of a digital gold: valuable for holding but limited in terms of utility beyond a store of value or medium of exchange. This limitation has been a significant hurdle for BTC holders looking to leverage their assets within the decentralized finance (DeFi) ecosystem. The introduction of Wrapped Bitcoin (WBTC) represented a leap forward, enabling Bitcoin holders to participate in the Ethereum-based DeFi space. However, WBTC, while innovative, has not entirely bridged the gap between Bitcoin’s value and DeFi’s opportunities.The challenge for BTC holders has traditionally been the lack of versatility in utilizing their holdings. While WBTC opened new doors by allowing Bitcoin to be used on Ethereum’s network, enabling participation in smart contracts and DeFi protocols, it still presented limitations. BTC holders could supply liquidity and engage in various DeFi activities, yet they could not mint a stablecoin directly based on their BTC holdings. This limitation meant missing out on a significant aspect of DeFi’s utility: leveraging assets to mint stablecoins, which can then be used for a myriad of financial activities without selling the underlying asset.With BtcUSD, that is set to change. Unlike traditional methods where Bitcoin could be used as collateral to borrow USD, which often comes with high-interest rates (15–16% APY on Aave and 6.7%-27.7% on MakerDAO — as of March 3rd, 2024), BtcUSD introduces a more efficient and cost-effective solution. By leveraging BTCFi, a platform designed explicitly for this purpose, BTC holders can mint BtcUSD at a remarkably low rate of 3.5% APY. This development not only makes financial sense but also unlocks a plethora of opportunities for BTC holders to generate additional revenue streams.So how do we use it?The process of using BtcUSD is elegantly simple: BTC is collateralized, and BtcUSD is minted. This BtcUSD can then be utilized across various DeFi platforms (such as BiFi) for lending, borrowing, trading, and more, without the BTC holder having to sell their Bitcoin. This mechanism provides a low-interest loan option for BTC holders as well, further enhancing the attractiveness of BtcUSD in the DeFi ecosystem.Moreover, BtcUSD’s utility is not confined to a single blockchain. Enhanced with advanced cross-chain capabilities of Bifrost Network, it ensures that BTC holders can leverage their assets across multiple networks, significantly expanding the scope of potential applications. Some of the services that could potentially be used this way would be Aave, Compound and seemingly infinite number of DeFi services that occupy the cryptosphere. Even RWA services such as MakerDAO can be actively utilized as well as centralized solutions, if the user wishes so. Bitcoin’s Layer 2 solutions are also being looked into, for even broader accessibility and utility.One of the most compelling uses of BtcUSD is in leveraging positions. BTC holders can now take low-interest loans against their BTC, mint BtcUSD, and then use that for further investment in BTC or liquidity provision in the DeFi space. This strategy can significantly enhance the yield-generating potential of Bitcoin, transforming it from a passive asset to an active tool for financial growth.ConclusionThe introduction of BtcUSD addresses a critical need among BTC holders: the desire to maintain and leverage their positions without relinquishing their hold on Bitcoin. It represents a significant step forward in the integration of Bitcoin with the broader DeFi ecosystem, offering unprecedented opportunities for BTC holders. As DeFi continues to evolve, so will BtcUSD with its ever-expanding capabilities in DeFi space. We look forward to the future BTCFi will bring to Bitcoin ecosystem, and in the cryptocurrency utility and investment."
  },
  {
    "title": "[BTCFi #2] What is BtcUSD?",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/btcfi-2-what-is-btcusd-6d761be0cbbe",
    "content": "[BTCFi #2] What is BtcUSD?Bifrost·Follow6 min read·Feb 23, 2024--ListenShareIn our previous article, we introduced BTCFi and briefly mentioned the role played by BtcUSD within this ecosystem. But why is BtcUSD so necessary, especially when there are already numerous stablecoins in the market? In this article, we delve deeper into the significance of BtcUSD, its functionality, and how it addresses the pressing needs of Bitcoin holders and all of us in crypto space.State of stablecoinsThere are no shortage of stablecoins in the cryptosphere, some backed by centralized assets, to those backed by decentralized currencies. The collateral used for minting stablecoins have been subject of many discussions, citing the virtue of centralization versus decentralization.Stablecoins backed by centralized entities currently reign supreme. However, the proliferation of such stablecoins introduces systemic risks to the crypto space, undermining the principles of decentralization and financial sovereignty. In response to these challenges, the need for decentralized stablecoins collateralized with decentralized assets becomes increasingly imperative.Still within the issue of centralization versus decentralization, a core argument in this discussion is the significance of the strength of collateral for a stablecoin, and the transparency in conveyance of the strength. This directly correlates with the parity in the representation of the fiat; and fluctuation, or misrepresentation of the value of collateral can potentially result in de-pegging. However, when a cryptocurrency is used for collateralization, this becomes a constant concern.Cryptocurrency has been more susceptible to value fluctuations compared to the US dollar, real estate and other assets that have been used to back stablecoins. As a result, crypto-backed stablecoins have had a mixed bag of results in terms of stability, and in turn, adoption. How a cryptocurrency should be employed in designing a stablecoin remains a hotly debated topic, even to this date.Some of these crypto-backed stablecoins have been more successful than others, while some have had design flaws and peg failures. Through these experiments over time, it became evident that in order for a crypto-backed stablecoin to be sustainable and widely used, there are a few guideline for a stablecoin to follow to stay maintainable.How should a crypto-backed stablecoin be designed?One notable solution in the realm of crypto-backed stablecoins emerged with DAI from MakerDAO, utilizing Over-collateralization to maintain stability. This mechanism requires collateralization of close to 150% of the stablecoin value to withstand collateral value fluctuations, with Ethereum primarily serving as collateral. Despite occasional challenges during extreme market downturns, the system has demonstrated resilience.However, there is an asset that works even better as a collateral than Ethereum-less volatile, higher in adoption and above all, the most decentralized.Enter BitcoinIn the era of Bitcoin ETF, Bitcoin is now a household term that requires no introductions. It is the singular most decentralized crypto asset on the planet, with some studies claiming as much as 13% of all people owning the asset, as of end of 2023. It now exists in different wrapped forms on over 40 different networks, and as various financial products.Bitcoin also happens to be the least volatile cryptocurrency on the market, which makes it ideal for use as a collateral.As CME Group notes in their study, the correlation between the price of ETH and BTC remains consistently positive, yet Bitcoin price movement is consistently less volatile. In another words, when the market has a downfall, Bitcoin is the strongest asset resisting against the fluctuations.BTC shows consistently lower volatility compared to ETH (Source: CME Group)For stablecoins backed by cryptocurrency, this difference in volatility could mean the difference between maintaining or breaking the parity to the fiat it represents. For a stablecoin, this is akin to a life-or-death situation. A stablecoin backed by Bitcoin would be exposed to a lot less risk to such situation, than those backed by any other cryptocurrency.Introducing BtcUSD: The Decentralized SolutionIn response to these challenges and conclusions drawn, we proudly introduce BtcUSD, a stablecoin backed solely by Bitcoin. BtcUSD not only mitigates liquidation risk and ensures stability against the US dollar more effectively than other cryptocurrency-backed stablecoins. However, its most significant advantage lies in its decentralization.As the name implies, BtcUSD is fully backed by Bitcoin. This lowers user liquidation risk and ensures the stability of its peg to the US dollar, more so than any other stablecoin backed by cryptocurrency. But more important than the reliability is the level of decentralization.As the most decentralized asset in crypto space, BTC is resistant to censorship, manipulation, and third-party interference, making it a reliable and secure asset to collateralize. With a decade-long history of network resilience and robustness, Bitcoin has demonstrated its ability to withstand various external threats and attacks. This resilience instills confidence among users seeking to collateralize their assets, knowing that their Bitcoin positions are protected by the network’s cryptographic security measures and decentralized consensus protocol.And this resilience is distilled right into BtcUSD, positioning BtcUSD as a decentralized stablecoin secured by $1 trillion dollars of Bitcoin TVL.The Bifrost EdgeBitcoin-backed stablecoin is not something that is completely new to the market. There have been attempts made on a few Bitcoin L2s, but there exists a problem that prevents their widespread adoption — interoperability. Many of tokens existing on Bitcoin L2s cannot transverse to other blockchain platform, even other Bitcoin L2s.For a stablecoin to gain traction and widespread use, in the face of emergence of different L1 and L2 platforms, it needed to be able to transverse different blockchains and be widely available. Save for centralized stablecoins such as USDT or USDC, it is difficult to have a fully decentralized, collateralized stablecoin that are also fully multichain. And this is where BtcUSD’s major difference to these other Bitcoin-backed stablecoins exist.Powered by Bifrost’s robust crosschain capabilities, BtcUSD is the first Bitcoin-based stablecoin to be fully crosschain-capable, that can be leveraged on various networks. It will initially start off on Bifrost Network, but it has capacities to move to any and all EVM-compatible chains, and in near future, Bitcoin L2s as well.The crosschain edge also works for the Bitcoin used to collateralized BtcUSD. Holders of Bitcoin on various networks can utilize their Bitcoin on their network of choice to mint BtcUSD through BTCFi, and leverage their Bitcoin holding.A simplified diagram illustrating how Bifrost Network accelerates BtcUSD’s adoptionThis effectively solves the problem most Bitcoin-backed stablecoins face in adoption, making BtcUSD one of the most versatile stablecoins to date, in addition to all the added benefits that comes from Bitcoin collateralization.In BtcUSD’s infancy, it is planned to be backed by wrapped BTC assets; but upon reaching fruition, it will be backed by native BTC as well, further decentralizing its collateral and mitigating risks. Over time, the number of networks supporting and supported by BtcUSD will increase as well, for wider usage for Bitcoin holders that wants to leverage their Bitcoins.ConclusionDecentralization for BtcUSD has multiple meanings. It refers to the state of having Bitcoin, the most decentralized of all crypto assets, as its collateral, as well as the crosschain nature of BtcUSD. BtcUSD can be minted through Bitcoin existing in many forms on different network, as well as itself existing on different networks.BtcUSD, solely backed by Bitcoin, heralds a paradigm shift towards a more resilient, censorship-resistant, and decentralized financial future. With decentralized stablecoin collateralized with decentralized assets and operational across multiple networks, welcome to the future of decentralized currency."
  },
  {
    "title": "[BTCFi #1] Introducing the next chapter in Bitcoin",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/btcfi-1-introducing-the-next-chapter-in-bitcoin-4dd5472a83bd",
    "content": "[BTCFi #1] Introducing the next chapter in BitcoinBifrost·FollowPublished inBifrost·5 min read·Feb 6, 2024--ListenShare2024 is shaping up to be an exciting year for Bitcoin, and things are getting even more heated now with Bitcoin ETF officially announced. In the midst of the ongoing Bitcoin boom and the evolution of the blockchain and cryptocurrency space, a crucial piece has been missing for Bitcoin holders — a secure and decentralized native staking option.While innovators such as Stacks, Rootstock, Lightning Network and more are creating a vibrant ecosystem around the native Bitcoin, we’ve yet to see native Bitcoin staking, or a service that would provide Bitcoin holders with opportunities for source of revenue.Despite the surge in interest and innovation in using Bitcoin, attempts to introduce centralized staking solutions have been fraught with risks, as exemplified by the challenges faced by Celsius and other centralized services. Enter BTCFi — a revolutionary financial product designed to fill this void by offering Bitcoin holders a decentralized source of revenue while maintaining complete control over their BTC balance.BTCFi: Empowering Bitcoin Holders with Decentralized Revenue GenerationBTCFi distinguishes itself by providing a decentralized and secure revenue generating solution, differentiating from centralized counterparts that have proven risky in recent times. As Bitcoin is a PoW system, there is no native staking, but BTCFi acts as an alternative solution to this problem.BTCFi offers Bitcoin holders an opportunity to earn passive income with minimized risk, while being user-friendly, fast, and completely self-custodial.Key FeaturesFully Decentralized Bitcoin DeFiBTCFi operates on a decentralized protocol, eliminating the need for intermediaries or third-party custodians. This ensures that the process is transparent, secure, and controlled by smart contracts, putting the power back in the hands of the users.Native Bitcoin UsageUnlike BRC-20 tokens that imitate ERC-20 standards on the Bitcoin network, BTCFi aims to allow users to utilize their actual Bitcoin holdings. This preserves the decentralized nature of Bitcoin while enabling users to earn additional revenue through a fair and transparent reward mechanism. The initial version of BTCFi will ship without this capability; however, implementation of native BTC remains high on our list of priorities.Minimal RiskIn contrast to centralized efforts like Celsius, BTCFi minimizes risks by removing single points of failure and reliance on external entities. The decentralized nature of the protocol enhances security, mitigating potential risks associated with centralized staking platforms.Fast and Self-CustodialBTCFi is designed with speed and efficiency at core, allowing users to stake their Bitcoin quickly and seamlessly. And thanks to the high transactional rate of Bifrost Network, which BTCFi will launch on, execution of various functions of BTCFi will be faster and cheaper than that of its competitors on other networks. Additionally, the self-custodial nature of the platform ensures that users have complete control over their BTC holdings, with no centralized agency in any part of user interaction. This self-custodial approach ensures that users can engage in utilizing without compromising their ownership and control over their Bitcoin.Crosschain InteroperabilityThe goal of this project is not limited to the utilization of BTC and BtcUSD within the Bifrost ecosystem. To create a positive flywheel ecosystem, liquidity should also be easily accessible on other blockchains outside the ecosystem. BTCFi, as is with all Bifrost-related protocols, is powered by Bifrost’s proprietary cross-chain system capable of providing liquidity access to and from all major chains. BTCFi can provide connectivity to protocols that require the use of Native BTC and can also utilize wrapped forms of BTC from other blockchains. This crosschain interoperability is what makes BtcUSD all the more useful as well, as users can utilize this asset across different ecosystems to generate yield.ArchitectureAt the heart of this protocol is BtcUSD, an over-collateralized stablecoin backed by BTC. This is our answer to the growing needs for Bitcoin-backed stablecoin, and to problems suffered by various other crypto-collateralized stablecoins.BtcUSD is safer to hold than any other crypto-backed stablecoin much in part thanks to Bitcoin collateralization. Bitcoin is less susceptible to market fluctuation than any other crypto assets, and this means while BtcUSD is in use, the peg remains strong.The reasoning behind this design is simple; BtcUSD allows its users to create stable yield that minimizes risk, through a variety of methods that is enabled by Bifrost’s cross-chain capabilities, as well as ones that do not require it. This effectively allows BTC holders to generate revenue using their BTC, which normally is not possible with native BTC.In order to support native BTC integration into BTCFi, we will be using fraud proof to verify the actions of relayers, a method employed by many Optimistic Rollup L2s on Ethereum. We are in the process of porting our native BTC bridge from Ethereum to Bifrost Network.RoadmapConclusionBTCFi is the spiritual successor to our service that launched two years ago, BiFi(link). BiFi was one of the first product to connect native Bitcoin to Ethereum, and since then, Bifrost Network and its services have come a long way that allows BTCFi to be superior to BiFi in almost every way possible, in terms of infrastructural architecture and usability.What is different, however, is the unique structure offered by BTCFi. The game-changer here is BtcUSD, the key to utilizing EVM DeFi protocols, giving users multiple lossless way of generating revenue. While there already exists several ways this can be achieved, we intend on introducing more ways to utilize BtcUSD in the coming days, so that users may maximize their asset utilization.BTCFi starts and ends with Bitcoin, as we have firm belief that Bitcoin is the most valuable asset to hold, and most ideal to be used for collateral. As firm believers of Bitcoin ourselves, we wish to empower Bitcoin hodlers with DeFi capabilities, so they can maintain their holdings and reap DeFi benefits.We will be launching BTCFi website in the coming days, with exciting launch events in plans. Please keep an eye out, and we’ll see you on the Bitcoin side soon.Bifrost —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "Team & Advisor Distribution",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/team-advisor-distribution-28e326080510",
    "content": "Team & Advisor DistributionBifrost·FollowPublished inBifrost·Jan 31, 2024--ListenShareAfter a year of the successful launch of Bifrost network, we are announcing the distribution of coins allocated for the team and advisor. On January 31st, 2024, a total of 19,106,852 BFC will be distributed as an appreciation for the hard work and invaluable contributions made by our team members and advisors.This distribution is a part of the foundation’s commitment to expressing gratitude to those who have played instrumental roles in our journey towards success. We want to assure our community members that this regular distribution of team and advisor coins does not exceed amounts specified by the coin distribution schedule."
  },
  {
    "title": "Introducing the Web3 KYC Alliance",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/introducing-the-web3-kyc-alliance-be42defb09bf",
    "content": "Introducing the Web3 KYC AllianceBifrost·FollowPublished inBifrost·3 min read·Jan 18, 2024--ListenShareBifrost Foundation, an entity committed to bringing Web3 to all, is proud to announce the launch of theWeb3 KYC Alliance, a groundbreaking initiative aimed at accelerating and fostering the adoption of blockchain in everyday life. Spearheaded by Bifrost Foundation, the alliance brings together industry leaders and innovators with a shared vision for a decentralized and secure digital future.At the heart of the Web3 KYC Alliance is Bifrost’s cutting-edge KYC (Know Your Customer) technology, a revolutionary solution jointly developed with the Korea Identity Certification Agency (KICA). This partnership combines Bifrost’s expertise in blockchain with KICA’s deep knowledge of identity verification, creating a powerful tool that sets a new standard for security and user trust in the Web3 space.The Alliance is also powered by top-tier compliance expertise and backed by a robust 20-million user base fromKICAandCODE. With the combined knowledge of these members, the Alliance seeks to redefine how users utilize Web3 in a decentralized and regulatory compliant manner.One of the critical challenges hindering the widespread adoption of blockchain has been the need for secure and reliable identity verification. Bifrost Foundation recognizes this challenge and is addressing it head-on with the Web3 KYC Alliance.Key features and goals of the Web3 KYC Alliance include:Decentralized Identity Status Verification:The alliance aims to establish a decentralized identity verification system by leveraging Bifrost’s KYC SBT technology, which provides proof of identity verification in a form of a Soul-Bound Token (SBT) once a person has been identified. This system allows users to verify using their wallets that they have KYC status, on services that require KYC, without the risk of personal information exposure.Interoperability:Fostering collaboration and interoperability among various blockchain projects and platforms, the alliance seeks to create a unified standard for KYC processes in the Web3 ecosystem. Bifrost’s native cross-chain capabilities will also allow people to verify themselves on different ecosystems, making their status verification usable across more platforms than ever.Education and Awareness:The Web3 KYC Alliance is committed to educating businesses, individuals, and policymakers about the importance of KYC in the decentralized world. Through webinars, workshops, and outreach programs, the alliance aims to raise awareness and promote best practices.Innovation Hub:Serving as an innovation hub, the alliance will encourage the development of new solutions and applications that leverage decentralized identity verification, opening up new possibilities for businesses and consumers alike.To achieve the aforementioned goals, Bifrost Foundation has developed an identity authentication technology that allows users to identify themselves through KICA, and maintain their identification status on their wallet in a form of SBT. The development on this technology is currently complete and is waiting for implementation in wallets such as Pockie, in preparation of changing landscape in travel rules and regulations. This technology will be provided in a form of API to members of the Alliance as well, enabling fast adoption of regulatory compliance as the need arises.Through this Alliance we hope to achieve faster adoption of Web3, following our ethos of making Web3 accessible to all.Bifrost Foundation invites industry leaders, blockchain projects, and businesses to join the Web3 KYC Alliance and contribute to the advancement of decentralized identity verification. Together, we can build a more secure, transparent, and inclusive digital landscape.For more information about the Web3 KYC Alliance and how to join, please contact Bifrost Foundationhere.Bifrost —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "바이프로스트 API 문서 공개",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-api-%EB%AC%B8%EC%84%9C-%EA%B3%B5%EA%B0%9C-a07d584f3a5f",
    "content": "바이프로스트 API 문서 공개웹2와 웹3를 연결하는 개발자 친화적인 네트워크로서Bifrost·FollowPublished in바이프로스트·2 min read·Sep 21, 2023--Share블록체인 기술은 복잡하며, 블록체인 노드와의 소통 방식까지 이해하기엔 상당한 노력과 시간을 필요로 합니다. 바이프로스트 API 문서를 공개함으로써 웹3에 친숙하지 않은 웹2 개발자에게도 그 과정을 간소화하고자 합니다. 사용자 친화적며 손쉬운 인터페이스는 바이프로스트 네트워크와의 매끄러운 통합을 유도하며, 이는 궁극적으로 바이프로스트를 모두에게 더욱 유용한 네트워크로 거듭나게 할 것입니다.공개되는 API 문서를 통해 바이프로스트 네트워크가 제공하는 데이터에 접근하고 분석할 수 있으며, 이는 금융 애플리케이션 개발, 데이터 분석, 모니터링툴 설계를 비롯한 여러 목표를 이루는 과정을 원활하게 합니다.가장 먼저 공개되는 API는브릿지 API와 대체불가능한 토큰(non-fungible token, NFT) API입니다. 컨트랙트 API와 노드 API를 비롯한 기타 자료는 추후 순차적으로 공개 예정입니다.브릿지 API— 브릿지 API를 활용하면 바이프로스트 브릿지 프로토콜과 관련된 다양한 데이터에 접근할 수 있습니다. 트랜잭션 히스토리, 브릿지 액션 상태, 브릿지 액션을 독립적으로 수행하는 데 필요한 데이터를 비롯한 정보를 확인할 수 있습니다.NFT API— NFT API는 ERC-721 토큰이라고 알려진 NFT와 상호작용하는 과정에 필요한 정보를 제공합니다. 해당 API를 활용하여 NFT 컨트랙트, 토큰 소유자, 토큰 이전 히스토리, 토큰 잔액, 토큰 소유자 및 이전 횟수 등을 비롯한 상세 정보를 확인할 수 있습니다. 또한, 개별 NFT 인스턴스, 각 인스턴스와 연계된 메타데이타, 인스턴스 홀더와 그 변동 히스토리 등을 비롯한 정보 또한 확인할 수 있습니다. 해당 API를 활용하면 바이프로스트 네트워크상의 NFT 애플리케이션과 서비스 개발이 용이해집니다.이처럼 모두에게 유용한 네트워크로 발전하는 바이프로스트를 지켜봐주시기를 바라며, 어려움 없이 웹3를 경험하고 싶은 개발자 여러분의 경우, 지금 바로바이프로스트 API 문서 페이지를 확인해 보세요! 또한, 관련 문의 사항의 경우바이프로스트 포럼에 자유롭게 남겨주시기를 바랍니다.바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "Bifrost API References Now Available",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-api-references-now-available-f709db112156",
    "content": "Bifrost API References Now AvailableDeveloper-friendly and open to Web2Bifrost·FollowPublished inBifrost·2 min read·Sep 21, 2023--ListenShareBlockchain technology is complicated, and understanding the intricacies of communicating with a blockchain node is challenging. We’ve set out to make Bifrost API references public to simplify the process for everyone, even those unfamiliar with Web3. The convenient and user-friendly interface will guide seamless integration with Bifrost.Whether you’re building financial applications, conducting data analysis, or creating monitoring tools, our available APIs will enable you to access and analyze account and transaction data provided by the Bifrost Network.TheBridge APIand theNon-fungible Token(NFT) APIwill be the first references made public and more APIs including the Contract API and Node API will be available in the near future.Bridge API— The Bridge API provides access to comprehensive data associated with the Bifrost Bridge protocol. With this API, it is possible to retrieve information, including the transaction history and status of bridge actions and the essential configuration data required to execute bridge actions independently.NFT API— The Non-fungible Token(NFT) API offers a range of query functions specifically designed for interacting with NFTs, also known as ERC-721 tokens. This API provides detailed information about NFT contracts, token holders, token transfer history, token balances of holders, and the count of token holders and transfers. It also offers details about individual NFT instances, the metadata associated with each instance, the instance holders, and the historical changes of instance holders. With this API, it is possible to retrieve and analyze data related to NFTs and facilitate the development of NFT-focused applications and services on the Bifrost Network.Check out theBifrost API references pageto learn more and make sure to join theBifrost Forumto connect with other developers!BIFROST —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "바이프로스트 어카운트를 소개합니다!",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EC%96%B4%EC%B9%B4%EC%9A%B4%ED%8A%B8%EB%A5%BC-%EC%86%8C%EA%B0%9C%ED%95%A9%EB%8B%88%EB%8B%A4-a524d68c6048",
    "content": "바이프로스트 어카운트를 소개합니다!한층 향상된 웹3 접근성에 다가가며Bifrost·FollowPublished in바이프로스트·4 min read·Sep 12, 2023--Share웹3, 왜 어려울까요? 익숙한 웹2와는 달리 진입장벽이 높고 접근성이 떨어지기 때문입니다. 게다가 웹3는 빠르게 그리고 다양한 방향으로 변화하고 있습니다. 이렇다보니 외부인에게 웹3는 너무나도 어려운 세계입니다. 이에 바이프로스트는 다양한 재미와 가능성을 선사하는 웹3의 세계로 더 많은 사용자를 유입하고, 그들이 실질적으로 활용할 수 있는 쉽고 유용한 인프라와 서비스를 만들어 근본적인 접근성 문제를 해결하고자 합니다. 아무리 기술적으로 훌륭하더라도 소수에게만 허용된 서비스는 좋은 서비스라고 할 수 없기 때문입니다.바이프로스트 네트워크상에서 운영되고 있는 라스트파이(The Last Pie)라는 서비스를 한번 살펴볼까요? 웹3의 새로운 활용성을 제시하는 서비스지만 접근성 문제로 가능성이 상당 부분 제한되었습니다. 서비스 사용 자체는 매우 쉽지만 앞서 지갑 익스텐션을 설치하고, 주소를 생성하고, 가스비에 필요한 토큰을 거래소에서 출금하거나 브릿지를 활용하는 준비 과정은 웹3를 잘 모르는 이들에게 복잡하고 불친절하기 짝이 없습니다. 이렇다 보니 일반인은 사용해보지도 못하고 포기하는 상황이 흔히 발생합니다. 저희는 이러한 접근성 문제에 주목하여 탄생한‘바이프로스트 어카운트’라는 새로운 인프라를 통해 사용자의 페인포인트를 공략하며 실질적인 해결책을 제시하고자 합니다.바이프로스트 어카운트란?이번에 소개하는 바이프로스트 어카운트는 웹3에서 접근성 문제를 해결하는 대표적인 수단으로 업계에서 주목 받고 있는 계정 추상화(account abstraction, AA) 기술과 디앱(DApp)에 바로 연결할 수 있는 웹월렛(web wallet)을 결합한 결과물입니다. (바이프로스트 어카운트 자체는 여러 기술로 구성되며 이에 대해서는 향후 소개 예정입니다.) 바이프로스트만의 자체 AA 기술을 통해 사용자가 자산을 확보하는 과정과 더불어 별도의 지갑 설치와 주소 생성의 문턱을 획기적으로 없앴습니다. 또한, 디앱 특정화 페이마스터(DApp-specific paymaster)를 통해 디앱 맞춤 설정이 가능하도록 설계했습니다. 예를 들어 라스트파이의 경우 방문자 모드를 통해 접속했을 때 최대 3번 가스비 충전 없이 사용 가능하도록 설정되었습니다. 결과적으로 블록체인에 구속되지 않는(blockchain agnostic) 수준으로 우리가 일반적으로 사용하는 웹2와 유사한 접근성과 사용자 경험을 성공적으로 구현했습니다. 또한, 서비스의 특성과 필요에 따라 바이프로스트 어카운트를 적용하고 활용할 수 있습니다.이처럼 바이프로스트 어카운트 인프라를 활용하는 바이프로스트 네트워크 상의 디앱은 한층 향상된 접근성이라는 엄청난 혜택을 누릴 수 있습니다. 또한, 바이프로스트 어카운트는 이제 발돋움한 인프라에 불과하기 때문에 앞으로의 업데이트를 통해 더욱 매끄럽고 향상된 접근성이 필요한 서비스 제공에 도움이 되리라 확신합니다. 더욱 많은 사용자를 유입하고 싶은 웹3 서비스라면 바이프로스트와 함께하지 않을 수 없겠죠? 더욱 궁금하신 분들은 바이프로스트 어카운트가 적용된 실 사례를 아래에서 자세히 살펴보시기를 바랍니다!BA 덕분에 더욱 쉽고 재밌는 라스트파이라스트파이는 바이프로스트 네트워크상에서 운영되는 Click-to-Earn 광고 플랫폼 디앱입니다. 사용자는 라스트파이에 게시되는 광고 클릭 경쟁을 통해 상금을 받을 수 있습니다. 그럼 라스트파이에 적용된 바이프로스트 어카운트를 살펴볼까요?*라스트파이에서 적용된 바이프로스트 어카운트는 현재 베타버전으로 운영되니 참고 바랍니다.BA 사용 이벤트 참여하기바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "Introducing Bifrost Account",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/introducing-bifrost-account-7defa1d1c6db",
    "content": "Introducing Bifrost AccountEn route to seamless Web3 accessBifrost·FollowPublished inBifrost·3 min read·Sep 12, 2023--3ListenShareWhat makes Web3 so difficult? Contrary to the world of Web2 in which we have already immersed ourselves, the barrier to entry is high and accessibility is low. At the same time, the Web3 space continues to evolve fast in a dynamic way — naturally, for outsiders, it can only seem like a huge mystery. However, as we believe Web3 offers many possibilities, we want to bring more people into this space. Our mission is to come up with useful infrastructure and services that would tackle the issue of accessibility and help the process of onboarding so that more people can utilize and enjoy Web3 — no matter how technologically advanced, services reserved for a niche group can never be considered successful.Let’s take a look at The Last Pie as an example. Despite suggesting a new way to utilize Web3, it has been limited due to the issue of accessibility. The service itself is pretty straightforward but installing a wallet extension, creating an address, and moving tokens from exchanges or bridging them to pay for the gas fees is way too complex for those unfamiliar with Web3, and many are likely to give up in the process. It is throughBifrost Account(BA), a new infrastructure aimed at resolving this particular issue of accessibility that we hope to provide an enjoyable Web3 experience for all.Bifrost Account ExplainedAccount abstraction(AA) is a trending method of simplifying and improving accessibility in the Web3 space, and Bifrost Account is the result of combiningAA technologywith a web wallet to allow direct connection to DApps. (Keep in mind that BA itself uses more than AA and consists of several technologies which we will be introducing in the near future.) With Bifrost’s very own AA technology, we have eliminated the steps of installing wallets, creating a wallet address and separately acquiring assets. In addition, customized settings have been enabled by implementing a DApp-specific paymaster. For instance, when accessing The Last Pie under the guest mode, gasless transactions up to 3 times have been enabled. As a result, we have successfully created a Web2-like user experience that is blockchain agnostic. Moreover, BA can be applied and utilized according to the characteristics and needs of every service.Any DApp on the Bifrost Network using the BA infrastructure can benefit from significantly enhanced accessibility. Considering that this application is only the first step of BA, further updates will only take us closer to bringing more seamless experiences to users. So why not join the Bifrost ecosystem and onboard more users to your Web3 service? Please make sure to check out how BA works in the example below!The Last Pie (feat. BA)The Last Pieis a Click-to-Earn advertisement DApp currently running on the Bifrost Network. The service allows users to compete and claim rewards by clicking advertisements. How does BA work on The Last Pie? Let’s check it out!*Disclosure: BA is currently operating as a beta version on The Last Pie.Try out BA and earn rewards!BIFROST —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "베이스 네트워크 공식 지원 안내",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B2%A0%EC%9D%B4%EC%8A%A4-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EA%B3%B5%EC%8B%9D-%EC%A7%80%EC%9B%90-%EC%95%88%EB%82%B4-dc654618200d",
    "content": "베이스 네트워크 공식 지원 안내생태계의 유기적인 통합과 확장을 향해Bifrost·FollowPublished in바이프로스트·3 min read·Aug 30, 2023--Share8월 30일부터바이프로스트 네트워크는베이스(Base)메인넷을 공식 지원합니다. 이는 바이프로스트 네트워크의 CCCP(cross-chain communication protocol)가 베이스 네트워크를 지원함을 의미하며, 이번 업데이트를 통해 초기 지원되는 자산은 Base.ETH와 Base.DAI입니다. 아울러 바이프로스트 브릿지(bridge)는 물론 바이프로스트 네트워크를 기반으로 하는 크로스체인 렌딩 플랫폼 바이파이(BiFi)에서도 베이스의 ETH와 DAI를 활용할 수 있게 됩니다. 그리고 이 모든 것은 지원 네트워크 확대 그 이상의 의미를 가집니다.오늘날의 웹3 공간에서는 코인베이스(Coinbase)나 컨센시스(ConsenSys)를 비롯한 기존 웹3 프로젝트가 베이스나 리니어(Linea)와 같은 새로운 체인을 선보이며 시장에서 입지를 다져 나가는 블록체인의 새로운 흐름이 진행 중이라고 말해도 과언이 아닙니다. 멀티체인 플랫폼인 바이프로스트는 이러한 흐름에 그 누구보다 적극적으로 동참하며 필요에 따라 다양한 프로젝트와 함께, 그리고 때로는 독자적인 선로를 개척하며 새로운 지평을 열어 나가고자 합니다.네트워크 지원과 더불어 연계 자산 및 서비스를 연결한다는 점은 바이프로스트 네트워크 인프라 및 서비스 확장의 차별적인 특징으로 그 결과 무게의 차원이 다를 수밖에 없습니다. 예컨대 바이프로스트 브릿지 사용은 단순히 자산 연결에 그치는 것이 아닌, 크로스체인 디파이 서비스인 바이파이 혹은 바이프로스트 네트워크를 기반으로 하는 모든 디앱과 연결되어 실질적인 효용(utility)을 만들어 냅니다.나아가, 지원 네트워크 확대를 통해 초강력 지갑 포키(Pockie)를 비롯해 바이프로스트 네트워크를 활용하는 모든 서비스 또한 더욱 효율적이고 매력적인 프로덕트로 거듭납니다. 이는 리브랜딩을 기점으로 바이프로스트가 주목하고 있는 사용자 친화적인 웹3에 한 걸음 더 다가가는 발전적인 움직임이자 바이프로스트가 만들어 나가는 생태계의 유기적인 통합과 확장으로 이어지는 결과입니다.다양한 서비스의 통합으로 우리의 상상을 뛰어넘는 다채로운 조합과 그로부터 무수한 기회가 창출된다는 점은 웹3의 크나큰 매력입니다. 그리고 바이프로스트를 활용하고 함께하는 서비스라면 바이프로스트가 만들어 내는 기회를 함께 누릴 수 있으리라 확신합니다. 이처럼 점진적인 노력을 통해 활기찬 생태계를 구축해 나가는 바이프로스트의 행보에 여러분의 많은 응원과 기대 바랍니다.바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "바이프로스트의 새로운",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8%EC%9D%98-%EC%83%88%EB%A1%9C%EC%9A%B4-%EC%84%9C%EB%A7%89-9e050fe1405d",
    "content": "바이프로스트의 새로운바이프로스트의 새로운 서막을 소개합니다Bifrost·FollowPublished in바이프로스트·4 min read·Jun 30, 2023--Share모두가 기다리던 바이프로스트 리브랜딩이 공식적으로 시작되었습니다! 사용자 친화적인 블록체인 기술을 향해 나아가는 바이프로스트의 혁신적인 여정의 서막, 점진적인 리브랜딩의 첫 단추를 구성하는 요소들을 자세히 살펴보겠습니다.로고새롭게 탄생한 로고에 대한 설명으로 리브랜딩 소개를 시작하고자 합니다. 새로운 디자인에 사용된 붉은 색상은 혁신을 향한 바이프로스트의 열정과 의지를 적절하게 반영합니다. 또한, 알파벳 B를 형상화하는 하나의 연속적인 고리는 무한대 기호에서 비롯된 형태로, 블록체인 기술의 무한한 가능성에 대한 신념과 더불어 바이프로스트의 무궁한 잠재력을 나타냅니다. 이처럼 바이프로스트의 정신을 역동적으로 표현하는 로고는 당사의 비전을 실현하는 과정에서 적극적으로 활용될 예정입니다.웹사이트 (Link)새롭게 단장한 웹사이트의 경우 사용성에 초점을 맞춘 당사의 비전을 전적으로 반영합니다. 새로운 로고에 발맞춘 외형적인 변화에 더해, 효율성 극대화하는 구조적 개편이 반영되어 탄생한 새로운 인터페이스를 통해, 필요한 정보를 누구나 쉽고 빠르게 탐색할 수 있습니다. 이처럼 당사의 방향성이 시각적으로 구현된 웹사이트는 바이프로스트와 상호 작용하는 모든 이들을 위한 핵심 플랫폼으로 자리매김할 것입니다.바이파이 (Link)바이프로스트만의 독자적인 크로스체인 기술력을 토대로 보다 강력해진 바이파이(BiFi)가 여러분을 기다립니다. 바이프로스트 네트워크와 체인러너를 기반으로 하는 바이프로스트만의 크로스체인 인프라가 탑재된 바이파이에서는 이더리움의 자산을 담보로 BNB 체인에서 대출을 하는 등, 여러 체인의 자산이 담보로 사용될 수 있습니다. 대출 받은 자산을 바이낸스 런치패드 사용에 활용하는 등, 사용자가 자산을 더욱 효율적으로 관리하도록 합니다. 향후에는 더욱 다양한 담보 옵션과 고급 기능을 제공할 계획입니다. 이처럼 바이프로스트만의 크로스체인 인프라를 최대한으로 활용하여 바이파이를 비롯한 생태계의 모든 디앱은 더 효율적이고 사용자 친화적인 서비스로 거듭날 것입니다.정체성마지막으로, 네트워크로서의 바이프로스트라는 정체성을 확고히 하고자 합니다. 출시를 기점으로 바이프로스트 네트워크는 생태계의 핵심으로 자리 잡으며 성장의 원동력으로 작용했습니다. 이에 따라 바이프로스트의 정체성은 자연스럽게 네트워크를 중심으로 재형성되었습니다. 이처럼 네트워크로서 나아가는 단계에서 바이프로스트는 다양한 웹2 기관과 더욱 활발하게 협력하며, 그들이 탈중앙화 세계로 진입할 수 있도록 돕는 연결고리가 되고자 합니다. 자체 생태계의 성장을 웹3 공간에 국한하지 않는 동시에, 웹3의 혜택을 더 많은 사람들과 공유하는 발전적인 미래로 나아가고자 합니다.이러한 저희의 다양한 노력들은 블록체인 대중화에 한 획을 긋는 의미 있는 결과로 이어지리라 확신하는만큼 앞으로를 기대해 주시기를 바랍니다.리브랜딩을 위한 모든 노력은 사용성을 절대 놓치지 않는 혁신에 맞춰져 있음을 다시금 강조하고 싶습니다. 또한, 오늘의 발표는 앞으로 계획된 여정의 시작에 불과하다는 점을 기억해 주시기를 바랍니다. 점진적인 리브랜딩을 통해 바이프로스트 네트워크를 주축으로 하는 생태계의 모든 제품과 서비스의 사용자 경험을 획기적으로 향상함으로써 자체 생태계를 확장함과 동시에 더욱더 많은 사람들이 웹3를 누리는 미래를 그려나가겠습니다.확고한 비전을 향해 한 걸음 더 나아가는 과정에서 바이프로스트를 향한 여러분의 변함 없는 지지에 대한 감사의 말씀과 함께, 블록체인의 무궁무진한 가능성을 탐구하며 웹3 도입을 선도하는 저희의 여정에 끝까지 함께 해주시기를 부탁드립니다.바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "Introducing Pockie",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/introducing-pockie-4d0d6ee4d4bf",
    "content": "Introducing PockieBifrost·FollowPublished inBifrost·May 24, 2023--ListenShareWe’re excited to announce Pockie, the latest generation of digital wallet. Pockie is integral to our overall effort to achieve effortless multichain for all, and designed for maximum ease in usability. Built upon the existing technology of Biport, Pockie has improved upon its predecessor in almost every way. While Pockie is still in its infancy, we are already excited to envision how people will experience blockchain in this new, easier way. We’ll be announcing more features in the days to come, so please stay tuned for more exciting Pockie news.Don’t forget to pre-register for Pockie through our website,pockie.io, to receive your Early Supporters NFT, as well as a chance to win special $BFC prizes! We’ll be announcing the prizes soon.Below are some sneak peeks at Pockie.BIFROST —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "바이프로스트 생태계 펀드 운용 안내",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EC%83%9D%ED%83%9C%EA%B3%84-%ED%8E%80%EB%93%9C-%EC%9A%B4%EC%9A%A9-%EC%95%88%EB%82%B4-6282009301dc",
    "content": "바이프로스트 생태계 펀드 운용 안내Bifrost·FollowPublished in바이프로스트·2 min read·Feb 17, 2023--1Share바이프로스트는 자체 생태계 활성화를 위해 지난 1월 바이프로스트 생태계 펀드(BIFROST Ecosystem Fund)를 출시하여 운용하고 있습니다. 생태계 펀드 운용을 통해 바이프로스트 생태계에 참여하는 파트너와 함께 성장하고자 지원금(grant)을 제공해나갈 계획입니다.현재 바이프로스트 생태계에 합류할 다양한 프로젝트를 지속적으로 검토하고 있습니다. 그중 지원금 지급 대상으로 일차적으로 선정된 트레져랩스(Treasure Labs)를 오늘 소개합니다!트레져랩스는 2021년 10월 ‘트레져스클럽 MASTERS’를 시작으로 국내 최초 아트 콜렉터블 NFT 1만 6,384개를 완판시킨 NFT∙메타버스∙게임 전문기업입니다. 이더리움 기반 아트캐릭터 IP ‘히어로덕’ 프로젝트의 성공적인 출시에 이어 앱토스 기반 게임용 웹3 서비스 전용 NFT인 ‘N 게임패스’를 출시하는 등 멀티체인 기반 웹3 콘텐츠 사업을 영위하고 있습니다.바이프로스트 생태계 펀드를 통해 분배될 지원금의 경우 개별 프로젝트의 성과 목표 달성에 따라 차등 지급됩니다. 이에 따라 최종적인 지원금 지급 금액 및 시기는 프로젝트마다 상이할 수 있습니다. 바이프로스트 생태계 펀드 운용에 대한 추가적인 내용과 더불어 바이프로스트 네트워크에서 출시될 다수의 프로젝트에 대한 소개가 앞으로 순차적으로 이루어질 예정이니 여러분의 많은 관심과 기대 부탁드립니다!바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "Rebranding Announcement",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/rebranding-announcement-a2be32473d18",
    "content": "Rebranding AnnouncementRebranding, a testament to our pursuit of pioneering the blockchain industryBifrost·FollowPublished inBifrost·3 min read·Jun 8, 2023--1ListenShareBifrost has never been just another blockchain initiative. Conceived as a transformative ambition to redefine the decentralized application world, we have showcased our unwavering commitment to innovation since our inception in 2016. Above all, we have hitherto constructed a holistic blockchain ecosystem like no other with the array of our products, from the lending protocol BiFi to the game-changing wallet Pockie, and our premier Layer-1 blockchain solution, the Bifrost Network, at the core. In light of the continuous growth and expansion of our ecosystem, it seemed only fitting to reiterate our vision of a user-focused future that we are ready to seize. Rebranding thus marks not a deviation but a reaffirmation of our commitment to user accessibility as we continually strive to enhance user experience and make the intricacies of blockchain technology ever more attainable by everyone. It is, without a doubt, a testament to our relentless pursuit of pioneering the blockchain industry.While setting new standards in blockchain innovation, Bifrost’s primary focus has remained on developing cutting-edge technology. Nonetheless, this pursuit of technical excellence has, at times, overshadowed the matter of user experience. Our rebranding initiative is thus a purposeful stride toward rectifying this imbalance by rendering innovation more user-friendly. Through our continuous and concerted effort, we will elevate user experience and bring it to the forefront of our endeavors. We will not only create remarkable technologies but also strive to bridge the gap between our technology and its everyday applications so that users can effortlessly navigate the transformative world of blockchain.Furthermore, rebranding will allow us to further leverage the strengths of our robust mainnet, the Bifrost Network, in constructing a blockchain ecosystem that is more resilient and scalable. We anticipate an influx of diverse applications onboarding our ecosystem, setting the stage for an unparalleled Web3 environment. In the process, our proprietary technology, ChainRunner, along with our underlying APIs, will play a pivotal role in facilitating smooth interaction between DApps and the Bifrost Network to create a harmonious ecosystem where any application can thrive. With this in mind, rebranding is an exciting journey toward this harmony, a process of strengthening the pillars of our ecosystem to lay the foundation for the next generation of blockchain technology.As we embark on this journey, it is crucial to clarify that our rebranding transformation will be a gradual rollout that goes beyond mere cosmetic changes. The phased approach is not a matter of caution but a strategic decision to ensure that every service and every feature aligns with our reimagined vision. From backend solutions like ChainRunner to user-centric applications like Pockie, every aspect of our ecosystem is set for a comprehensive upgrade so as to significantly enhance user experience while maintaining our high technical standards. A progressive and meticulous undertaking will thus ensure that the rebranded outcome stands up to our promise of delivering high-quality, user-friendly Web3 services. More than a new coat of paint, our rebranding journey will usher in a new era of user-centric blockchain technology.We see a future where the wonders of Web3 are not confined to a niche group but are accessible to everyone. Thus, the ultimate goal of rebranding is to onboard various Web2 users and businesses to our ecosystem, thereby expanding the scope of blockchain adoption. For this, blockchain must not appear as an obscure and complex phenomenon — it must serve as an approachable tool providing substantial benefits to businesses and individuals alike. Accordingly, the fundamental focus of our rebranding initiative is to improve usability by combining cutting-edge technology with a smooth user experience. Now on the brink of this exciting transformation, we want to assure our community that Bifrost is committed to bringing about a new era of user-friendly blockchain technology — our rebranding is only the very beginning of this commitment.BIFROST —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "리브랜딩,사용자 중심적인 시대를 열어가며",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%A6%AC%EB%B8%8C%EB%9E%9C%EB%94%A9-%EC%82%AC%EC%9A%A9%EC%9E%90-%EC%A4%91%EC%8B%AC%EC%A0%81%EC%9D%B8-%EC%8B%9C%EB%8C%80%EB%A5%BC-%EC%97%B4%EC%96%B4%EA%B0%80%EB%A9%B0-1f398cd18971",
    "content": "리브랜딩,사용자 중심적인 시대를 열어가며Bifrost·FollowPublished in바이프로스트·4 min read·Jun 8, 2023--Share2016년 설립 이래 당사는 독보적인 블록체인 생태계를 꾸준히 구축하며 혁신에 대한 변함 없는 의지를 보여 왔습니다. 렌딩 프로토콜인 바이파이(BiFi) 부터 멀티체인 지갑 포키(Pockie), 그리고 자체 레이어1 블록체인인 바이프로스트 네트워크(Bifrost Network)까지, 다양한 결과물을 여러분께 선보였습니다. 그리고 생태계가 지속적으로 성장하고 확장하는 시점에서, 당사의 비전을 더욱 확고히 할 필요가 있다는 결론에 도달했습니다. 따라서 이번 리브랜딩은 기존의 방향성에서 벗어나는 어떤 움직임이 아닌, 더 많은 이들이 복잡한 블록체인 기술을 누릴 수 있도록 하겠다는 약속에 대한 재확인인 동시에, 블록체인 산업을 개척해 나가는 끊임없는 노력에 대한 증거입니다.지금까지 바이프로스트는 블록체인 분야에서 새로운 기준을 세워나가며 최첨단 기술을 개발하는 데 주목해 왔습니다. 하지만, 기술적 우수성을 추구하는 과정에서 때때로 사용자 경험은 우선순위에서 밀려나기도 했습니다. 이에 이번 리브랜딩을 통해 저희는 기술적 혁신을 사용자 친화적인 방향으로 바꿔나가며 기존의 불균형을 바로잡아 나갈 계획입니다. 지속적이면서도 일관적인 노력을 통해 사용자 경험을 전폭적으로 향상시키고 이를 저희 서비스 전면에 내세우고자 합니다. 기술 개발 자체에만 힘쓰는 것이 아닌, 기술과 사용성 간의 격차를 좁히는 데 주목하며 일반 사용자가 블록체인의 혁신적인 세계를 손쉽게 탐색할 수 있도록 노력할 것입니다.나아가, 리브랜딩을 통해 자체 메인넷의 장점을 보다 적극적으로 활용하여 탄력적이고 확장 가능한 블록체인 생태계를 구축해 나갈 계획입니다. 다양한 애플리케이션이 바이프로스트 생태계에 합류함에 따라 웹3 환경을 위한 발판이 마련될 것으로 예상합니다. 이 과정에서 바이프로스트만의 독점적인 기술인 체인러너(Chainrunner)는 다수의 디앱(DApp)과 바이프로스트 네트워크 간 매끄러운 상호작용을 유도하여 어떤 애플리케이션도 성공적으로 운영될 수 있는 조화로운 생태계를 만들어 나가는 데 핵심적인 역할을 할 것입니다. 이를 미루어 보았을 때, 이번 리브랜딩은 차세대 블록체인 기술을 지향하는 과정에서 필요한 기반을 강화하는 여정입니다.끝으로, 이번 리브랜딩은 단순한 외관상의 탈바꿈을 넘어서 이루어지는 점진적인 변화라는 점을 강조하고 싶습니다. 이러한 단계적인 접근은 모든 서비스가 재구상된 비전과 일치하도록 하는 전략적 결정에 따른 것입니다. 체인러너와 같은 백엔드 솔루션부터 사용자 중심적인 애플리케이션 포키까지, 바이프로스트 생태계를 아우르는 모든 요소는 사용자 경험 향상이라는 목표에 맞춰 재탄생할 예정이며, 이 과정에서 기술적인 우수성 역시 간과하지 않을 계획입니다. 이러한 세심한 노력을 바탕으로 고품질의 사용자 친화적인 웹3 서비스를 제공하겠다는 당사의 의지를 다지며, 사용자 중심적인 블록체인 기술의 새로운 시대를 열어나가겠습니다.모든 사람들이 쉽게 접근할 수 있는 웹3의 미래를 그리며, 리브랜딩을 통해 다수의 웹2 사용자와 기업이 바이프로스트 생태계에 합류하도록 하며 궁극적으로 블록체인의 대중화에 한 걸음 더 다가가고자 합니다. 결국 블록체인이 모두가 접근할 수 있는 유용한 도구가 되어야 한다는 점에 주목하며, 리브랜딩을 통해 최첨단 기술과 최적의 사용자 경험을 결합하여 사용성을 향상시키고자 합니다. 앞으로 흥미진진한 변화들을 통해 사용자 친화적인 블록체인 기술의 새로운 시대를 열어나가겠다는 약속을 드립니다. 이번 리브랜딩은 끝이 아닌 시작에 불과하다는 점을 기억해 주시기를 바랍니다.바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "Reserve Wallet Readjustment",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/reserve-wallet-readjustment-fab9e4dd78c2",
    "content": "Reserve Wallet ReadjustmentBifrost·Follow1 min read·Feb 22, 2023--ListenShareHello community members.We wanted to let our community be aware that the foundation will readjust the balance of reserve wallets.As a precautionary safety measure, the balance of reserve wallets will be readjusted, as to maintain a similar balance for Foundation wallets. This readjustment is made as a safety measure only.The readjustment of the balance of reserve wallets won’t change the circulating supply of our coins.About the BIFROST NetworkAs the BIFROST Network is a permission-less EVM-compatible layer-one blockchain utilizing Substrate technology focused on enabling interoperability between blockchains, it provides the ultimate environment to build multichain DApps. For instance, the network allows one to purchase a BSC-based NFT using USDT on Ethereum.BFC is the native token of the BIFROST Network which is a generalized message-passing system that is well-suited for all types of cross-chain applications. By design, it can operate with native tokens that inherit the security of the underlying network. The network allows developers to easily build cross-chain applications, such as a cross-chain DEX service using native assets."
  },
  {
    "title": "체인러너를 이용한 ‘크로스체인 스왑’을 소개합니다!",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EC%B2%B4%EC%9D%B8%EB%9F%AC%EB%84%88%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%9C-%ED%81%AC%EB%A1%9C%EC%8A%A4%EC%B2%B4%EC%9D%B8-%EC%8A%A4%EC%99%91%EC%9D%84-%EC%86%8C%EA%B0%9C%ED%95%A9%EB%8B%88%EB%8B%A4-f7feea494bf9",
    "content": "체인러너를 이용한 ‘크로스체인 스왑’을 소개합니다!네트워크를 넘어, 크로스체인 스왑 애그리게이터Bifrost·FollowPublished in바이프로스트·3 min read·Feb 3, 2023--Share안녕하세요, 바이프로스트 팀입니다.바이프로스트는 멀티체인 솔루션에 주목하며 어떻게 하면 체인간 자산 이동을 더 원활하게, 그리고 빠르고 편하게 할 수 있는지에 대해서 치열하게 고민해왔습니다. 그리고 오늘, 새로운 DEX 애그리게이터(aggregator) 서비스인크로스체인 스왑을 통해 바이프로스트가 그려온 멀티체인의 미래를 여러분들께 공개합니다.어떤 문제를 해결하나요?여러 블록체인에 흩어져 있는 자산을 구매하고 사용하려면 부득이 스왑 및 브릿지 기능을 사용해야 하지만, 기존의 서비스를 사용하는 과정에는 여러 불편함이 존재합니다. DEX 사용의 경우 보유한 자산을 스왑하기에 앞서 수 많은 DEX 중 더욱 합리적인 스왑 비율을 찾기 위해 상당한 시간과 노력을 들여 직접 탐색해야만 합니다. 브릿지의 경우, 브릿지 작업 후 유동성 부족 문제로 인한 높은 수수료를 마주하는 경우 (때로는 눈물을 머금고) 다시 기존의 체인으로 자산을 복귀시켜야 하며, 이는 브릿지 수수료를 이중으로 지불하는 결과로 이어집니다. 뿐만아니라 검증되지 않은 브릿지 사용에 따른 자산 손실의 위험성을 비롯한 다른 여러 문제점도 존재합니다. 이러한 문제점들은 사용자들에게 상당한 진입장벽 또는 기회비용으로 작용하여 블록체인 서비스 사용을 저해하는 요인이 되었습니다.크로스체인스왑, 체인러너의 진화바이프로스트는 위와 같은 문제점에 오랜기간 주목하며 사용자가 더욱 편리하고 안전한 블록체인 디파이(DeFi) 서비스를 제공하고자 했습니다. 이에 검증된 DEX 및 브릿지 솔루션을 통합하여 검색하는 똑똑한 엔진인체인러너(ChainRunner)를 앞서 선보인 바 있습니다. 하지만 더 많은 사용자가 보다 손쉽게 서비스를 사용하기 위해서는 사용성 측면에서 개선이 필요함을 느꼈습니다.체인러너의 혁신적인 기술력 위에 최적화된 사용자 경험을 고려한 UI를 입혀 선보이는 바이프로스트만의 크로스체인 스왑! 기존의 서비스를 사용하면서 여러 아쉬움을 겪었던 사용자라면 기대할 수밖에 없는 혁신적인 대안이 아닐 수 없습니다.크로스체인 스왑 미리보기크로스체인 스왑은 여러 DEX를 탐색하여 자산을 다른 체인으로 이동할 때 필요한 브릿지 서비스, 그리고 동일 체인 내에서 다른 종류의 가상자산으로 바꿀 때 필요한 스왑 서비스를 한 화면 안에서 제공합니다. 또한, 크로스체인 스왑은 단일 체인 내 최적 스왑 경로에 그치지 않고, 상이한 체인 간 브릿지 및 스왑 경로까지 탐색하여 제공합니다. 예를 들어 다른 DEX 애그리게이터에서는 이더리움 네트워크의 ETH를 이더리움 네트워크의 BFC로 스왑하는 경로만을 탐색한다면, 크로스체인 스왑에서는 이더리움 네트워크의 ETH를 BNB 네트워크의 AVAX로 네트워크를 넘어 스왑하는 최적의 경로를 제공합니다. 여러분은 크로스체인 스왑에서 제공하는 여러 스왑 경로를 한눈에 확인한 뒤 버튼을 클릭하여 실행만 하면 됩니다.복잡함(complexity)을 단순함(simplicity)으로 변화시키는크로스체인 스왑을 통해 쉽고 재밌는 디파이 서비스를 경험해보세요!크로스체인 스왑 가이드 확인하기.이처럼 앞으로 더 많은 사용자가 더욱 쉽게 이용할 수 있는 다양한 블록체인 서비스를 제공하기 위해 바이프로스트는 끊임없이 달려나갈 예정입니다. 여러분의 지속적인 관심과 응원 부탁드립니다. 감사합니다!"
  },
  {
    "title": "Introducing CrossChain Swap, powered by ChainRunner",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/introducing-crosschain-swap-powered-by-chainrunner-b7cb2b983feb",
    "content": "Introducing CrossChain Swap, powered by ChainRunnerGoing beyond the networkBifrost·FollowPublished inBifrost·2 min read·Feb 3, 2023--ListenShareBIFROST has long focused its efforts on multichain solutions to make cross-chain asset transfer easier, and faster. Today, with the launch of our new DEX aggregator solutionCrossChain Swap, we are excited to reveal yet another chapter of the multichain future envisioned by BIFROST.What problems does CrossChain Swap solve?Existing methods of swapping and bridging accompanied various inefficiencies and difficulties. For one, in order to swap assets, users need to peruse a variety of existing DEXs to find the optimal swap ratio and liquidity. This time-consuming process also requires a profound knowledge of DEXs for users to find the best swap rate. Moreover, a notable problem with bridges is liquidity — users would often bridge their assets to find that the bridged asset has close to no liquidity. This leaves them no choice but to bridge their assets back and spend additional fees. Other problems include uncertainty involved with the security of certain bridges. All these problems ultimately become major opportunity costs that discourage individuals from using blockchain services.CrossChain Swap, the next evolution of ChainRunnerBy focusing on the aforementioned problems, BIFROST sought to provide a more accessible and secure DeFi experience for all. In this regard, we previously launched ChainRunner, a smart engine that aggregated renowned DEXs and bridge solutions. Nonetheless, we felt the need to dramatically upgrade the usability of the service to make the experience more satisfactory.CrossChain Swap istheanswer to this need — the revolutionary technology powered by ChainRunner has been upgraded with a UI optimized to significantly enhance the user experience. It can only bethebest alternative to existing services which rendered much disappointment on various levels.CrossChain Swap at a GlanceBy searching through a multitude of existing DEXs, CrossChain Swap provides all the necessary bridging and swapping services within a blockchain in one single screen. It not only provides the optimal swap route within a single chain but also searches possible routes between multiple chains. For example, if a user wishes to swap ETH on Ethereum to BFC on Ethereum most other DEX aggregators would only show results upon scanning the possible routes on the Ethereum Network. However, CrossChain Swap searches for multiple optimum routes across different networks and yield results such as converting ETH on Ethereum to AVAX on the BNB network. Therefore, users only need to browse through the different options presented by CrossChain Swap and simply click the most desired swap route.Make DeFi great again withCrossChain Swap, designed to simplify all the complexities of the cross-chain experience!Check out the detailed guide to CrossChain Swap.Please look forward to the future with BIFROST as we dedicate ourselves to the ultimate vision of making blockchain services easier and more accessible to users. Thank you!"
  },
  {
    "title": "바이프로스트 네트워크 메인넷 공식 출시",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EB%A9%94%EC%9D%B8%EB%84%B7-%EA%B3%B5%EC%8B%9D-%EC%B6%9C%EC%8B%9C-8ef19afab6ed",
    "content": "바이프로스트 네트워크 메인넷 공식 출시새로운 멀티체인의 미래가 시작됩니다!Bifrost·FollowPublished in바이프로스트·4 min read·Jan 30, 2023--Share바이프로스트의 자체 메인넷인 바이프로스트 네트워크가 출시되었습니다! 진정한 멀티체인 서비스 구현을 향해 나아갈 바이프로스트 네트워크에 관한 중요 문서는여기서 확인하실 수 있습니다.바이프로스트의 발자취바이프로스트(BIFROST)는 개발자들이 다수의 프로토콜 상에 디앱(DApps)을 구축하도록 하는 혁신적인 미들웨어 플랫폼으로 시작했습니다. 자체 멀티체인 기술을 통해 바이프로스트는 최적의 프로토콜을 활용하고 도입하여 더욱 빠르고 저렴한, 그리고 더욱 유연한 디앱을 개발할 수 있는 환경을 마련해왔습니다.바이프로스트를 출시한 파이랩테크놀로지는 금융 및 컴퓨터 공학을 전공한 전문가들에 의해 창립되었으며, 최상의 크로스체인 개발을 가능케 하는 환경을 구현하는 데 힘써왔습니다. 블록체인 공간에서 필요로 하는 금융 서비스, 게임 등을 위한 효율적인 인프라의 필요성에 주목하며 바이프로스트 팀은 여러 블록체인 생태계를 연결하는 네트워크를 통한 안전한 상호운용성을 구현하고자 노력했습니다.메인넷 출시를 통해 바이프로스트는 새로운블록체인 네트워크로 확장 및 전환하며 궁극적으로 더 많은 이들이 디앱을 활용할 수 있도록 합니다. 혁신을 이끌어가는 최신 기술과 열정적인 팀을 통해 바이프로스는 모두가 디앱과 상호작용하는 방식을 새롭게 만들어 나갈 계획입니다.바이프로스트 네트워크 메인넷 출시바이프로스트 네트워크는 완전히 탈중앙화된 투명한 네트워크로 상호운용성(interoperability)을 지향합니다. 여러 블록체인 네트워크 간 자산 이동을 가능하게 함으로써 디앱을 더욱 효율적이고 경제적으로 사용할 수 있게 됩니다.바이프로스트를 통해 사용자는 중간자 없이 자산을 손쉽게 이동할 수 있습니다. 바이프로스트는 현재 이더리움(Ethereum), BNB 체인(BSC), 폴리곤(Polygon), 바이프로스트 네트워크를 지원하고 있으며 그 수를 지속적으로 늘려나갈 예정입니다.바이프로스트 생태계다수의 디앱이 바이프로스트의 자체 디앱 지원 프로그램인 바이프로스트 생태계 펀드에 지원을 완료한 상황입니다. 바이프로스트는 펀드를 통해 앞으로 바이프로스트 생태계와 함께할 여러 디앱을 지원하며 성장해나갈 예정입니다.이번 메인넷 출시 시점부터 제공되는 서비스는 다음과 같습니다. 앞으로 더욱 다양하고 많은 디앱이 출시될 예정이니 참고 바랍니다.웹3 지갑인바이포트(Biport)및메타마스크(MetaMask)지원비프스왑(Bifswap)BFC 스테이킹빌트인(built-in) 크로스체인 브릿지(cross-chain bridge)바이프로스트 익스플로러벨리데이터에 의해 검증되는 정확한 오라클 서비스더 알아보기.추가 예정 기능다수의 NFT와 디파이(DeFi) 디앱추가적인 지갑 연계바이프로스트 멀티체인 DEX인덱싱 서비스애그리게이터(aggregator) 구현BFC 스테이킹BFC는 바이프로스트 네트워크의 네이티브 코인으로 바이프로스트의 멀티체인 생태계에서 중요한 역할을 수행합니다. 네트워크의 스마트 컨트랙트를 구동하고 트랜잭션을 처리하는 과정에서 발생하는 수수료를 지불하기 위해 BFC가 필요합니다.그동안 바이프로스트 생태계를 믿고 지지해주신 홀더분들에게 바이프로스트 네트워크 스테이킹 방법을 안내해드리니 BFC 스테이킹에 참여하신 분들과 앞으로 참여하실 분들은 반드시 관련 문서를 확인하시기 바랍니다.바이프로스트와 나아가기앞으로 여러분이 바이프로스트와 함께할 여정에 대하여 차근차근 안내해드릴 예정입니다. 우선 아래 링크를 통해 스테이킹 방법, 브릿지 사용방법 및 네트워크 연결방법, 그리고 바이프로스트의 탈중앙화 거래소(DEX)인 비프스왑(Bifswap)에 대한 글을 확인하실 수 있습니다.바이프로스트 네트워크 스테이킹바이프로스트 네트워크 브릿지바이프로스트 네트워크 연결하기비프스왑에 대해 알아보기이번 메인넷 출시를 기반으로 앞으로 바이프로스트 팀과 커뮤니티가 함께 만들어나갈 바이프로스트의 생태계에 여러분의 많은 기대 부탁드리며, 테스트넷의 공식 종료와 함께 메인넷의 시작을 알립니다! 감사합니다.바이프로스트 —홈페이지|트위터|디스코드|레딧|텔레그램"
  },
  {
    "title": "The BIFROST Network is Live!",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/the-bifrost-network-is-live-b66aaa19b203",
    "content": "The BIFROST Network is Live!The future of multichain is hereBifrost·FollowPublished inBifrost·3 min read·Jan 30, 2023--ListenShareThe wait is over, the BIFROST Network is now officially live! You can access all the necessary documents and guideshere.About BIFROSTBIFROSTstarted as a revolutionary middleware platform that enables developers to create decentralized applications(DApps) on top of multiple protocols. With its multichain technology, BIFROST provides a new environment where developers can seamlessly integrate the best protocols to create faster, cheaper, more transparent, and more flexible DApps.Founded in 2017 by a team of experts in finance and computer science, BIFROST was created with the goal of providing the best environment for optimal cross-chain development. Recognizing the need for efficient infrastructure for financial services, gaming, and other applications in the blockchain space, the team set out to create a network that connects the diverse ecosystem of blockchains and enables secure and robust interoperability.In pursuit of this goal, BIFROST is now shifting its focus to expand to a new blockchain network, with the ultimate vision of making DApps work for everyone. With its cutting-edge technology and a team dedicated to driving innovation, BIFROST is poised to revolutionize the way we interact with DApps.BIFROST Mainnet LaunchThe BIFROST Network is a fully decentralized, trustless, and transparent network for interoperability. It enables the transfer of assets across different blockchain networks, allowing for more efficient and cost-effective use of DApps.With BIFROST, users can now easily move assets between different blockchains without the need for centralized intermediaries. Our platform currently supports multiple blockchain networks including Ethereum, BNB Chain, Polygon, and the BIFROST Network with plans to support more chains in the future.The BIFROST EcosystemMany DApps have already applied to our recently launched DApp support program, theBIFROST Ecosystem Fund, a perpetual program that will support the growth of the BIFROST Ecosystem and the many DApps that join us.As the BIFROST Network is launching its mainnet, we can outline some of the already available features. Many more amazing DApps will be released in the coming days.Multiple wallet providers, including our proprietary cross-chain walletBiportand known providers such asMetaMask.Bifswap (the first version of what will eventually be BIFROST’s multichain DEX)BFC stakingBuilt-in cross-chain bridgeBIFROST ExplorerA reliable price oracle with prices verified by our validatorsYou can find out morehere.Future features include the followingDeployment of multiple DApps from games to NFTs to DeFiMore wallet integrationsBIFROST Multichain DEXIndexing servicesAggregator implementationsBFC StakingBFC is the native coin of the BIFROST Network that serves asthe backbone of the BIFROST multichain ecosystem. BFC isused as the network fee for running smart contracts andexecuting transactions on the BIFROST Network.Today we are excited to announce the new and enhanced BIFROST Network staking, the next step in striving to become a better ecosystem all the while rewarding our most loyal users.We strongly encourage current BFC stakers to read the full article as they will find a complete guide on how staking on the BIFROST Network works.You can read more about ithere.What’s next?We are excited to guide you through the BIFROST journey! Here is a step-by-step guide on how to stake, bridge to and connect to the BIFROST network, and also how to use Bifswap, our decentralized exchange (DEX) built on top of BIFROST.The BIFROST Network Staking GuideHow to bridge to the BIFROST NetworkHow to connect to the BIFROST NetworkIntroducing BifswapThe BIFROST Team and community are very excited to achieve this long-awaited milestone. Goodbye BIFROST testnet — the mainnet is here!BIFROST —Website|Twitter|Discord|Reddit|Telegram"
  },
  {
    "title": "바이프로스트 네트워크 밸리데이터로 ‘디스프레드’ 합류",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/%EB%B0%94%EC%9D%B4%ED%94%84%EB%A1%9C%EC%8A%A4%ED%8A%B8-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EB%B0%B8%EB%A6%AC%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A1%9C-%EB%94%94%EC%8A%A4%ED%94%84%EB%A0%88%EB%93%9C-%ED%95%A9%EB%A5%98-e6e86264f5f3",
    "content": "바이프로스트 네트워크 밸리데이터로 ‘디스프레드’ 합류Bifrost·FollowPublished in바이프로스트·3 min read·Dec 23, 2022--Share바이프로스트 네트워크의 밸리데이터로 블록체인 전문 컨설팅 기업 디스프레드(DeSpread)가 공식 합류합니다. 이번 합류를 통해 디스프레드는 바이프로스트 네트워크의 검증 과정에 참여합니다. 이처럼 공신력 있는 기업의 참여로 바이프로스트는 네트워크의 성공적인 출시와 운영을 준비하고, 바이프로스트만의 독보적인 블록체인 생태계를 안정적으로 확장해나가려고 합니다.바이프로스트 팀은 최근에 1차 인센티브 테스트넷을 성공적으로 마무리했으며, 현재 2차 테스트넷(BIT2) 및 디앱(DApp) 지원 프로그램인 Ecosystem Kickstart Initiative 운영을 통해 자체 메인넷 준비에 박차를 가하고 있습니다. 현재 폭발적인 관심을 모으며 업계의 주목을 받고 있는 2차 테스트넷 BIT2의 경우 Crew3 플랫폼을 통해 누구나 참여하실 수 있습니다.더 알아보기.디스프레드에 관하여디스프레드는 2019년 창립된 웹3 및 블록체인 전문 컨설팅 기업입니다. 솔라나, 스택스, 더샌드박스, 액시인피니티 등 유망 글로벌 프로젝트를 초기 단계에 발굴하고 프로젝트의 성공적인 시장 진출을 위해 힘써왔고, 또한 최근 디스프레드 산하의 디스프레드랩스는 오르빗, 앱토스, 수이 등 다양한 프로젝트의 밸리데이터로 참여하여 네트워크 검증 과정에 기여하고 있습니다.현재 다양한 네트워크와 활발하게 협업하고 있는 디스프레드와의 협업을 바탕으로 바이프로스트는 진정한 멀티체인 서비스를 구현하고자 합니다.바이프로스트 네트워크에 관하여바이프로스트 네트워크는 서브스트레이트(Substrate)기술을 활용하여 진정한 멀티체인 서비스를 구현하고자 하는 새로운 EVM 호환 블록체인으로 멀티체인 DApp을 구축할 수 있는 최적의 환경을 제공합니다. 예를 들면 체인 간 호환을 통해 BSC 기반 NFT를 이더리움의 USDT로 구매할 수 있도록 합니다.바이프로스트 네트워크의 네이티브 토큰은 BFC이며, 체인간 메시지를 전달하고 각 체인의 토큰을 바로 사용할 수 있는 브릿징 기능 및 디파이(DeFi) 서비스를 빌트인(built-in)으로 지원합니다. 바이프로스트 네트워크는 개발자들이 손쉽게 크로스체인 애플리케이션을 개발할 수 있도록 지원합니다. 네이티브 자산을 활용한 크로스체인 DEX 서비스를 예로 들 수 있습니다."
  },
  {
    "title": "‘DeSpread’ Joins as a BIFROST Network Validator",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/despread-joins-as-bifrost-network-validator-197d0872c884",
    "content": "‘DeSpread’ Joins as a BIFROST Network ValidatorBifrost·FollowPublished inBifrost·2 min read·Dec 23, 2022--2ListenShareDeSpread, a consulting firm specializing in Web3 & blockchain, will officially join as a validator of the BIFROST Network and thus take part in verifying and securing the network. With such reputable companies sharing our vision, BIFROST hopes to further prepare for the successful launch and operation of its mainnet, while expanding its one of a kind blockchain ecosystem.The BIFROST Team has recently concluded the first BIFROST Incentivized Testnet and is now en route to launching its very own mainnet through the Ecosystem Kickstart Initiative and the second BIFROST Incentivized Testnet (BIT2), which is currently gaining much attention in the community. We’d like to remind you that anyone can participate in BIT2 and contribute to the BIFROST Ecosystem through Crew3!Read more about BIT2 here.About DeSpreadDeSpread is a consulting firm specializing in Web3 & blockchain founded in 2019. As an early participant, DeSpread has contributed to the success of multiple global projects such as Solana, Stacks, The Sandbox, Axie Infinity. In addition, DeSpread Labs under DeSpread has been participating as a network validator in various projects including Orbit, Aptos, and Sui.By collaborating with DeSpread, an active participant in the blockchain ecosystem, BIFROST plans to establish a true multichain service.About the BIFROST NetworkAs the BIFROST Network is a permissionless EVM-compatible layer-one blockchain utilizing Substrate technology focused on enabling interoperability between blockchains, it provides the ultimate environment to build multichain DApps. For instance, the network allows one to purchase a BSC-based NFT using USDT on Ethereum.BFC is the native token of the BIFROST Network which is a generalized message-passing system that is well-suited for all types of cross-chain applications. By design, it can operate with native tokens that inherit the security of the underlying network. The network allows developers to easily build cross-chain applications, such as a cross-chain DEX service using native assets."
  },
  {
    "title": "BIFROST Twitter & Supply",
    "author": "Bifrost",
    "url": "https://medium.com/@bifrost/bifrost-twitter-supply-8417330bdb45",
    "content": "BIFROST Twitter & SupplyBifrost·Follow3 min read·Dec 6, 2022--Share안녕하세요. BIFROST 팀입니다. 우선 트위터 게시물로 인한 혼란을 드려 죄송합니다.2022년 11월 30일 오전 경 글로벌 팀원분들이 좋은 소식인 BIT 2를 전하고자 게시한 게시물이 커뮤니티에 혼란을 야기했습니다. 사건 발달의 원인으로는 글로벌 팀원분들이 소셜 미디어 표현 방식에 차이가 있어 발생되었습니다. 트위터 게시물 외에도 재단의 보유 물량 내용을 정리하여 커뮤니티 멤버분들에게 정리 드립니다.트위터 이슈 경위11월 30일 오전 10시 19분에 문제가 되었던 게시물이 게시되었습니다.해당 게시물 게시 후 BFC의 변동성과 오해를 야기할 수 있는 부분이 있기에 내부 회의 결과 트윗의 내용을 직관적으로 변경하기로 결정했습니다. 하지만 트위터는 수정 기능을 지원하지 않으므로, 수정 대신 해당 게시물 삭제 후 신규 게시물을 작성했습니다.2022년 11월 30일 오후 12시 28분경에 해당 게시물은 삭제가 되었으며, 2022년 11월 30일 오후 12시 51분경에 직관적인 내용의신규 트윗이 작성되었습니다.트윗 공지 후 락업 해제 매도 루머이슈가 된 후 재단이 보유 물량을 매도했다는 루머가 커뮤니티에 퍼졌습니다. 재단은 트윗 전후 보유 물량을 매도한 적이 없습니다. 일정 규모 이상의 재단 물량이 이동되는 경우 저희는 항상 선공지 후 이동을 원칙으로 하고 있습니다. 가장 최근에 발생한 BFC 이동은 BIT (BIFROST Incentivized Network)의 참여자분들의 보상 지급을 위해 발생되었고,미디엄을 통해 발표된 이후에 이동 되었습니다.재단 물량 매도 외에도 업비트에 공시된BFC 자산 유통 계획과 현재 유통량과 비교 후 차이점에 관한 질문을 많이 주셨습니다. 우선 업비트에 PDF 파일로 업로드된 BFC의 유통 계획서는 유통 가능한 최대 물량입니다. 아직 사용할 필요가 없는 BFC의 경우 굳이 유통할 필요가 없어서 실제로 유통되고 있는 BFC의 양은 해당 파일의 유통량보다 적습니다. 최근 논란이 되었던 몇몇 프로젝트의 경우 유통 계획서보다 더 많은 코인이 유통되고 있다는 것이 논란의 핵심이였습니다.또한 모든 재단의 지갑들은업비트 API와CoinGecko API와 연동이 되어 있어서 재단 지갑에서 외부로 BFC가 이동할 경우 유통량이 바로 상승되어서 표기되기에 누구나 실시간으로 BFC 유통량을 확인 하실 수 있습니다.앞으로도 일정 규모 이상의 BFC 이동이 있을 경우, 이전처럼 선공지 후 이동될 예정입니다.트위터 향후 운영 방안본 게시물로 발생된 혼란에 대해 다시 한번 사과드립니다. 추후 관련 이슈 방지 및 투자자 보호를 위해서 글로벌 마케팅 담당자들에게 대한 문책과 교육을 진행하였으며, 앞으로 업로드될 모든 트위터는 투자자 보호에 대한 이해도가 높은 C Level의 승인을 통해서만 게시가 가능한 시스템을 구축할 예정입니다. 또한 이러한 시스템이 구축되기 전까지는 트위터 활동은 중단될 예정입니다.저희 BIFROST 커뮤니티 여러분께 혼란을 드린 점 다시 한 번 사과드립니다."
  },
  {
    "title": "BFC, BiFi 토큰 KuCoin상장 안내",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/bfc-bifi-%ED%86%A0%ED%81%B0-kucoin%EC%83%81%EC%9E%A5-%EC%95%88%EB%82%B4-d09c0fafeced",
    "content": "BFC, BiFi 토큰 KuCoin상장 안내Bifrost·FollowPublished in바이프로스트·4 min read·May 10, 2022--Share안녕하세요, BIFROST팀입니다.BFC와 BiFi토큰이KuCoin에 상장될 에정입니다.거래 오픈 일시:BFC: 2022년 5월 11일 18:00 (KST)BiFi: 2022년 5월 11일 19:00 (KST)KuCoin X BIFROST 에어드랍 이벤트BIFROST와 KUCOIN의 파트너십을 기념하여 에어드랍 이벤트를 진행합니다.이벤트 링크를 통해 KUCOIN에 가입 후, 참여 절차를 따라주시면 선착순 에어드랍이 지급됩니다!이벤트 기간:(KST) 2022년 5월 10일 ~ 2022년 5월 17일 23:59까지Event#1 KuCoin에 입금하고, 에어드랍 받자!참여 대상:이벤트 링크로 신규 가입한 KuCoin유저[KuCoin 가입하기]를 클릭해 KuCoin 거래소에 회원가입하세요.외부 거래소 또는 지갑에서 KuCoin 거래소 지갑으로 20USDT 이상 암호화폐를 입금하세요에어드랍 보상:5USDT 상당 BFC(3000명, 선착순)Event#2 KuCoin에서 현물 거래하고, 에어드랍 받자!참여 대상:Event#1 참여자[KuCoin 가입하기]를 클릭해 KuCoin 거래소에 회원가입하세요.현물 거래량 200USDT 이상을 달성하세요(BiFi, BFC 추천)거래량 조건을 달성하신 분 중 3000분께 에어드랍을 드립니다.에어드랍 보상: 10USDT 상당 BFC(3000명,선착순)에어드랍 보상은 이벤트 종료 후 2주 이내에 지급됩니다본 이벤트의 최종 설명권은 KuCoin 및 BIFROST에 있습니다.이벤트 링크:https://www.kucoin.com/r/af/QBSSSY95를 통해 가입한 신규 유저 대상 이벤트 입니다.KuCoin 거래소KuCoin은 다양한 디지털 자산과 암호화폐를 지원하는 글로벌 암호화폐 거래소입니다. 2017년 9월에 출시된 KuCoin은 코인마켓캡 기준 거래량 Top5를 기록하는 세계적인 글로벌 암호화폐 거래소로, 현재 전 세계 200개 이상의 국가 및 지역에서 천만 명이 넘는 사용자를 보유하고 있습니다.BFC토큰BFC 토큰은 바이프로스트(BIFROST) 기반의 DApp에서 수수료로 사용됩니다. BIFROST에서 개발한 멀티체인 DeFi 서비스인BiFi에서 발생하는 수수료 또한 BFC로 환전되어 지불되므로 BFC의 사용성은 무한합니다.BIFROST는 DApp과 DeFi 프로젝트에서다양한 블록체인의 동시 사용이 가능하도록 지원하는멀티체인 플랫폼입니다. 개발자는 Bifrost를 통해 가장 적합한 블록체인을 선택, 조합할 수 있습니다. BIFROST는 더욱 강력한 확장성과 상호운영성, 유연성을 갖춘 완전히 새로운 블록체인 생태계에서 DApp 개발을 가능하게 합니다. Bifrost는 서로 소통이 불가한 상태에서 경쟁중인 블록체인 생태계를 한데 이어주는 공통 언어입니다.BiFi 토큰BiFi토큰은 BiFi 서비스에서 통용되는 화폐입니다. Lending, Pooling, Staking 서비스 사용시 보상으로 BiFi 토큰이 지급 되며, BiFi 생태계의 참여자가 됩니다.“BiFi 투자, 이런 분께 추천드립니다”-탈 중앙화 대출 및 예금 플랫폼에 투자하고자 하시는 분-BiFi 지분 보유를 통해 BiFi 거버넌스 시스템에 참여하고자 하시는 분멀티체인 DeFi 서비스 및 상품 사용을 위한 BiFi 지불이 필요하신 분상장 거래소BiFi, BFC 토큰의 상장 거래소는여기서 확인하세요.ResourcesBIFROST 가 처음이신가요? 아래 정보를 확인하세요!BIFROST/BiFi/BiFi X/Biport/ChainRunner Q공식홈페이지BiFi에서Lending하세요!BFC & BiFi 토큰 정보BIFROST & BiFi와 함께 하세요!텔레그램:Korea|Global|Vietnam|Japan|Indonesia|China무엇이든 물어보세요:AMA Korea|AMA GlobalSNS:Twitter (BIFROST)|Twitter (BiFi)|Facebook|YouTube|Reddit|Weibo|Discord"
  },
  {
    "title": "BIFROST Token (BFC), BiFi Token (BiFi) Listing on KuCoin",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bifrost-token-bfc-bifi-token-bifi-listing-on-kucoin-77642c930f75",
    "content": "BIFROST Token (BFC), BiFi Token (BiFi) Listing on KuCoinBifrost·FollowPublished inBifrost·2 min read·May 10, 2022--2ListenShareWe’re excited to announce that BIFROST token (BFC) and BiFi token (BiFi) has listed onKuCoin!Date: May 11, 2022 9:00 AM UTC-Available Trading Pair BFC/USDTDate: May 11, 2022 10:00 AM UTC-Available Trading Pair BiFi/USDTMake sure to check out ourlimited-time-only eventsbelow!KuCoin X BIFROST Airdrop EventTo commemorate BIFROST’s partnership with KuCoin, an airdrop event will be held starting tomorrow, May 11, 2022. Sign up for KuCoin using thisEvent Linkand win BFC airdrops. Rewards will be distributed 2 weeks after the events end.Event Duration:May 11, 2022 — May 17, 2022 at 2:59 PM (UTC)EVENT #1 — Deposit on KuCoin and Win BFC AirdropsHow to Enter:New KuCoin registrants viaEvent LinkSign Upwith KuCoin exchangeDeposit at least 20USDT worth of crypto to KuCoin exchange from either an external exchange or walletReward:5USDT worth of BFC per person (first 3000 people)EVENT #2 — Trade on KuCoin and Win BFC AirdropsHow to Enter:all Event #1 participantsSign Upwith KuCoin exchangeTrade at least 200USDT worth of crypto (BFC or BiFi is highly recommended) on KuCoin exchangeReward: 10USDT worth of BFC per person (first 3000 people)*The final right to event details belong to KuCoin and BIFROSTAbout KuCoinKuCoinis a global cryptocurrency exchange for numerous digital assets and cryptocurrencies. Launched in September 2017, KuCoin has grown to become one of the top 5 most popular crypto exchanges and already has over 10 million registered users across 200+ countries and regions around the world.About BIFROST Token(BFC)BFC (BIFROST token)is the currency of BIFROST’s multichain ecosystem. Developers will need to pay BFC for using the multichain service to develop and operate their DApps. BIFROST is a multichain platform that supports the simultaneous use of all blockchains in DApp and DeFi projects. It enables DApp development in an entirely new blockchain ecosystem with greater scalability, interoperability and flexibility.About BiFi (BiFi) TokenBiFi (BiFi Token)is the currency of BiFi platform, a multichain DeFi built on BIFROST. By using Lending, Pooling, and Staking services on the platform, you get rewarded in BiFi tokens and become stakeholders of the protocol.BiFi tokens can be used in the following ways:Pay BiFi for using multichain DeFi servicesStake and participate in BiFi’s governance systemClick to buy BFC and BiFi"
  },
  {
    "title": "BIFROST가 바라본 컨센서스 2022",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/bifrost%EA%B0%80-%EB%B0%94%EB%9D%BC%EB%B3%B8-%EC%BB%A8%EC%84%BC%EC%84%9C%EC%8A%A4-2022-70e9874b2d05",
    "content": "BIFROST가 바라본 컨센서스 2022Bifrost·FollowPublished in바이프로스트·4 min read·Jul 1, 2022--Share안녕하세요 BIFROST 팀입니다.세계 최대 크립토 행사인 ‘컨센서스(Consensus) 2022’에 BIFROST 팀도 빠지지 않고 참가했습니다. 코로나로 인해 3년 만에 개최된 오프라인 행사인 만큼, 전 세계에서 무려 1만 5천 명에 육박하는 참가자가 텍사스 오스틴에 모여 암호화폐 산업 전반에 대하여 나흘간 열띤 논의를 이어 나갔습니다. 이처럼 꽁꽁 얼어붙은 크립토 시장 상황이 무색할 만큼 현지의 열기는 너무나도 뜨거웠습니다.BIFROST팀은 1inch, Pantera, Polygon, Binance, ComputeCoin, NEAR 등이 주최한 이벤트에 참석하여 1inch의 CBDO인 Nikita Ovchinnik, Trust Wallet의 CEO Eowyn Chen, Circle의 CEO Jeremy를 비롯한 연사들과 교류하면서 BIFROST만의 경험을 공유했습니다. 특히, 출시를 앞둔BIFROST 네트워크와 이를 기반으로 구축될 저희BIFROST만의 독자적인 생태계에 대해서 많은 이야기를 나눌 수 있었습니다.이번 컨센서스에서 가장 많이 언급된 주제 중 하나는 ‘상호운용성(interoperability)’이었습니다. 이와 관련된 논의는 진정한 상호운용성이 DeFi, GameFi 및 NFT 분야 전반에 걸쳐 자리 잡을 때까지 계속 이어지리라 예상합니다. 이에 블록체인을 연결하는 기술에 투자하는 프로젝트들이 나날이 늘어나고 있으며, 관련 기술은 앞으로 더욱 각광받을 것으로 전망합니다.BIFROST는 탄생 이래 누구보다 한 발짝 앞서 상호운용성에 집중해 왔으며, 이는 현재 출시를 앞둔 BIFROST 네트워크의 핵심이라 할 수 있습니다.“이번 컨센서스 행사를 통해서 크립토 산업에서 진정한 상호운용성은 절대적으로 중요한 역할을 한다는 결론을 다시금 확고히 할 수 있었습니다. 진정한 상호운용성이란 어떠한 중개자 또는 다른 DeFi 서비스를 거치지 않고 네이티브 체인에서 직접 스왑 또는 거래할 수 있는 능력을 의미하며, 이는 BIFROST 네트워크를 통해서 우리가 궁극적으로 이루고자 하는 목표입니다.”상호운용성을 기반으로 만들어진 정교한 프로토콜의 등장에 힘입어 크립토 시장은 투기의 장에서 혁신의 공간으로 탈바꿈하며 전통 금융시장을 흔들기 시작했습니다. 2015년 스마트컨트랙트 개념 발표 이래 전체 dApp의 60% 이상이 이더리움 프로토콜 기반으로 개발되어 왔지만, 세계 각지에서 여러 유능한 팀들은 이더리움을 따라잡으려는 시도를 이어 나가고 있습니다. 몇몇 Layer1 프로젝트들이 뛰어난 성과를 이뤄냈다고도 볼 수 있으나 커뮤니티의 인정과 신뢰가 프로젝트의 성공에 크게 기여한다는 점을 감안했을 때 어떤 프로젝트도 성공했다고 판단하기엔 아직 이릅니다. 커뮤니티의 핵심적인 역할에 관한 많은 논의가 오가는 이번 컨센서스의 현장에서 커뮤니티를 구축하고 함께 발맞춰 성장하는 것이 그 어느 때보다 중요해졌음을 확인할 수 있었습니다.나아가, 최근의 저조한 시장 분위기에도 불구하고 크립토 산업은 혁신적인 기술을 기반으로 거침없이 성장하고 진화하며 여타 산업으로부터 주목받고 있습니다. 이번 컨센서스에서도 개인 투자자가 아닌 관련 분야의 전문가로서 참가한 전통 금융사 관계자들을 많이 발견할 수 있었습니다. 또한, 최근 스포츠 업계와의 파트너십도 점차 인기를 끌기 시작했으며, 시장이 과포화되었다는 의견이 분분하지만 흉흉한 시장 상황에도 불구하고 NFT에 대한 다양한 이해관계자들의 뜨거운 관심은 역시나 식을 줄 몰랐습니다.이번 컨센서스 기간 동안 악화된 시장 상황은 오히려 현장의 열기를 더욱 활활 타오르게 하지 않았나 생각합니다. 뜨거웠던 컨센서스의 현장에서 BIFROST 팀은 다양한 파트너사 그리고 훌륭한 참가자들과 교류하며 새로운 미래에 대한 발전적인 고민을 이어 나갈 수 있었습니다. 현재 장기화 되고 있는 크립토 겨울은 많은 분들에게 물론 어려운 시기일 테지만, 베어마켓은 강하고 유능한 팀이 성장할 수 있는 기회라고 저희 팀은 굳게 믿습니다. 블록체인, 암호화폐 그리고 Web3의 다양한 커뮤니티들이 한층 더 성장할 수 있는 멋진 기회를 제공한 코인데스크와 여러 후원사에게 이 글을 빌려 감사의 말을 전하며, 다가오는BIFROST 네트워크의 출시에도 많은 기대와 관심 부탁드립니다!BIFROST & BiFi가 처음이신가요?BIFROST&BiFi공식홈페이지BiFi에서Lending하세요!BiFi가 처음이신가요?BiFi 가이드를 확인하세요BFC & BiFi 토큰 정보BIFROST & BiFi와 함께 해주세요!공식 SNS :BIFROST CITY 디스코드Twitter (BIFROST)|Twitter (BiFi)|Facebook|YouTube|Reddit|Weibo"
  },
  {
    "title": "Post-mortem: BiFi-BTC illegal address registration",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/post-mortem-bifi-btc-illegal-address-registration-c21ce3ba9fc8",
    "content": "Post-mortem: BiFi-BTC illegal address registrationBifrost·Follow3 min read·Jul 10, 2022--ListenShareOverviewIn developing all our services, we have always prioritized and valued the trust of our community members. Thus, we are deeply sorry to share the news about the unfortunate incident relating to the attack on BiFi.It has come to our attention that there was an attack on the BTC address registration server of our BiFi service. The BiFi Team has successfully removed all systems that were used for the attack. In order to safeguard BiFi from potential attacks, we have temporarily suspended the native Bitcoin lending service on BiFi. The service will gradually resume once we verify that all components are secure. The BIFROST Foundation will compensate for all losses caused by the recent incident and ensure that there are no further issues. All BiFi services, except for BTC lending, are operating without any issues.Based on our analysis, the attack was limited to the BTC address registration server, and no vulnerabilities have been detected in both the smart contracts and the BiFi protocol. The BiFi Team has currently removed all sensitive data that might be breached. Thus, the security audit by Theori on the BiFi components is still valid. No user records have been illegally modified and all assets are being securely monitored. Please rest assured that we are currently working with leading security firms to analyze problems, seek better solutions and ultimately prevent potential threats to our protocol.Event AnalysisBiFi issues and uses an address for each user who deposits BTC. The deposit addresses are signed and delivered to the address issuing server and the addresses are reflected on BiFi only in the case when the signature is verified. In the attack, the server key of the address issuing server was exposed and the attacker was able to self-sign their own deposit address. Since the attacker could generate a valid signature on the deposit address, BiFi mistakenly recognized the attacker’s BTC transfer as a BTC deposit into BiFi. As a result, the attacker was able to borrow 1,852 ETH with fake deposit.Attacker Informationeth-address:0x282971deD7D0B8C5b0358EbEbe3B2bC6A24a6b10btc-address:address:bc1qmgh7w47myz7kt7x34zqlr5azck7u8j8ewg3u2jpubkey hash:0xDa2fe757Db20Bd65F8D1a881F1D3a2C5BdC3c8F9Timeline2022. 07. 08 11:13 AM UTC: Attacker registered the deposit address into the BiFi BTC contract. (using the stolen key in the manipulated message)Transactionhttps://etherscan.io/tx/0x1a507140573d10fed06a9052a58b46621a1fbfad2d4a54fd0f5db40e1788a29d2. 2022. 07. 08 11:03 AM UTC: Attacker deposited 312 BTC to the manipulated BTC address. (this process occurred almost simultaneously with the previous process as there can be errors with the block timestamp of Bitcoin)Transactionhttps://www.blockchain.com/btc/tx/dd0bf6ab976f2090dd48cf6223a50e3c6c8a616e5c28dfc9448f81f1b7e993463. 2022. 07. 0.8 11:34 AM UTC: Relayer detected the deposit and delivered the verified deposit history to BiFi.Transactionhttps://etherscan.io/tx/0x5c0460f529a003d11911f21f8a8decb15aeaf07e9682a0d6e15aeb1cd5c39e694. 2022. 07. 08 12:17 PM UTC: Relayer confirmation (BiBTC, a token representing BTC collateral, was minted and delivered to the attacker)Transactionhttps://etherscan.io/tx/0x2e4422dd80350bd57cca6707a69473da20282c6b318c48a642e690e691a0c15f5. 2022. 07. 08 1:35 PM UTC: Attacker borrowed 1,852 ETHTransactionhttps://etherscan.io/tx/0x4b5d66871af64da0fd5ac448474235079ae0cb93db70366eed2808ca56dfcf76ETH borrowing occurred after 340 Ethereum blocks on BTC depositMeasures TakenWe have deleted all information related to the exposed key and newly set the key. We have set restrictions to prevent any identical or similar attacks from the same attacker. Additionally, our team is currently analyzing the details of the incident and migrating to a new environment to prevent the attack from reoccurring. The BIFROST Foundation will cover all losses caused by this recent attack and will ensure that there are no further inconveniences in using our services.We are working with other authorities and services to track down the attacker and gather the attacker’s information. We will not take legal action if the attacker returns 90% of the stolen funds. We will work closely with the authorities until the attacker returns the funds."
  },
  {
    "title": "Post-mortem: BiFi-BTC illegal address registration",
    "author": "Bifrost",
    "url": "https://bifrost.medium.com/post-mortem-bifi-btc-illegal-address-registration-88ef44df1a86",
    "content": "Post-mortem: BiFi-BTC illegal address registrationBifrost·Follow5 min read·Jul 10, 2022--Share요약BiFi의 BTC 주소 등록 서버에 대한 보안 공격으로 인하여 정당하지 않게 자금이 유출되는 사고가 있었습니다. 무엇보다 본 사고에 놀라시고 실망하신 커뮤니티의 여러분께 사과드립니다. 현재 공격에 노출된 부분들을 제거하고, 현재 BiFi 서비스는 다시 안전하게 운영되고 있으며, 혹시 있을지 모르는 추가 위협에 대비하고자 BTC 관련 기능들을 잠시 정지하였으며 안전성이 검증되는 대로 단계별로 서비스를 재개할 예정입니다. 본 사건에 의해서 발생한 손실은 100 % 전액 BIFROST 재단에서 바로 보충하여 서비스 사용에 어떠한 불편도 없도록 하겠습니다.지금까지 파악된 정보에 의하면, 공격은 BiFi 스마트 컨트랙트와 프로토콜의 취약점을 이용한 것이 아니라, 공격자가 BTC 주소 등록 서버에 침투하여 서버의 키 정보를 탈취한 서버 보안문제에 국한되어 있습니다. 따라서 Theori의 보안 검수를 받은 BiFi 서비스 자체에 대한 안전성은 아직도 유효하며, 여러분의 자산도 지속적인 모니터링을 통해서 안전하게 운영되고 있습니다. 노출된 key와 관련된 핵심 보안 정보는 안전하게 갱신하였습니다. 서버 운영의 보안 사고에 대해서도 유수 보안업체와 긴밀한 협력을 통하여 문제점을 분석하고 더 나은 해결책을 모색하고 있습니다. 다만, BTC에 관련된 기능은 완전한 보안 점검을 마칠 때까지 단계적으로 오픈할 예정입니다.상세 경위 및 공격 TimelineBiFi에서는 BTC를 예금하는 사용자별로 별도의 입금 주소를 발급하여 사용하고 있습니다. 해당 입금 주소는 발급 서버의 서버키로 서명되어 전달되고, 서명이 검증된 경우에만 BiFi에 반영됩니다. 이번 보안 사고는 공격자의 침투로 주소 발급 서버의 서버키가 노출되어, 공격자가 자신의 입금 주소를 변조한 메시지를 직접 서명할 수 있게 되면서 발생하였습니다. BiFi는 잘못된 주소로 설정된 것을 인지하지 못하고, 입금된 내역을 시스템에 반영하였습니다. 공격자는 가짜 입금액을 담보로 1,852 ETH를 대출하였습니다.공격자 정보eth-address:0x282971deD7D0B8C5b0358EbEbe3B2bC6A24a6b10btc-address:address:bc1qmgh7w47myz7kt7x34zqlr5azck7u8j8ewg3u2jpubkey hash:0xDa2fe757Db20Bd65F8D1a881F1D3a2C5BdC3c8F9Timeline2022. 07. 08. 20:13 KST— BiFi BTC contract에 공격자 입금 주소 주입 (탈취한 키를 이용하여 서명이 조작된 메시지 이용)https://etherscan.io/tx/0x1a507140573d10fed06a9052a58b46621a1fbfad2d4a54fd0f5db40e1788a29d2.2022. 07. 08. 20:03 KST— 공격자가 조작된 입금 주소로 321 BTC 입금. (1번 과정과 거의 동시 진행. Bitcoin의 특성상 timestamp의 오차가 있음.)https://www.blockchain.com/btc/tx/dd0bf6ab976f2090dd48cf6223a50e3c6c8a616e5c28dfc9448f81f1b7e993463. 2022. 07. 08. 20:34 KST — Relayer가 입금을 감지하고, 입금 검증 내역을 BiFi에 전달.https://etherscan.io/tx/0x5c0460f529a003d11911f21f8a8decb15aeaf07e9682a0d6e15aeb1cd5c39e694. 2022. 07. 08. 21:17 KST — Relayer의 confirm (BTC 담보 정보를 표현하는 BiBTC 토큰 민트 후 공격자에게 전달)https://etherscan.io/tx/0x2e4422dd80350bd57cca6707a69473da20282c6b318c48a642e690e691a0c15f5. 2022. 07. 08. 22:35:01 KST — 공격자의 1,852 ETH 대출https://etherscan.io/tx/0x4b5d66871af64da0fd5ac448474235079ae0cb93db70366eed2808ca56dfcf76BTC deposit에서 이더리움 340 blocks이 경과된 이후에 대출이 실행대응 방안노출된 키와 관련된 정보는 모두 삭제하고 새로 설정하였으며, 현재 동일한 공격 및 공격자의 추가 피해가 일어나지 않도록 제한을 걸어두었습니다. 보안 정보의 노출이 의심되는 BiFi의 BTC 관련 서비스는 현재 작동하지 않으며 단계별로 재개될 예정입니다. 자세한 사건 경위에 대하여 더 분석하며, 사건이 재발되지 않도록 새로운 환경으로 시스템 이전을 진행하고 있습니다. 본 사건에 의해서 발생한 손실은 100 % 전액 BIFROST 재단에서 바로 보충하여 서비스 사용에 어떠한 불편도 없도록 하겠습니다.공격자가 조속히 90%의 자금을 반환하면 법적 조치를 취하지 않겠습니다. 하지만 자금이 안전하게 반환되기 전까지는 수사기관과 긴밀하게 협력하여 공격자를 지속적으로 추적하는 노력을 계속하도록 하겠습니다. 현재 외부 서비스 업체들에 기록 공유 요청을 통해 추적을 위한 모든 수집하고 있습니다."
  },
  {
    "title": "BFC & BiFi 바이낸스 커스터디 공식 지원",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost-blog-kor/bfc-bifi-%EB%B0%94%EC%9D%B4%EB%82%B8%EC%8A%A4-%EC%BB%A4%EC%8A%A4%ED%84%B0%EB%94%94-%EA%B3%B5%EC%8B%9D-%EC%A7%80%EC%9B%90-36aa3ba543a4",
    "content": "BFC & BiFi 바이낸스 커스터디 공식 지원Bifrost·FollowPublished in바이프로스트·2 min read·Nov 7, 2022--Share안녕하세요 바이프로스트 팀입니다.바이낸스 커스터디(Binance Custody)에서 BFC와 BiFi 토큰을 지원한다는 소식 전해드립니다. 이에 따라 기관 및 개인 홀더분들은 앞으로 바이낸스 커스터디의 콜드월렛(cold wallet)에 BFC와 BiFi 토큰을 안전하게 보관할 수 있습니다.바이낸스 커스터디의 BFC와 BiFi 지원을 기념하고자바이프로스트와바이파이는 BFC 에코시스템 물량과 BiFi 트레저리(treasury) 물량을 바이낸스 커스터디에 안전하게 보관할 예정입니다. 토큰 보관으로 인해 BFC와 BiFi의 총 수량에는 변동이 없지만, 물량 전송에 따라 유통량이 일시적으로 증가할 수 있습니다. 이 경우 바이프로스트와 바이파이 팀은 CoinMarektCap과 CoinGecko를 비롯한 사이트에 토큰 유통량에 관한 정확한 정보를 빠르게 반영하겠습니다.BFC 에코시스템 물량: 349,728,435.4 BFCBiFi 트레저리 물량: 60,000,000 BiFi바이프로스트트윗바이낸스 커스터디트윗바이프로스트 네트워크에 관하여바이프로스트 네트워크는 서브스트레이트(Substrate) 기술을 활용하여 진정한 멀티체인 서비스를 구현하고자 하는 새로운 EVM 호환 블록체인입니다.바이프로스트 네트워크의 네이티브 토큰은 BFC이며, 체인간 메시지를 전달하고 각 체인의 토큰을 바로 사용할 수 있는 브릿징 기능 및 디파이(DeFi) 서비스를 빌트인(built-in)으로 지원합니다. 바이프로스트 네트워크 벨리데이터는 바이프로스트 네트워크의 핵심 참여자로서, 멀티체인 네트워크를 모니터링하고 체인 간의 연결을 돕는 검증자 역할을 합니다.바이낸스 커스터디에 관하여바이낸스 커스터디는 기관 고객을 대상으로 자산의 안전한 보관 및 관리를 위한 신탁 서비스를 제공합니다. 바이낸스 커스터디의 핵심 보안 기술은 세계 관리 품질 표준인 ISO 27001, 27701 인증을 받았으며, MPC(Multi-party Computation) 기술과 다중 승인 체계를 통해 안전하고 효율적인 서비스를 제공하고 있습니다."
  },
  {
    "title": "BFC & BiFi Now Supported on Binance Custody",
    "author": "Bifrost",
    "url": "https://medium.com/bifrost/bfc-bifi-now-supported-on-binance-custody-1ce8091efb52",
    "content": "BFC & BiFi Now Supported on Binance CustodyBifrost·FollowPublished inBifrost·2 min read·Nov 7, 2022--ListenShareDear BIFROST and BiFi community members,We are thrilled to announce thatBIFROST’s native token BFC and BiFi’s native token BiFi will be supported onBinance Custody, a world-class institutional-level custody solution. Henceforth, institutional users and individual holders will be able to securely store BFC and BiFi in Binance Custody’s cold wallet.To commemorate Binance Custody’s support of BFC and BiFi, our team will securely store tokens from our BFC Ecosystem and BiFi Treasury in Binance Custody. Although this will not affect the lockup period or the total amount of BFC and BiFi tokens, there can be a temporary increase in the circulation supply as tokens are transferred to Binance Custody. Our team will make sure to correct any discrepancies in the information provided on CoinMarketCap and Coingecko.BFC Ecosystem Amount: 349,728,435.4 BFCBiFi Treasury Amount: 60,000,000 BiFiBIFROST’s TweetBinance Custody’s TweetAbout the BIFROST NetworkThe BIFROST Network is a layer-one blockchain based on a Substrate development framework that enables cross-chain communication. It is a generalized, externally-verified message passing network that aims to connect otherwise separated networks. BFC is the native token that is used for fees in the network and on-chain governance.Read more about the BIFROST Network.About Binance CustodyBinance Custody is a compliant, insured, standalone digital asset custody service providing world-class security and liquidity solutions to institutional clients. It uses multi-party computation (MPC) technology with a customizable multi-approval scheme offering bespoke solutions that allow institutions to manage their crypto assets safely and efficiently. Its core technology solution is ISO 27001, 27701, and SOC 2 Type 1 certified."
  },
  {
    "title": "BTCFi : 차세대 BTC 스테이킹 서비스",
    "author": "Somersault",
    "url": "https://medium.com/@tribe.park/btcfi-next-generation-of-btc-staking-service-dc3f18392566",
    "content": "BTCFi : 차세대 BTC 스테이킹 서비스Somersault·Follow8 min read·Jan 7, 2024--Share2024년 1월 5일 4시경 바이프로스트가 개발중인 BTCFi의 윤곽이 나왔습니다.시장의 반응은 시큰둥 하였지만, 제가 생각했을때에는 차세대 탈중앙화 금융이 시작되는 첫 단계가 아닐까 생각됩니다.BTCFi가 어떤 구조로 동작하는지 살펴보겠습니다.위 그림을 이해하기에 앞서, 현재에도 많은 프로젝트들이 사용하는 크로스체인 환경을 실행시키기 위한 브릿지 시스템을 먼저 알아보겠습니다.현재의 크로스체인 브릿지 시스템현재의 브릿지 시스템은 특정 웹페이지를 통하여 From 체인, To체인을 선택하고 컨트랙에 서명하여 자산을 보내면, 백엔드에서 모든 처리가 이루어 집니다.이렇다 보니 백엔드가 공격당할 경우, 자산의 탈취가 쉽게 일어날 수 있습니다. 현재까지 멀티체인, 로닌, 노마드, 웜홀 등의 많은 브릿지가 해킹당했고, 백엔드의 호스트 공급자인 Cloudflare를 공격하여 자산을 탈취한 BadgerDAO의 사례도 찾아볼 수 있습니다.최근에는 오르빗 브릿지가 해킹당하여 1000억원의 피해가 생기기도 하였습니다.이처럼 현재 백엔드 기반의 브릿지 시스템은 공격당할 경로가 많고 불안정 합니다.반면, 바이프로스트가 개발한 크로스체인 통신 프로토콜은 다음과 같습니다.Bifrost CCCP각 체인에 소켓 컨트랙을 구현하여, Mainnet Validator에게 검증을 한 뒤, 자산을 이동하는 방식을 사용하였습니다.Bifrost Network에 입금될때의 순서는 다음과 같습니다.유저가 각 체인에 배포되어있는 스마트계약과 상호작용을 하게 됩니다.컨트랙 주소는 각각 다음과 같습니다.Ethereum :0x2F95C102Cc26875406BC689Fb01aE382B82AA535BNB :0x78ae4c0FD4f02CA79A2d8738d3369A4Bc5D4E323Polygin :0x5fA7fe5F94f2D15585a3134C1C5d3019c8c1645dBase :0x4F7aB59b5AC112970F5dD66D8a7ac505c8E5e08BArbitrum :0xf549E4B5B4Cb7fd4e83b8AA047C742C06D527429컨트랙은 Bifrost의 Validator들에게 유효한 요청인지 확인합니다.복잡한 검증 프로세스를 거친 후, Bifrost Network로 입금이 됩니다.Bifrost Network에 자산을 입출금시에는 항상 Validator들에게 검증이 된 후에 작업이 이루어지기 때문에, 현재까지도 많은 프로젝트들이 사용하는 단순 백엔드 시스템인 브릿지보다 훨씬 강력한 보안을 완성할 수 있습니다.바이프로스트의 크로스체인 통신 프로토콜에 대한 기술문서는링크에서 확인하실 수 있습니다.금융시스템의 가장 기본이 되는 ‘보안’을 탈중앙화적으로 안전하게 구현해냈으니, 이제 ‘디지털 금’ 이라고 불리는 비트코인을 탑재하려는듯 보입니다.비트코인 네트워크에서는 스마트 컨트랙의 구현이 불가능하기 때문에, 어떠한 방식으로 아이디어를 구현할지 아직 알 수는 없으나, 예전 Bifi에서 Native BTC Lending을 구현해냈던 팀인 만큼 기대가 되는 부분이기도 합니다.이제 본격적으로 BTCFi가 어떻게 동작하는지 알아보겠습니다.사용자는 BTC를 입금하고, MainNet Validator 검증과정을 통해 BTCUSD(가칭) 스테이블 코인을 발행합니다.발행된 스테이블 코인으로 Bifrost Network 내의 Defi Infra System에 유동성 공급을 통해 이자수익을 받아갈 수 있습니다.기존에 지갑속에서 잠만 자고있던 비트코인을 활용하여 이자수익을 낼 수 있다는 점에서, 정말 메리트가 있는 서비스가 아닐까 생각됩니다.기존에도 비트코인을 맡아주고 이자를 지급하던 업체들이 존재하긴 하였지만, 중앙화된 시스템의 한계를 극복하지 못하고 대부분의 업체들이 파산하고 지급불능의 상태에 빠진곳들이 많습니다.따라서 현재 크립토 커뮤니티에서는 중앙화된 시스템에 대한 불신이 가득한 상황입니다. 이 틈을 잘 파고들어, 바이프로스트의 BTCFi는 차세대 탈중앙화금융 서비스로의 도약을 준비하려는듯 보입니다.BTCFi 프로젝트는 3단계로 구성이 됩니다.1단계) BTC Defi Ecosystem 시작전반적인 Ecosystem 런칭 및 활성화를 시작합니다.지원 자산: WBTC(ETH,POL,ARB), BTCB(BSC)또한, CrossChain Swap 고도화를 동시에 진행합니다.현재 Bifrost Cross-Chain Swap 서비스에서는 2단계로 동작합니다.바이프로스트 네트워크의 BFC 코인을, 이더리움 네트워크의 USDT로 바꾸는 단계에서 2번의 트랜잭션이 발생합니다.Bifrost 네트워크 내에서의 자산 Swap트랜잭션Ethreum 네트워크로 브릿지 트랜잭션이를 1번의 트랜잭션으로 줄여, 사용성을 극대화하는 작업을 동시에 진행한다고 하니, 이 또한 기대가 되는 부분입니다.목표일정 : 1 분기2단계) BTC Staking 서비스 런칭예치한 BTC의 담보율에 따라, 발행된 스테이블 코인을 자동으로 풀에 예치해주고, BTC 가격의 상승 및 하락에 따라 절묘하게 상환/대출을 하여 청산위험 없이 최대의 이자수익을 볼 수 있게 만드는 금융 서비스로 보입니다.아마도 비트코인을 가지고있는 사람들이 복잡한 크립토 용어들과 내부적으로 어떠한 로직에 의해 이자가 발생하는지 공부할 필요없이, 자동적으로 안정적인 이자수익을 제공해주기 위한 사용자 경험의 극대화 목적으로 보입니다.Yield Farming 자동화— BTC 가격 하락시: 유동성 풀에 있는 스테이블코인을 자동 상환하여, 청산리스크 제거— BTC 가격 상승시: 담보비율내 추가 대출로 이자수익 극대화목표일정 : 1 분기3단계) Native BTC 자산추가— 최종적으로 Native BTC를 추가합니다.목표일정 : 3분기 말리뷰를 끝마치며..!그동안 국내의 많은 프로젝트를 살펴보았지만, 제가 바이프로스트에 푹 빠지게 된 이유는 거대한 멀티체인 프로젝트의 컨셉과 금융공학 박사님들로 구성된 인력들, 자체적으로 제작한 디파이, 플래시론과 메인넷, 심지어 새로운 언어까지 만들어가며 문제를 해결해나가는 기술력을 보고 블록체인에 대한 진심이 느껴졌기 때문입니다.비트코인 ETF의 사례만 보아도 알수있듯이, 거대 기관과 자본들이 블록체인 시장에 진입하기 시작했고, 금융/미술/의료 등 기존의 산업 분야들이 블록체인으로 넘어오는 분기점에 서있는 중요한 시기를 지나고 있습니다.바이프로스트는 금융을 구현해내기 위해서 태어난 기술이라는것을 증명하기위해 KICA, Code와 협업하여 KYC/AML 쪽을 선점하려는 움직임도 보이고 있습니다.(링크)또한, 극한의 사용자 경험을 Web3에 적용하려고, Swap 프로세스 중 클릭 한번을 줄이는 UX를 위해 새로운 구조까지 설계하며 나아가는 모습에 프로젝트가 추구하는 방향성이 명확하다는 느낌을 다시한번 받았습니다.BTCFi 프로젝트를 통해 차세대 탈중앙화 금융으로의 도약을 기원하며, 빠르게 변화하는, 그리고 해결해야할 문제가 정말 많은 블록체인 시장에서 고군분투 하고있는 블록체인 산업 종사자 여러분들에게 힘찬 응원의 박수를 보냅니다.참고자료Korbit Research : 브릿지 해킹의 지난 1년https://cdn.korbit.co.kr/athena/etc/research/35/korbit_research_2022-09-19.pdf"
  },
  {
    "title": "BTCFi : Next Generation of BTC Staking Service",
    "author": "Somersault",
    "url": "https://medium.com/@tribe.park/btcfi-next-generation-of-btc-staking-service-1bb32a5e994e",
    "content": "BTCFi : Next Generation of BTC Staking ServiceSomersault·Follow5 min read·Jan 28, 2024--ListenShareOn January 5, 2024 4:00the outline of BTCFi which is being developed by Bifrost was revealed.Let’s take a look at what Bifrost’s BTCFi is and how it works.To understand the picture above, let’s first look at the bridge system for running a cross-chain environment that many projects still use today.Backend Bridge SystemIn the current bridge system, you select the From and To chains through a specific webpage, sign the contract and send the assets, and all the processing is done on the backend.This means that if the backend is attacked, the assets can be easily stolen. To date, many bridges have been hacked, including Multichain, Ronin, Nomad, and Wormhole, as well as BadgerDAO, which attacked Cloudflare, the backend’s hosting provider, and stole assets.More recently, the Orbit Bridge was hacked, resulting in an $86 million loss.As you can see, the current backend-based bridging system is insecure with many paths to attack.On the other hand, the cross-chain communication protocol developed by Bifrost is as follows.Bifrost CCCPWe implemented a socket contract on each chain, validated it with a mainnet validator, and then implemented a way to move the assets.The sequence of deposits on the Bifrost network is as followsUsers interact with the smart contracts deployed on each chain.The contract addresses are respectively as followsEthereum :0x2F95C102Cc26875406BC689Fb01aE382B82AA535BNB :0x78ae4c0FD4f02CA79A2d8738d3369A4Bc5D4E323Polygin :0x5fA7fe5F94f2D15585a3134C1C5d3019c8c1645dBase :0x4F7aB59b5AC112970F5dD66D8a7ac505c8E5e08BArbitrum :0xf549E4B5B4Cb7fd4e83b8AA047C742C06D527429The contract checks with Bifrost’s validators to see if the request is valid.After a complex validation process, the funds are deposited into the Bifrost network.Since the transfer of assets to and from the Bifrost Network is always validated by validators, the security is much more robust than the simple backend system that many projects still use today: bridges.The technical documentation for Bifrost’s cross-chain communication protocol can be found at the following(link)Now that they’ve decentralized the most basic “security” of the financial system, they seem to be looking to add bitcoin, which they call “digital gold,” on top of it.How they’ll implement this idea remains to be seen, as smart contracts aren’t possible on the Bitcoin network, but the team has previously built native BTC lending on Biffy, so I’m personally excited.Now let’s get down to business and see how BTCFi works.Users deposit BTC and issue BTCUSD (tentative) stablecoins through the MainNet Validator validation process.The issued stable coin can be used to provide liquidity to the Defi Infra System within the Bifrost Network and receive interest income.I think it’s a good service with a lot of potential growth, as it allows you to utilize bitcoin that’s been sleeping in your wallet and earn interest on it.While there have been companies that used to store Bitcoin and pay interest, many of them have gone bankrupt and become insolvent due to the limitations of a centralized system.As such, there’s a lot of distrust of centralized systems in the crypto community right now, and Bifrost’s BTCFi seems to be tapping into this niche and preparing to make the leap to the next generation of decentralized financial services.The BTCFi project consists of three phases.Phase 1) Launch the BTC Defi EcosystemStart the overall ecosystem launch and activation.Supported assets: WBTC (ETH), BTCB (BSC)In addition, cross-chain swaps will be upgraded at the same time.Currently, the Bifrost cross-chain swap service is not a back-end system, so it takes two transactions to exchange BFC coins, the base currency of the Bifrost network, for USDT on the Ethereum network.Asset Swap Transactions on the Bifrost NetworkBridge transactions to the Ethreum networkI’m excited to hear that we’ll be working on reducing this to a single transaction and maximizing usability at the same time.Target timeline: Q1Phase 2) Launch of BTC Staking ServiceIt seems to be a financial service that automatically deposits the issued stablecoins into a pool according to the collateralization rate of the deposited BTC, and redeems/loans them in an exquisite manner according to the rise and fall of the BTC price, so that you can see maximum interest income without liquidation risk.Presumably, the purpose is to maximize the user experience by automatically providing stable interest income without the need for people with Bitcoin to study complex crypto terms and the logic behind how interest is generated internally.Automated Yield Farming- When BTC price drops: Automatically redeem stablecoins in the liquidity pool, eliminating liquidation risk.- When BTC price rises: Maximize interest income by lending more within the collateral ratioTarget date: Q1Phase 3) Support Native BTC— Finally, add Native BTC.Target date: Q3Finally..I looked at many projects in Korea, but were drawn to Bifrost because of the concept of a huge multi-chain project, a team of PhDs in financial engineering, and the ability to solve problems by building their own DeFi, flashrons, mainnet, and even a new language.We are at a critical juncture where large institutions and capital are starting to enter the blockchain market, as evidenced by the Bitcoin ETF, and traditional industries like finance, art, and healthcare are entering the blockchain.To prove that this is a technology built for finance, Bifrost is leading the way in KYC/AML (link) in partnership with the KICA and CODE.They are also striving to bring extreme user experience to Web 3.0 by designing a new structured UX that reduces the number of clicks in the swap process, and I think the direction of the project is clear.I wish the BTCFi project the best of luck as they take the leap into the next generation of decentralized finance, and I applaud all those who are struggling in the blockchain industry, where there are many problems to solve in a rapidly changing market."
  },
  {
    "title": "Bifrost Ecosystem Review",
    "author": "Somersault",
    "url": "https://medium.com/@tribe.park/bifrost-ecosystem-review-c398fabd7da7",
    "content": "Bifrost Ecosystem ReviewSomersault·Follow8 min read·Nov 30, 2022--ListenShareWhat is Bifrost?The biggest topics when Bifrost was founded in 2017 were Ethereum’s trilemma problem. By linking these two satisfying chains, Bifrost presents a solution to solve these trilemma problems. Biforst is a multi-chain platform created to solve the trillema problem.Bifrost EcosystemIt’s the entire ecosystem of the Bifrost. Let’s have a time to bite, rip, and taste one by one.BifiThe use case of the blockchain is about something, and Defi begins to grow overwhelmingly in the second half of 20 years.Since Bifrost is a middleware solution, users see very little on the surface, so they begin the journey to prove multi-chain middleware with a powerful use case, DeFi.They quickly catch up on Defi’s growth, developing a Dapp called Bifi for 20 years and launching it in January 2021.And then, they start to connect the BSC, Native Bitcoin, Avalanche and Klaytn network to show off the power that been hiding.Among them, I think the biggest advantage of Bifi, which is different from other DeFi, is Bitcoin landing. Bifrost launched the Native Bitcoin Lending service on August 18, 2021.It attempts to grow the pie in the Defi market by making it possible to use Native Bitcoin that is not wrapped in the Ethereum network. (Link)At that time, Thor-chain also supported Bitcoin, but in the case of Thor-chain, since the RUNE token is the AMM method in which each of the RUNE tokens is relayed, the bigger the transaction price, the bigger the slippage.It is not structurally bad, but it is practically difficult to use in terms of “financial services” due to its definitive slippage.Bifrost is trying to come up with a solution to solve this Thor-chain problem for the broad expansion of Native Bitcoin, so you can look forward to it.In fact, the reason why Bifi, like this graceful swan, was able to be born is because of the powerful kick of the Bifrost, which is constantly moving under the lake.Many De-fi projects copy compound and Uniswap and released them with a different design. Bifrost team said it was a pity that they missed the booming market because it took a lot of time to develop themselves. However, thanks to this, the experience and know-how have been accumulated, which is very helpful for the development of the project.Bifi-XBifi-x is a flash-loan based leverage financial service.You may be confused by the sudden emergence of the wordflash loan, but I can briefly explain that flash loan is a type of loan only available in blockchain-based DeFi that can borrow funds without collateral. There is an article that introduces a detailed description of the flash loan, so I attached the link below, so it will be very helpful if you read it.(Link)As there are many articles about attacks using flash-loan, it’s a very difficult and dangerous advanced technology.Bifrost team attempt to create itsown Flash loan serviceand target the Flash loan market, which AAVE monopolized, at a lower fee.The following services are available on BIFIX:EarnEarn function is a service used to get the maximum Bifi token that you can get with Defi. Automate deposits and loans with a single click, and get Bifi through up to 4x leverage.BetThe Bet function is a function that allows trading with up to 4x leverage by establishing Long and Short leverage positions.The biggest advantage of Bifi Bet is that it can maintain its position for a long time without funding fees.Let’s take a quick look at the concept of funding feeA typical future has an expiration date.There is something called “Basis” because of the price difference between the spot and the futures until the expiration date.Contango : A phenomenon in which the futures price is higher than the spot price, or the futures price increases as the payment date increasesBackwardation: The opposite meaning of Contango, where the futures price is lower than the spot priceAs the maturity date approaches, this Basis is usually zeroed.However, there is no mechanism to control this basis in the indefinite futures mainly used in coins. So the idea that was introduced is the idea of funding fee.Futures and margins without expiration dates use a system that reduces the difference between spot and futures by charging the concept of funding fee every set time.If the Futures is more expensive than in spot, it is a purchase advantage, and the amount equivalent to the funding fee is provided from the buyer to the seller.This funding fee is not bad, but it is one of the reasons why it is difficult to make long-term investments in leverage futures. Therefore, using BIFIX’s Bet can reduce the burden of funding fee a lot.If you compare the fees of dYdX and BIFIX, you can clearly see the difference.Chain RunnerThe Chain Runner is a unit solution for troubleshooting accessibility issues for Bifrost.It’s one of the most impressive products I’ve ever seen in Bifrost, and it’s hard for users to interact with DApp, starting with a wallet connection, so I’ve solved it scenarioically to make complex Defi work on one screen.Even beginners without blockchain expertise can easily!This is a Bifrost who is creating an environment where everything in the blockchain can be accessed and utilized.Chainrunner directly approaches and works with Smart Contracts, which the Bifrost team spent more than a year pondering and creating a script language based on a flexible design. They say it’s extremely flexible enough to make a simple scenario in 30 minutesIn addition, we are also planning a model that allows users to create various scenarios and obtain fees, so if you are able to produce these scenarios, you can watch with interest.Do you know Toss or Kakao Bank in Korea?They have revolutionized the simplicity that is different from traditional banking apps.Just as innovation can come from simplicity, I personally think Chain Runner was a product that would bring about innovation in the blockchain world.Now an upgraded version, ChainRunner M, is available in the Biport mobile wallet, offering a single click in the wallet to use the Defi service such as swap and deposit.Biport WalletBiport Wallet is a cross-chain Web3 wallet developed by Bifrost.As you can see in the diagram, wallets in the bi-frost ecosystem serve as an entry point for all services.There are still many wallets such as meta-masks, but I think it was essential to develop the wallet on its own to apply the functions that suit their taste.The entry barrier to the Web3 wallet is very high.Just by looking at the comments of coin-related content, it is a reality that many people view coins as an object of speculation.From making wallets, knowing the concepts of private keys and seed phrases, to keeping them safe, and regulations such as the enhanced Centralization Exchange’s travel rules, registering and withdrawing wallets has become a really difficult barrier for users to enter the world of decentralization.However, Biport Wallet is attempting to break down these barriers to entry.With the familiar UI/UX, beginners are planning to freely cross the chain, regardless of network, and eventually, along with the Payment system, Biport Wallet will serve as a bridge for existing institutional finance to enter the blockchain.Final ThoughtsEnvironments where new protocols and platforms can be designed and presented are not often created. Because even if you look at other examples, once you’re stuck and established as a standard, it’s going to keep the throne solid for about 10 years or more. I applaud Bifrost’s journey to challenge the tough multi-chain platform, and like Bifrost’s confident slogan, I sincerely hope that the moment will come when Killer DApp appears and achieves Mass Adoption by giving freedom to DApps. We have reviewed the products of Bifrost that have been released so far.Thank you so much for reading this long article.Bifrost City by AI techReferencehttps://pilab.notion.site/BifiX-Bet-3e65e75b04e848b19698219b6f2c1fe4https://pilab.notion.site/2021-Product-2da0f2788450462db527789a6d3cfaf6https://www.youtube.com/watch?v=pmKPzNHdZq0&t=2813shttps://www.youtube.com/watch?v=aMNyBGTzq1Qhttps://www.youtube.com/watch?v=9geSgLAWzU4"
  },
  {
    "title": "Bifrost 란?",
    "author": "Somersault",
    "url": "https://medium.com/@tribe.park/review-bifrost-ecosystem-d4fa64dc1c51",
    "content": "Somersault·Follow11 min read·Nov 13, 2022--Share[Review] Bifrost EcosystemBifrost 란?역사를 주절주절 얘기하면 굉장히 글이 길어지므로, 간략하게 말하자면, 2017년 창업당시 가장 큰 화두는 이더리움의 보안, 확장성, 탈중앙화. 세 가지를 만족할 수 없다는 트릴레마(trilemma) 문제였고, 이를 해결하기 위해, 2가지씩 만족시킨 체인을 서로 연결해주면 되지 않을까? 라는 솔루션으로 탄생하게된멀티체인 플랫폼입니다.Bifrost Ecosystem바이프로스트의 전체적인 생태계입니다.하나하나 물고 뜯고 맛보는 시간을 가져보도록 하겠습니다.Bifi블록체인의 유스케이스(Use Case)는 무엇인가를 주제로, Defi vs Game의 구도가 펼쳐졌고, 20년 후반부터 Defi가 압도적으로 성장하기 시작합니다.바이프로스트는 미들웨어 솔루션이다 보니, 사용자들이 봤을때 표면위로 드러나는 부분이 매우 적은 수준이기에, 강력한 유스케이스인 디파이로 멀티체인 미들웨어를 증명하기 위한 여정을 시작합니다.Defi의 성장을 빠르게 캐치하여, 20년 한 해 동안 Bifi라는 Dapp을 개발하여 2021년 1월에 출시하게 됩니다.그 후로 BSC, 비트코인, 아발란체, 클레이튼을 연결하며, 숨겨왔던 힘을 과시하기 시작합니다.그 중, 다른 디파이들과 차별되는 Bifi의 가장 큰 장점은 비트코인 랜딩이지 않나 싶습니다. 바이프로스트는 21년 8월 18일, Native Bitcoin Lending 서비스를 출시합니다.이더리움 네트워크에서 래핑되지 않은 Native 비트코인을 사용할 수 있도록 만들어, Defi 시장의 파이를 키우려는 시도를 합니다.BTC Lending 공지 링크그 당시, 토르체인 또한 비트코인을 지원하였습니다만, 토르체인의 경우 RUNE 토큰이 각각 중계를 서는 AMM 방식이기 때문에, 거래 대금이 커질수록 슬리피지도 미친듯이 커지는 방식이었습니다.구조적으로 나쁜 방식이라곤 말할 수 없으나, 확정적 슬리피지로 인하여, ‘금융 서비스’의 측면에서는 실질적으로 사용하기 힘든 방식이라고 할 수 있습니다.바이프로스트에서는 Native 비트코인의 광범위한 확장을 위해서, 이러한 토르 체인의 문제를 해결하는 솔루션을 제시하려고 한다고 하니, 기대해보셔도 좋을것 같네요사실상 이렇게 우아한 백조와 같은, Bifi가 탄생할 수 있었던 배경은, 호수밑에서 부단히 움직이는 바이프로스트의 힘찬 발길질 덕분이라고 할 수 있습니다.여러 프로젝트들이 컴파운드와 유니스왑을 하드포크하여 껍데기만 바꿔 출시할때, 바이프로스트 팀은 자체적으로 개발을 하느라, 시간이 많이 걸려 시장의 호황기를 놓쳐 아쉬웠다고 하네요.. 하지만, 덕분에 경험과 노하우가 쌓여 프로젝트의 발전에 많은 도움이 되고 있다고 합니다.Bifi 에서 예금,대출, 풀링을 통해 얻을 수 있는 Bifi 토큰에 대해서도 할말은 산더미지만, 글이 길어지니..꿈과 희망이 가득한쓰레드를 따로 한번 작성해보도록 하겠습니다.Bifi — 𝒳Bifi X는 플래시론 기반의 레버리지 금융 서비스입니다.갑자기 플래시 론 이라는 단어가 튀어나와 혼란스러우실텐데요, 플래시 론이란 담보물이 없어도 자금을 빌릴 수 있는 블록체인 기반의 DeFi에서만 가능한 대출 유형이라고 간략하게 설명 드릴 수 있습니다. 플래시 론에 대한 자세한 설명이 소개된 글이 있어 아래 링크를 첨부해뒀으니, 읽어보시면 많은 도움이 되실거예요.플래시론 링크플래시론을 이용한 공격에 대한 기사들도 많이 나오는 만큼, 굉장히 다루기 힘들고 위험한 고급 기술이라고 할 수 있습니다.바이프로스트 팀에서는 이러한 플래시론 서비스를자체적으로 제작하여, AAVE가 독점하고 있던 플래시론 시장을, 더욱 낮은 수수료로 공략하려는 시도를 합니다.Bifi X 에서는 다음과 같은 서비스를 이용하실 수 있습니다.EarnEarn 의 경우에는, Defi를 사용하면 얻을 수 있는 Bifi 토큰을 최대로 얻기 위해 사용되는 서비스 입니다.단 한번의 클릭으로 예금,대출을 자동화하여, 최대 4배의 레버리지를 통해 Bifi를 얻는 방식입니다.BetBet 기능은 Long, Short 레버리지 포지션을 구축하여, 최대 4배의 레버리지로 트레이딩을 할 수 있는 기능입니다.Bifi Bet 가장 큰 장점은펀딩비 없이 포지션을 오랜기간 유지할 수 있다는 점입니다.펀딩비라는 개념을 간략하게 한번 알아볼까요?일반적인 선물(Future)은 만기일이 있습니다.만기일까지 현물과 선물의 가격차이로 Basis 라는것이 존재합니다.콘탱고(Contango) : 선물가격이 현물가격보다 높거나, 결제일이 멀어질수록 선물가격이 높아지는 현상백워데이션 (Backwardation) : 콘탱고의 반대의미로, 선물가격이 현물가격보다 낮은 현상만기일에 가까워짐에따라 이러한 Basis는 0이 되는 상황이 일반적입니다.하지만, 코인에서 주로 사용되는 무기한 선물(Perpetual Futures)에서는 이러한 basis를 조절해줄 수 있는 메커니즘이 없습니다. 따라서 도입된 개념이 펀딩비(Funding Fee) 라는 개념입니다.만기일이 없는 선물과 마진은, 펀딩비라는 개념을 정해진 시간마다 부과함으로써 현물과 선물의 차이를 줄여나가는 시스템을 사용하고 있습니다. 선물이 현물보다 비싸면 매수우위임으로, 펀딩비에 해당하는 금액을 매수측에서 매도측으로 제공합니다. 이러한 펀딩비가 나쁜것은 아니지만, 레버리지 선물 장기투자를 하기 힘든 이유중 하나입니다. 따라서, Bifi X의 Bet을 사용한다면 펀딩비에 대한 부담감을 많이 덜 수 있습니다.dYdX 와 Bifi X 의 수수료를 비교해보면 그 차이를 확연하게 알 수 있습니다.Chain Runner후후후… 녀석은 사천왕 중 가장 약하지..지금도 회자되고있는 전설의 사천왕중 두번째로 등장한 체인러너는바이프로스트의 접근성 문제 해결을 위한 유닛 솔루션입니다.제가 바이프로스트에 가장 감명을 받은 제품중 하나인데요, 디파이를 처음 접하는 사용자들은 지갑 연결부터 시작하여 디앱과 상호작용하는걸 어려워 하기에, 복잡한 디파이를 한 화면에서 동작하도록, 시나리오적으로 풀어내었습니다.전문지식이 없는 블록체인 초보자들도 쉽게 !블록체인의 모든 것을 접근하고 활용할 수 있는 환경을 만들고 있는 바이프로스트의 모습입니다.체인러너는 직접 스마트 컨트랙트에 접근하여 동작하는 방식으로, 이를 가능케 하는건, 바이프로스트 팀에서 1년이 넘는 시간동안 고민하여 유연한 설계를 바탕으로 스크립트언어를 만든 결과입니다. 간단한 시나리오는 30분이면 만들 정도의 극강의 유연성을 자랑한다고 하네요또한 여러가지 시나리오들을 유저들이 만들 수 있게하여, 수수료 등을 얻을 수 있는 모델또한 구상중이라고 하니, 이러한 시나리오 제작이 가능한 분들은, 관심있게 지켜보셔도 좋을듯 합니다.토스나 카카오뱅크는 기존 은행 앱들과는 차원이 다른 간편함으로 혁신을 일으켰습니다. 간편함에서도 혁신이 나올 수 있듯이, 블록체인계의 혁신을 불러일으킬 제품이었다고 개인적으로는 생각합니다.현재는 한단계 업그레이드 된 버전인 체인러너 M이, Biport 모바일 지갑에 탑재되어, 지갑 내에서 단 한번의 클릭으로 스왑, 예금 등의 디파이 서비스를 이용할 수 있습니다.바이프로스트 CMO, 소소님의 트윗이 실현되고 있는것 같아, 정말 놀랍네요Biport WalletBiport 월렛은, 바이프로스트에서 자체적으로 개발한 크로스체인 Web3 지갑입니다. 지갑에 대해서도 주절주절 쓰면 책 한권 분량이 나올 것 같아, 핵심만 짚어서 설명드리겠습니다.그림에서도 볼 수 있듯이, 바이프로스트 생태계에서의 지갑은, 모든 서비스들을 시작하는 진입점 역할을 합니다.현재에도 메타마스크 등과 같은 많은 지갑들이 존재하고 있지만, 자신들이 원하는 입맛에 맞춘 기능들을 적용하려면, 지갑을 자체적으로 개발하는것이 필수적이었다고 생각이 됩니다.Web3 지갑의 진입장벽은 매우 높은 편입니다.코인 관련 컨텐츠의 댓글만 봐도, 많은 사람들이 코인을 투기의 대상으로 바라보고 있는것이 현실이죠..지갑을 만드는것부터, 프라이빗키(private key)와 시드구문 등의 개념을 알고 안전하게 보관해야한다는 점과, 한층 강화된 중앙화 거래소의 트래블룰과 같은 규제로 인하여, 지갑을 등록하고 출금한다는것은 사용자들이 탈중앙화의 세계에 진입하기 정말 힘든 장벽이 되어버렸습니다.하지만, Biport 월렛은 이러한 진입장벽을 무너뜨리려는 시도를 하고있습니다.친숙한 UI/UX로 초보자분들도 쉽게, 네트워크의 구분 없이 체인을 자유롭게 넘나들며 디파이, 게임, NFT 구매 등을 접할 수 있게 계획하고 있으며, 최종적으로는 Payment 시스템과 더불어 Biport Wallet이 기존의 제도권 금융이 블록체인으로 들어오는 다리 역할을 하게되지 않을까 예상해봅니다.마치며..새로운 프로토콜과 플랫폼을 설계부터 만들어 제시해볼 수 있는 환경이 자주 만들어지진 않습니다. 다른 사례들을 보더라도, 한번 고착되어 표준으로 자리잡게 된다면 대략 10년이 넘는 시간동안 왕좌를 굳건히 지키기 때문이죠. 험난한 멀티체인 플랫폼에 도전하는 바이프로스트의 여정에 힘찬 박수를 보내며, 바이프로스트가 자신있게 내 건 슬로건처럼, DApp들에게 자유를 주어, 킬러댑이 등장해 Mass Adoption을 이루어내는 순간이 찾아오길 진심으로 바래봅니다. 이상으로 현재까지 출시된 바이프로스트의 제품들을 리뷰해보았습니다.긴 글 읽어주셔서 정말 감사드립니다.AI가 그린 Bifrost City참고 자료Bifi 무기한선물의 특징 (By Pilab)https://pilab.notion.site/BifiX-Bet-3e65e75b04e848b19698219b6f2c1fe42021년 Product 정리 (By Pilab)https://pilab.notion.site/2021-Product-2da0f2788450462db527789a6d3cfaf6어디에서도 듣지 못하는 블록체인과 Bifrost의 기술 이야기 (by Bifrost 이종협 CTO)https://www.youtube.com/watch?v=pmKPzNHdZq0&t=2813sNFT Busan 2021https://www.youtube.com/watch?v=aMNyBGTzq1Q지독히도 느린 블록체인 시장을 바꾸는 방법https://www.youtube.com/watch?v=9geSgLAWzU4"
  },
  {
    "title": "Bifrost 2021 Product 정리",
    "author": "none",
    "url": "https://pilab.notion.site/2021-Product-2da0f2788450462db527789a6d3cfaf6",
    "content": "# 2021년 Product 정리1. **Bifi**    - 상황 : 블록체인의 유스케이스는 무엇이냐를 두고 Defi vs Game의 논란은 2020년 후반부터 Defi가 압도적으로 치고나옴으로 인해서 1차전은 Defi의 완승으로 흘러갑니다.    - 시작 : 저희는 비교적 빨리 디파이 흐름을 캐치하고 2020년 한해 동안 Bifi를 준비하여 2021년 1월에 출시하게 됩니다.    - **의의** : 블록체인의 여전히 가장 강력한 유스케이스인 디파이로 멀티체인 미들웨어를 증명하기 위한 여정 시작.    - 아쉬웠던 부분 : 여러 프로젝트 팀이 유니스왑과 컴파운드를 그대로 하드포크해서 껍데기만 바꾸고 디파이로 출시할 때 저희는 자체 개발을 하느라 훨씬 오랜 시간이 걸렸습니다. 아쉬웠던 부분은 그 덕분에 시장의 호황기를 놓쳤다는 점입니다.    - 긍정적인 부분 : 자체 개발로 많은 고민을 스스로 했기에 무사고 운전 중이라는 점입니다.    2. **BifiX(feat. Bifi flashloan)**    - 상황 : 리워드 배분으로 풀을 끌어모았습니다. 기본적으로는 예금자와 대출자를 이어주는 렌딩 플랫폼이기에 그 자체로 비즈니스 모델은 성립하지만 비슷한 성격의 대출 플랫폼들과 비교하여 비교 우위를 가지기 위해서는 새로운 유스케이스들이 필요했습니다.    - 시작 : Bifi Pool을 이용한 레버리지 금융상품을 기획했는데 그 기초공사인 플래쉬론이 필요했습니다. 당시 2조 정도의 시장이 형성되어있었고 Aave가 주로 독점한 시장이었습니다. 그래서 bifi 보유시 보다 저렴한 수수료를 부과하기로 한 플래쉬론 서비스를 출시합니다.    - 의의 : 드디어 자체 플래쉬론을 바탕으로 bifi의 첫번째 유스케이스가 등장합니다. bifi이용자들이 가장 많이 이용하는 서비스인 Earn과 레버리지 베팅을 간편하게 할 수 있는 Bet이 출시되었습니다.    - 아쉬웠던 부분 : 당시 디파이가 이더 중심이었기에 저희도 이더에 무게 중심을 둔 운영을 하고 있었는데 이더 가스비 폭발로 BifiX의 가스비도 급증하게 되고 사용량이 둔화되었습니다.    - 긍정적인 부분 : 이후에도 BifiX와 유사한데 더 떨어지는 버전의 서비스들이 출시되고 있습니다. 접근 자체는 나쁘지 않았고 확장 가능성이 아직 남아있습니다. 금융은 결국 레버리지와 대출이 종착점이 될 수 밖에 없습니다.    3. **BTC Lending**    - 상황 : 상반기 Defi만 집중하다보니 여러체인에서 디파이를 하고 있다는 것 외에 멀티체인 미들웨어 바이프로스트의 존재감을 드러낼 필요가 있었습니다.    - 시작 : 저희는 보수적인 BTC 대량 보유자에게 디파이를 사용할 기회를 열어주는데 틈새 시장이 있을거라고 생각했고 그 툴을 제공해야겠다는 생각에 Native BTC를 담보로 다른 체인에서 대출을 받을 수 있는 상품을 출시합니다.    - 의의 : 다른 팀들과 다른 접근 방식으로 새로운 개념을 시도했습니다. 부유한 분들에게 가격은 비싸지만 보안이 좋은 서비스를 제공하였습니다. 이름만 멀티체인이 아닌 실질적으로 이종 체인간의 대출을 최초로 선보였습니다.    - 아쉬웠던 부분 : 마케팅의 선후 관계가 아쉬웠습니다. BTC고래들은 해외에 많고 해외 마케팅이 중요했는데 거래가 되지 않는 해외 지역의 마케팅이 쉽지 않다는 것을 깨달았습니다.    - 긍정적인 부분 : 치열하게 고민했던 기술과 노하우는 사라지지 않고 진화 될 수 있습니다.    4. **Biport**    - 상황 : 블록체인 시장의 분위기가 빠르게 변화함을 느꼈습니다. 코인 가격이 오르면서 블록체인이 좀 더 대중화 되었기 때문일까요? 보안적인 측면보다 사용성과 비용 절감이 강조되면서 Mass-adoption이 중요한 화두로 떠오릅니다.    - 시작 : 사실 지갑은 예전부터 원하던 제품이었습니다. 결국 온체인 상의 모든 서비스는 지갑이라는 UI를 통해 사용자에게 다가갈 것이기 때문입니다. 우리는 여러 체인들을 아우르면서 저희의 Product를 보여줄 수 있는 장치가 필요했습니다.    - 아쉬웠던 부분 : 모바일 버전을 동시에 출시했으면 훨씬 임팩트가 있었을 것 같습니다.    - 긍정적인 부분 : 끊임없는 개선으로 사용성이 점점 좋아지고 있습니다(버전을 보시면 계속 조용히 업데이트 되고 있습니다). 서비스들이 하나하나 붙는 것이 기대됩니다.    5. **ChainRunner Q**    - 상황 : 투자자와 사용자의 대거 신규 유입으로 간편함과 쉬움이라는 단어에 가치가 더해지는 시장임을 더욱 느꼈습니다. 디파이가 너무 어려워서 시작을 못하는 분들이 참 많았습니다.    - 시작 : 평소 요청 받던 사례들을 시작으로 간편하게 몇 번의 클릭으로 만들어내는 서비스를 만들었습니다.    - 아쉬웠던 부분 : 카운트다운으로 주목받는데는 성공했으나 후속 마케팅이 미흡했습니다.    - 긍정적인 부분 : 체인러너가 일반적인 디파이 자동화와 다른 점은 이것은 일년 가까이 고민하면서 만든 플랫폼이기에 시나리오를 만드는 것이 비교도 안되게 쉽다는 점입니다. 웬만한 자동화는 30분이면 개발 가능합니다. 이후 자체 서비스들이 체인러너를 많이 쓰게 될 것이고 외부 서비스와 협업시 손쉽게 저희가 제공할 수 있는 연결 수단이 되어줄 것입니다.    6. **이어지는 2022년의 계획**    - 2022년을 보시면 이미 짐작하셨겠지만 Keyword는 **Mass-adoption, 편리함, 간단함**이 될 것 같습니다.    - 가장 부가가치를 만들어낼 수 있는 일이 무엇인가?    - 새로 유입될 신규 블록체인 사용자들을 손쉽게 소프트랜딩할 수 있게 도와주는 툴이 있다면?    - 새로운 사용자들은 디파이나 게임 혹은 NFT를 하기 위해서 진입되지 않을까?    - 이 고민들을 종합하여 나온 것이 2022년의 로드맵이고 연말까지 힘차게 달려볼 예정입니다.    - 그럼 로드맵이 완성되면 바이프로스트가 차별화되는 점은        - 로드맵이 완성되면 기존의 전통산업이 블록체인으로 들어오는 진짜 편한 출입구가 생기는 것입니다. 블록체인은 잘 모르겠지만 어느 체인을 해야하나에 종속되고 구애받지 않으면서 블록체인 상에서 돈 되는 일들을 하고 싶은 많은 전통 산업군의 수요를 흡수할 수 있습니다.        - 저희가 현재 추구하는 바이프로스트 네트워크의 모습은 이름값 때문에 어디가야하나 고민하는게 아니라 비용과 합리성을 생각하면 다른 선택이 없는 초이스를 제공하는 것입니다(물론 간단한 건 아니고 몸과 마음이 갈릴 것으로 예상됩니다만 이미 작년에 해봤기에 또 할 수 있을거라고 생각합니다).        - 나아가 멀티체인의 글로벌 솔루션으로 자리매김해보려고 합니다. 타 프로젝트들 보면 매우 어렵고 불편합니다. 사용자 입장에서 접근하는 시도만으로도  혁신의 바람을 불러일으킬 수 있지 않을까 생각해봅니다. 드물게도 한 재단에서 플랫폼과 댑서비스를 동시에 운영하기에 가질 수 있는 시각인 것 같습니다.    - 이상 목표와 접근 방식에 대한 개념적인 차별화였고, 기술적인 차별화는 향후 서비스가 나오면서 하나씩 설명드리겠습니다. 읽어주셔서 감사합니다."
  },
  {
    "title": "무기한선물(마진)과 BifiX Bet",
    "author": "none",
    "url": "https://pilab.notion.site/BifiX-Bet-3e65e75b04e848b19698219b6f2c1fe4",
    "content": "**선물(Future)의 특징**- 일반 선물은 만기일이 있고 만기일까지 현물과 선물의 차이로 Basis라는 것이 존재합니다. 이건  시간의 가치기 때문에 양수면 콘탱고(Contango), 음수면(Backwardation)이라고 부릅니다. 콘탱고가 당연히 정상적인 상황이고 만기일에 가까워짐에 따라 0이되는 상황이 일반적입니다.- 기초자산의 추세가 만들어진 시점에서는 현물을 싸게 사는 것보다 조금 비싸게 선물에 대한 매도/매수 포지션을 취해도 레버리지를 쓰면서 추세를 타는 것이 효율적이기 때문에, 이론적 수치보다 훨씬 더 큰 콘탱고와 백워데이션이 종종 만들어지게 됩니다.- 예를 들어 추세가 확신이 된다는 가정하에 현물을 선물보다 0.5%정도 싸게 사서 5% 추세를 먹어서 5%의 수익률을 올리는 것보다 선물을 0.5%정도 비싸게사서 4.5%의 변동률에 레버리지 4~5배를 더해서 18~22.5%의 수익률을 올리는 것이 효과적인 투자가 될수 있기 때문입니다.**무기한 선물(Perpetual Futures)과 마진의 개념과 특징**- 개념 : 무기한 선물 혹은 영구선물은 만기일이 없는 금융상품으로 실질적으로 basis를 조절해줄 수 있는 메커니즘이 없습니다. 이를 해결하기 위해 Funding Fee라는 개념이 존재합니다.- Funding Fee 부과 방식 : 만기일이 없는 영구선물과 마진은 Funding Fee라는 개념을 정해진 시간마다 부과함으로써 현물과 선물의 차이를 줄여나가는 시스템을 택하고 있습니다. 선물이 현물보다 비싸면 매수가 많이 몰린 것이기 때문에 펀딩피에 해당하는 금액을 매수측에서 뺏고 매도측에 제공합니다. 반대로 선물이 현물보다 싸지면 매도가 많이 몰린 것이기 때문에 펀딩피를 매도측에서 뺏어서 매수측에 제공합니다.- 펀딩피 개념 자체가 나쁜 것은 아닙니다. 이게 없다면 무기한 선물은 현선물 자체의 차이를 줄일 매커니즘이 없기 때문입니다. 그리고 트레이더의 입자에서 보면 내가 펀딩피를 내고 있는 입장이라는 것은 포지션이 우위에 있는 상황이고 추세가 지속되고 있는 상황일 가능성이 높습니다. 한마디로 추세가 이루어졌을 땐 단기적으로 비용일 수도 있는 상황이죠.**무기한 선물의 비용(Funding Fee)**- Dydx 기준(21.10.17 기준)    - BTC : 1시간 0.0063%    - ETH : 1시간 0.0087%    - DOT : 1시간 0.0166%- 비용 환산        [제목 없음](https://www.notion.so/44d70e9ca5a34b9691600ad124ce33a6?pvs=21)        - 모든 표의 단위는 % 입니다.    - 기간내에 추세가 유지된다는 가정이고 변동되는 펀딩피를 고정으로 계산했기 때문에 정확하지 않은 계산이 될 수 있습니다. 하지만 기간이 길어질 수록 비용이 생각보다 만만치 않다는사실은 손쉽게 추론할 수 있습니다.**BifiX Bet의 비용**- 설정 비용 : USDC담보로 ETH숏 가정 비용.![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/7375766c-eaa8-4db6-a818-e67c71aae5ab/Untitled.png)- BSC기준으로 USDC를 담보로 ETH숏을 잡으면 예금에서 예금에 대한 이자로 10.13%를 받고 바이파이 리워드 6.75%를 받고 대출 이더에 대한 이자로 5.73%를 내고 리워드로 5.02%를 받습니다.- 이 포지션은 유지한채 1년간 ETH가 빠지지 않아도 설정한 원금의 30% 리워드 보상으로 62%를 벌게 됩니다. 물론 이자율과 리워드 보상률은 변동될 수 있으므로 확정 수치는 아닙니다.- BifiX Bet 설정 비용 거래소 이용료 0.3%로 슬리피지 0.1%로 가정했습니다.**결론 : 마진 VS BifiX Bet**- 마진과 BIfiX Bet모두 레버리지 상품이기 때문에 기본적으로 방향이 맞아야 돈을 버는 것은 동일- 투자가 맞지 않아 투자 기간이 길어질수록 BifiX Bet이 안정적인 투자 방법임을 다음 표를 통해 알 수 있습니다.- 레버리지 매매 자체가 충분히 공격적입니다. 조금 더 마음 편한 투자를 해보시면 어떨까요?"
  }
]
