[
  {
    "title": "Overview",
    "content": "Overview\nBiFi is the Multichain DeFi Project built on BIFROST, the Universal Multichain Middleware. BiFi aims to create a decentralized financial infrastructure that connects all the capital markets currently isolated on each blockchain, and creates new products and services that interoperate across multiple blockchains.\nIn its first iteration, it offers decentralized lending and staking protocols on Ethereum and Binance Smart Chain. BiFi is not a fork of other protocols. It was built from scratch to optimize the algorithms for volatility risk and gas reduction and offer the most competitive interest rates and collateral ratios in the market. BiFi has received 3 external security audits.\nBiFi plans to launch the multichain lending service in 2021. Deposit BTC, borrow ETH. No wrapping, no bridges. It also plans to release leverage solutions, multichain wallet, and multichain development suite for other DeFi projects to expand the multichain DeFi ecosystem.\nSee BiFi White Paper for details.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide"
  },
  {
    "title": "BiFi 사용 가이드",
    "content": "BiFi 사용 가이드\nBiFi는 멀티체인 미들웨어 플랫폼인 BIFROST를 기반으로 만들어진 멀티체인 DeFi 서비스입니다. BiFi는 BIFROST의 기술력을 활용하여 다수의 블록체인과 직접적인 상호 운용을 통해 각 블록체인에 제한된 금융 시장을 연결하는 분산형 금융 인프라를 만듭니다. \n이를 위한 첫 번째 도약으로, 이더리움과 바이낸스 스마트 체인을 연결한 분산형 예금 서비스를 제공합니다. BiFi는 다른 DeFi 서비스를 포크(fork)한 프로토콜이 아니며, 시장에서 가장 경쟁력 있는 이자율과 담보 비율을 제공하기 위해 변동성 위험과 가스 최적화를 위한 알고리즘을 고려하여 만들어졌습니다. 현재 BiFi는 세 번의 오딧을 받았습니다. \nBiFi는 2021년 멀티체인을 통한 암호화폐의 예금과 대출 서비스를 시작할 것이며, 이를 통해 사용자는 BTC를 예금하고 ETH를 대출할 수 있습니다. 이를 위해서 우리는 BTC를 랩핑하지 않습니다. 또한, 멀티체인 DeFi 생태계를 위해 다른 DeFi 프로젝트들을 위한 레버리지 솔루션, 멀티체인 월렛, 멀티체인 DeFi 개발 제품을 출시할 예정입니다. \nBiFi에 대한 자세한 내용은 백서에서 확인할 수 있습니다. \nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide-ko/"
  },
  {
    "title": "BiFi服务介绍",
    "content": "BiFi服务介绍\nBiFi是基于多链中间件BIFROST打造的多链分散型金融(DeFi)。 BiFi利用BIFROST的多链技术直接运用多条区块链，将限制在各条区块链的金融市场连接起来，打造全新分散型金融平台。\n为此, BiFi已成功提供连接以太坊和币安智能链(BSC)的分散型存款服务。BiFi协议不是分叉而来，全部协议由内部技术人员全程开发。为向用户提供市场最高水平的利率和担保率，在策划、开发过程中有考虑到变动性风险及优化Gas手续费的的算法。目前BiFi已接受三次安全审计(Audit)。\n\nBiFi自2021年已开始提供通过多链技术的加密货币存贷款服务。通过此项服务，用户可以抵押BTC存款来借贷ETH等ERC20代币。在此过程中，BiFi并不使用包装比特币(BTC wrapping)。在后续阶段，BiFi将为打造多链DeFi生态，将推出针对其他DeFi项目的杠杆交易方案，多链钱包，多链DeFi开发产品。\n更多技术信息请查阅BiFi白皮书\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/bifi-zh"
  },
  {
    "title": "Introduction",
    "content": "Introduction\nBiFi X is a one-of-a-kind DeFi service that enables you to get maximum leverage in a single transaction using flash loans on yield farming and margin trading positions. It is an entirely new application of flash loans to maximize and democratize the potential of DeFi lending.\nWhy is it better?\nYield farming and leverage trading are the most popular use cases for DeFi lending protocols. You can repeat the process of depositing and borrowing multiple times to reach maximum leverage.\nWhile this is useful, it has obvious drawbacks:\n1. It's repetitive — it can take 10 or more transactions to get leverage\n2. It's expensive — more transactions mean more gas fees\n3. It's confusing — once you have multiple positions open, all the deposits and borrows become added up — making it impossible to track how your position is doing and to close out positions\nThis has made it difficult for the average user to begin leveraging DeFi services like BiFi.\nBiFi X solves this problem by enabling leverage in a single transaction with flash loans and allowing users to easily monitor and manage their positions separately.\n1. It's simpler — anyone can do it with a few clicks, instead of repeating transactions several times.\n2. It's cheaper — one transaction is cheaper than multiple transactions.\n3. It's clearer — it was designed to track each position separately, so you can monitor the performances and close out positions one by one.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/bifi-x/"
  },
  {
    "title": "Overview",
    "content": "Overview\nWelcome to the documentation of Biport Wallet. This guide will teach you all the essentials on how to use Biport Wallet.\nTo those of you new to the blockchain and crypto world, you'll need a wallet to start on this journey — specifically, one that is decentralized. It is essential to carry a decentralized wallet (on your phone or desktop) to onboard the ecosystem of blockchains and use its DApp, DeFi, NFTs, GameFi, and possibly many more in the future.\nBiport Wallet is a decentralized wallet available as a Chrome extension, just like MetaMask. It is a multichain wallet that allows you to manage cryptocurrencies scattered across different blockchains all in one place. You can send, receive, and store a wide range of assets across networks without compromising convenience and security — bringing users the best multichain experience. Biport initially supports Ethereum, Binance Smart Chain (BSC), Avalanche, Klaytn, Polygon networks and even Bitcoin.\nMoreover, the MetaMask Support feature allows you to access and use all DApps that support MetaMask. Biport is best optimized for BiFi, the multichain DeFi lending protocol. You can directly deposit assets on BiFi Lending within the wallet to earn interest and BiFi rewards to maximize yield.\nCreated to expand the decentralized ecosystem currently restrained to a few dominant networks, Biport will enable an efficient multichain ecosystem by connecting all blockchain networks, ecosystems, and communities.\nLet's buckle up and start your blockchain journey. ✈️\nTry Biport Wallet now!\nBiport Wallet is available as a Chrome browser extension.\nBiport Wallet is available as a Chrome browser extension.\nBiport Wallet official website.\nBiport Wallet official website.\nRead the story behind Biport Wallet.\nRead the story behind Biport Wallet.\nHave questions? Ask us anything on Telegram.\nHave questions? Ask us anything on Telegram.\nLast updated 3 years ago",
    "url": "https://docs.bifi.finance/biport-guide/"
  },
  {
    "title": "Biport Wallet Guide",
    "content": "CONNECT A WALLET\nBiport Wallet Guide\nBiport Wallet is a multichain decentralized wallet developed by the BIFROST team.\nYou can send, receive, and store a wide range of assets across networks without compromising convenience and security. Biport initially supports Ethereum, Binance Smart Chain (BSC), Avalanche networks, and even Bitcoin.\nOf course, you may use MetaMask to use DApps, but Biport's unique MetaMask Support feature allows you to access and use all DApps that support MetaMask. This means that you can use Uniswap, SushiSwap, Compound, Aave, and many others with Biport — how cool is that, right?\nBiport is best optimized for BiFi, the multichain DeFi lending protocol. You can also directly deposit assets on BiFi Lending within the wallet to earn interest and BiFi rewards to maximize yield.\nDownload Biport Wallet Chrome browser extension.\nDownload Biport Wallet Chrome browser extension.\nBiport Wallet Official Website.\nBiport Wallet Official Website.\nSee Biport Wallet Guide.\nSee Biport Wallet Guide.\nRead the story behind Biport Wallet.\nRead the story behind Biport Wallet.\nHave questions? Ask us anything on Telegram.\nHave questions? Ask us anything on Telegram.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/biport-wallet-guide"
  },
  {
    "title": "MetaMask Guide",
    "content": "CONNECT A WALLET\nMetaMask Guide\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide"
  },
  {
    "title": "Install MetaMask",
    "content": "CONNECT A WALLET\nMETAMASK GUIDE\nInstall MetaMask\nTo lend, stake, or pool on BiFi, you first need to install MetaMask wallet on your desktop or phone. Follow the steps below to install MetaMask. \n1. Visit MetaMask.io and click Download.\n2. Choose your device and click Install MetaMask. \n3. Click Add to Chrome .\n4. Click Add extension.\n5. Installation is complete. To create an account, click Get Started .\n6. If you already have an account, you can import your existing wallet by clicking Import wallet. Otherwise, click Create a Wallet.\n7. Click I Agree.\n8. Enter your password and remember or keep this in a safe place. \n9. In the next step, your 'Secret Backup Phrase' will be shown. \nClick to reveal your secret phrase and store it in a secure place. \nNEVER share this phrase with anyone else.\n10. You have completed setting up MetaMask! \nTo add your existing tokens to MetaMask, click \"Add Token\".\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide/metamask"
  },
  {
    "title": "Add BSC Network",
    "content": "CONNECT A WALLET\nMETAMASK GUIDE\nAdd BSC Network\nTo use BiFi on Binance Smart Chain (BSC) network, you need to add the network manually and set up a custom RPC. Follow the steps below to add Binance Smart Chain (BSC) network. You can also refer to instructions from Binance Academy.\nAfter adding custom networks, you can easily switch back and forth to other networks. \n1. Open MetaMask, click the top right 'Account' icon, then click Settings.\n2. SelectNetworks.\n3. Click Add Network.\n4. Enter the following information to add BSC network to MetaMask. Then, click Save .\nNetwork Name: Smart Chain (you can name this however you want)\nNetwork Name: Smart Chain (you can name this however you want)\nNew RPC URL: https://bsc-dataseed.binance.org/\nNew RPC URL: https://bsc-dataseed.binance.org/\nChainID: 56\nChainID: 56\nSymbol: BNB\nSymbol: BNB\nBlock Explorer URL: https://bscscan.com\nBlock Explorer URL: https://bscscan.com\n5. You are now connected to BSC network! BSC Mainnet will be shown in your list of networks.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide/bsc"
  },
  {
    "title": "Add Avalanche Network",
    "content": "CONNECT A WALLET\nMETAMASK GUIDE\nAdd Avalanche Network\nTo use BiFi on Avalanche network, you need to add the network manually and set up a custom RPC. Follow the steps below to add Avalanche network. You can also refer to the guide on Avalanche docs.\nAfter adding custom networks, you can easily switch back and forth to other networks. \nStep 1\nLogin to your MetaMask wallet on your Chrome browser.\nLogin to your MetaMask wallet on your Chrome browser.\nClick on the drop down menu for Networks.\nClick on the drop down menu for Networks.\nSelect Custom RPC.\nSelect Custom RPC.\nStep 2\n1. Type in the following:\nNetwork Name: Avalanche Mainnet C-Chain\nNetwork Name: Avalanche Mainnet C-Chain\nNew RPC URL: https://api.avax.network/ext/bc/C/rpc\nNew RPC URL: https://api.avax.network/ext/bc/C/rpc\nChain ID: 0xa86a\nChain ID: 0xa86a\nSymbol: AVAX\nSymbol: AVAX\nExplorer: https://cchain.explorer.avax.network/\nExplorer: https://cchain.explorer.avax.network/\n2. Click \"Save\"\nStep 3\nYou have completed adding Avalanche Network to MetaMask.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide/avalanche"
  },
  {
    "title": "Add Klaytn Network",
    "content": "CONNECT A WALLET\nMETAMASK GUIDE\nAdd Klaytn Network\nIf you want to use MetaMask instead of Biport to start lending and borrowing on Klaytn, you will need to add the network manually on MetaMask.\nStep 1. Open MetaMask, select the network drop-down, and click 'Add Network'.\nStep 2. Enter the following network information.\n1) Network Name : Klaytn Mainnet Cypress\n2) New RPC URL(Required) : https://cypress.chain.thebifrost.io\n3) Chain ID (Required) : 8217\n4) Currency Symbol (optional) : KLAY\n5) Block Explorer URL (optional) : https://scope.klaytn.com\nOnce you have added Klaytn network on BiFi:\nIf you switch back and forth between BiFi and a Klaytn-based DApp (i.e. KLAYSwap), the Klaytn network on BiFi may automatically switch to a different RPC URL. In this case, we recommend you to re-add the Klaytn network on BiFi using a different \"Network Name\" of your choice (i.e. BiFi Klaytn).\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide/klaytn"
  },
  {
    "title": "Import custom tokens",
    "content": "CONNECT A WALLET\nMETAMASK GUIDE\nImport custom tokens\nBiFi supports lending and borrowing for multiple networks. Follow the steps below to manually import (add) various tokens supported by BiFi on MetaMask.\nHow to import tokens\nStep 1\nOpen MetaMask and click Import Tokens button at the bottom.\nStep 2\nEnter the token contract address (see below for all addresses). The token symbol and token decimal will be entered automatically. \nStep 3\nClick Import Tokens. The token is now added to the main wallet page.\nBiFi Token Contract Address List\nEthereum Mainnet\nBFC\n0x0c7d5ae016f806603cb1782bea29ac69471cab9c\nBiFi\n0x2791bfd60d232150bff86b39b7146c0eaaa2ba81\nUSDT\n0xdac17f958d2ee523a2206206994597c13d831ec7\nDAI\n0x6b175474e89094c44da98b954eedeac495271d0f\nLINK\n0x514910771af9ca656af840dff83e8264ecf986ca\nUSDC\n0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48\nWBTC\n0x2260fac5e5542a773aa44fbcfedf7c193bc2c599\nUNI-V2\n0x01688e1a356c38a8ed7c565bf6c6bfd59543a560\nuniswap - bfc / eth\nUNI-V2\n0x1ec9b867b701c1e5ce9a6567ecc4b71838497c27\nuniswap - bifi / eth\nSLP\n0x281df7fc89294c84afa2a21ffee8f6807f9c9226\nsushiswap - bfc / eth\nSLP\n0x0bec54c89a7d9f15c4e7faa8d47adedf374462ed\nsushiswap - bifi / eth\nBinance Smart Chain Mainnet\nBiFiB\n0x1378e33a09d8bd8e449CFD8A5aBCa0439286d645\nETH\n0x2170ed0880ac9a755fd29b2688956bd959f933f8\nUSDT\n0x55d398326f99059ff775485246999027b3197955\nDAI\n0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3\nUSDC\n0x8ac76a51cc950d9822d68b83fe1ad97b32cd580d\nBTCB\n0x7130d2A12B9BCbFAe4f2634d864A1Ee1Ce3Ead9c\nBUSD\n0xe9e7cea3dedca5984780bafc599bd69add087d56\nAvalanche Mainnet\nBiFi\n0x49D5c2BdFfac6CE2BFdB6640F4F80f226bc10bAB\nETH\n0xc7198437980c041c805A1EDcbA50c1Ce5db95118\nUSDT\n0xA7D7079b0FEaD91F3e65f86E8915Cb59c1a4C664\nUSDC\n0x3C1BB39bb696B443a1D80BB2b3a3d950Ba9DEE87\nKlaytn Cypress Mainnet\nBiFi\n0xf6c2ecd4b14dab46246608e8e1c2b697faebea11\nKETH\n0x34d21b1e550d73cee41151c77f3c73359527a396\nKUSDT\n0xcee8faf64bb97a73bb51e115aa89c17ffa8dd167\nKDAI\n0x5c74070fdea071359b86082bd9f9b3deaafbe32b\nKUSDC\n0x754288077d0ff82af7a5317c7cb8c444d421d103\nKWBTC\n0x16d0e1fbd024c600ca0380a4c5d57ee7a2ecbf9c\nKXRP\n0x9eaefb09fe4aabfbe6b1ca316a3c36afc83a393f\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/wallet/metamask-guide/import-custom-tokens"
  },
  {
    "title": "Registering BTC Address",
    "content": "BTC LENDING\nRegistering BTC Address\nTo lend and borrow BTC on BiFi, the user needs three BTC addresses. Two (deposit address and repayment address) are issued by BiFi. The address for withdrawing or borrowing BTC will need to be registered by the user. \nEach BTC address are used for the following:\nBTC Deposit Address\nAddress to deposit BTC to BiFi from user's own Bitcoin wallet\nBTC Repayment Address\nAddress to repay borrowed BTC from BiFi \n\nMy BTC Address\nAddress to receive BTC when withdrawing or borrowing BTC from BiFi\nHow to register your BTC address:\n1) Once you connect MetaMask wallet to BiFi, click 'Deposit' next to BTC to have your two personal BTC addresses issued.\n2) Then, enter your own Bitcoin wallet address to receive BTC when withdrawing or borrowing BTC and click 'Register' to finish registering BTC address. \nYou will need to register your BTC address only once. \nYou will need to register your BTC address only once. \nBiFi will automatically store your BTC Deposit and Repayment Address for you, but you can also store these addresses for your own record.\nBiFi will automatically store your BTC Deposit and Repayment Address for you, but you can also store these addresses for your own record.\nGas fees will incur when registering BTC address.\nGas fees will incur when registering BTC address.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/btc-lending-guide/registering-btc-address"
  },
  {
    "title": "Depositing or Withdrawing BTC",
    "content": "BTC LENDING\nDepositing or Withdrawing BTC\nHow to Deposit BTC \nDeposit BTC to earn interest and BiFi tokens on BiFi Lending. Click the link below to see how you can calculate your net profit with your deposits. \nTo deposit BTC on BiFi, you need to send BTC to your BTC Deposit Address issued during Registering BTC Address(Registering BTC Address 페이지 링크 걸기).\nClick 'Deposit' BTC on BiFi Lending\nClick 'Deposit' BTC on BiFi Lending\nCopy the BTC Deposit Address and send BTC to this address from your own Bitcoin wallet\nCopy the BTC Deposit Address and send BTC to this address from your own Bitcoin wallet\nAfter several confirmations, find the amount deposited on BiFi Lending page. \nAfter several confirmations, find the amount deposited on BiFi Lending page. \nHow to Withdraw BTC  \nTo withdraw BTC, click 'Withdraw' and enter the desired amount. The withdrawn amount will include the interest earned from the deposit. \nThe BTC withdrawal process is same as withdrawing all other assets on BiFi. But, it will take some time for BiFi to process BTC withdrawal as it verifies with several confirmations to securely process the multichain transaction. \nOnce the withdrawal transaction is complete, you can find the withdrawn amount on My BTC Address registered during Registering BTC Address.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/btc-lending-guide/depositing-or-withdrawing-btc"
  },
  {
    "title": "Borrowing BTC",
    "content": "BTC LENDING\nBorrowing BTC\nHow to Borrow BTC \nBiFi is the first Decentralized Finance (DeFi) that allows users to lend native Bitcoin (BTC) and borrow Ethereum-based (ERC-20) tokens, and vice versa. Experience multichain lending and borrowing for the first time on DeFi, implemented with Optimistic BTC Lending. We ensure maximum security and the best user experience.\nThe process for borrowing BTC against Ethereum-based collateral, or vice versa, is the same as borrowing all other assets on BiFi. See 'How to Borrow on BiFi Lending'\nDeposit BTC, Borrow ETH (or ERC-20 tokens)\nOnce you have deposited BTC, you can start borrowing Ethereum-based (ERC-20) tokens against BTC collateral. Then, start leveraging the borrowed Ethereum-based tokens to earn even more BiFi token rewards. \nClick 'Borrow' and enter the amount to borrow. It will take some time for BiFi to process BTC borrowing as it verifies with several confirmations to securely process the multichain transaction. \nOnce complete, the borrowed asset can be found in your MetaMask wallet. \nDeposit ETH (or ERC-20 tokens), Borrow BTC \nYou can also deposit Ethereum-based (ERC-20) tokens to borrow BTC. Then, start leveraging the borrowed BTC to earn even more BiFi token rewards. \nClick 'Borrow' and enter the amount of BTC to borrow. It will take some time for BiFi to process this as it verifies with several confirmations to securely process the multichain transaction. \nOnce the multichain transaction is complete, you can find the borrowed BTC amount on My BTC Address registered during Registering BTC Address.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/btc-lending-guide/borrowing-btc"
  },
  {
    "title": "Cross-chain lending guide",
    "content": "BIFI CROSS-CHAIN\nCross-chain lending guide\nNow BiFi offers cross-lending service. That means you will be able to lend tokens on one chain and borrow from another using your collateral. In this guide we will see the example of supplying BFC in Bifrost Mainnet and borrowing USDC from BNB chain.\n(Note: For deposits and loans you will need BFC in Bifrost Mainnet to be able to pay the gas fees and use cross-chain services)\nConnect to your preferred wallet\nConnect to your preferred wallet\nClick on the asset that you want to use as a collateral.\nIn this guide, we will be using BFC tokens as a collateral.\nClick on the asset that you want to use as a collateral.\nIn this guide, we will be using BFC tokens as a collateral.\nSelect the mainnet that you want to supply tokens to.\nEx: Bifrost Mainnet, Supply “X” amount of BFC.\nSelect the mainnet that you want to supply tokens to.\nEx: Bifrost Mainnet, Supply “X” amount of BFC.\nChoose the amount of tokens that you want to supply and press “Supply”.\nChoose the amount of tokens that you want to supply and press “Supply”.\nAfter pressing “supply” you will have to confirm the transaction in your wallet.\nAfter confirming the transaction, you will see a message saying “Supply completed”.\nAfter confirming the transaction, you will see a message saying “Supply completed”.\n6. Click on the asset that you want to borrow.\nIn this guide, we will be borrowing USDC on BNB chain.\n7. Select the mainnet that you want to borrow tokens from.\n8. Choose the amount of tokens that you want to borrow and press “Borrow”.\n(Note: You can always see the minimum & maximum amount allowed for borrowing. Please remember that the service fee will change depending on the mainnet that you select.)\nIn the above screenshot, where 2 & 3 are indicated, the remaining borrow limit in USD amount and percentage of loan to maximum can be seen.\n9. After confirming the transaction, you will see a message saying “Borrow completed”.\nMarket overview\nWhen checking the supply APY you might see a 0% for some tokens in our list. Currently, due to the lack of demand for some tokens, can cause a lack of loan liquidity. Once the borrow for those tokens increases, so will do the supply APY.\nBiFi borrow and Margin Call limit ratios\nYou can consult this date in the next table:\nCollaterals\nBorrow Limit (LTV)\nMargin Call Limit\nBFC\n25%\n92%\nETH\n75%\n95%\nUSDC\n80%\n95%\nBNB\n70%\n95%\nMATIC\n70%\n93%\nUSDT\n80%\n95%\nGlossary\nBorrow limit: Also known as LTV, it refers to the amount ratio that the user can borrow against their collateral assets\nMargin call limit: Refers to the predefined point at which a borrower's collateral value falls below a certain threshold, triggering a margin call and requiring the borrower to add more collateral or repay the loan to avoid the liquidation of their assets.\nLast updated 1 year ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/bifi-crosschain/cross-chain-lending-guide"
  },
  {
    "title": "Depositing",
    "content": "LENDING & REWARDS\nDepositing\nOverview\nDeposit assets on Bitcoin or any asset on Ethereum, BSC, Avalanche, Klaytn networks to start earning interest and BiFi rewards. \nFor example, when you deposit BNB on BSC network, you earn 2.57% interest (APY) on BNB. Additionally, you earn an additional 15.07% interest in BiFi tokens. As a result, your net APY is 17.64% by depositing BNB.\nYou may deposit, withdraw, and claim rewards at any time.\nBiFi Lending Video Tutorial\nStart Lending on BiFi\nLearn more about BiFi token rewards: \nHow to Deposit\n1. Set Up Network on MetaMask\nEx: Ethereum Mainnet \nOpen MetaMask extension on Chrome, click the top-right icon, and select Ethereum Mainnet.\nEx: BSC mainnet\nOpen MetaMask extension on Chrome, click the top-right icon, and select Smart Chain.\nMake sure you are on the correct network on MetaMask! If you set BiFi to Ethereum Mainnet, but have your MetaMask set to another network, there will be an error. \n2. Enable Assets\nWhen you are depositing an asset for the first time on BiFi, you need to enable the asset first.\nClick Deposit next to the asset you want to deposit. \nClick Deposit next to the asset you want to deposit. \nClick Enable to enable the asset.\nClick Enable to enable the asset.\nYou need native coins (i.e. ETH) for the network to pay for gas fees when enabling assets\n3. Deposit Assets\nNow the fun part! \nOnce you have enabled assets, you can start depositing. Click Deposit next to the asset and enter the amount you wish to deposit. Click Deposit on the bottom right to finish depositing! \nDeposit Amount\nUse the bar to set the percentage from the amount you are holding.\nWallet Balance\nView your current wallet balance from the selected deposit amount\nAPY\nThe amount of interest you can earn on your deposits in a year.\nCollateral Ratio\nThe asset collateral ratio, or the percentage of deposited assets that can be borrowed against.\nCollateral Ratio: 75% You can borrow 0.75 ETH worth of assets when you deposit 1 ETH\nToken Price\nCurrent price of the asset you want to deposit.\nBorrow Limit\nThe maximum amount of assets you can borrow from the selected deposit amount. The more assets you deposit, the greater the borrow limit becomes proportionate to the collateral ratio.\nBorrow limit before deposit >> after deposit ($46.40 >> $46.49)\nUsed Borrow Limit\nYou can see your current borrow limit, based on your current deposits and borrows. The more you deposit, your collateral increases and thus your borrow limit.\nUsed borrow limit before deposit >> after deposit (0% >> 0.48%)\n4. Withdraw Assets\nClick Withdraw to withdraw the assets you have deposited. \nClick Withdraw to withdraw the assets you have deposited. \nThen, select the amount of asset you wish to withdraw. Withdrawal amount includes the interest accrued. \nThen, select the amount of asset you wish to withdraw. Withdrawal amount includes the interest accrued. \nYou claim or repay the interest accrued on your deposit or borrows in the same asset you have deposited or borrowed.\nWithdraw Amount\nAmount you want to withdraw from your deposits.\nMaximum Withdraw Amount\nMaximum amount you can withdraw (Deposit with all accrued interest)\nAPY\nThe amount of interest you can earn on your deposits in a year\nCollateral Ratio\nThe collateral ratio for the asset, or the percentage of deposited assets that can be borrowed against.\nCollateral Ratio: 75% You can borrow 0.75 BNB worth of assets when you deposit 1 BNB\nToken Price\nCurrent price of the asset you want to deposit.\nBorrow Limit\nThe maximum amount of assets you can borrow from the selected deposit amount. The more assets you deposit, the greater the borrow limit becomes proportionate to the collateral ratio.\nBorrow limit before withdrawal >> after withdrawal ($46.40 >> $23.31)\nMaximum Borrow Limit\nYou can see your current borrow limit, based on your current deposits and borrows. The more you deposit, your collateral increases and thus your borrow limit.\nUsed borrow limit before deposit >> after deposit (0.48% >> 0.96%) Percentage of your collateral you can borrow (borrow limit) after withdrawal: 100% - 0.96% = 99.04%\nLast updated 2 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/lending/deposit"
  },
  {
    "title": "Borrowing",
    "content": "LENDING & REWARDS\nBorrowing\nOverview\nYou can borrow assets against your deposited collateral. The amount you can borrow is determined by the collateral ratio of assets you deposited. You can easily check the ratio of your deposit to borrows, or loan-to-value ratio (LTV) in the colored bar below the top menu.\nVideo Tutorial\nEarn as you borrow with BiFi tokens\nWhen you repay your borrows, you have to pay your accrued interest. However, because BiFi is currently rewarding users of BiFi with BiFi tokens, you can actually earn as you borrow.\nFor example, you can borrow DAI at 11.87% interest rate, but by earning BiFi tokens you actually earn approximately 16.12%. As a result, you can earn 4.25% even as you borrow!\nLearn more about BiFi token rewards: \n1. Setting MetaMask Network\nEthereum mainnet \nClick the MetaMask extension on your browser and set the network on top to Ethereum Mainnet.\nBSC mainnet\nClick the MetaMask extension on your browser and set the network on top to BSC Mainnet.\nBiFi supports both Ethereum and BSC. If you set BiFi to BSC Mainnet, but have your MetaMask set to another network, you will see an error. Make sure you are on the correct network.\n2. Borrowing Assets\nIf you deposited your assets to BiFi, you can now use your deposit as collateral to borrow other assets. Click Borrow for the asset you want to borrow, and set your desired amount.\nWhen you click Borrow , you will be prompted to confirm the transaction on MetaMask. When the transaction is confirmed, MetaMask will notify you and you can check your borrowed asset.\nOnce you approve the transaction, you can leave the dialog before it is confirmed, as it is working directly on the blockchain.\nPage Overview\nYour assets can be subject to liquidation, if the ratio of your deposited assets to your borrowed asset exceeds the collateral ratio, or Loan-To-Value Ratio (LTV). BiFi only allows you to borrow up to the maximum borrow limit, but your LTV can exceed this in three scenarios:\n1) Your borrowed asset increases in price, making your borrowed amount bigger, 2) Your deposited asset decreases in price, making your deposit amount smaller, or 3) your borrows plus accrued interest is more than your deposits plus accrued interest.\nBorrow Amount\nThe amount you want to borrow.\nAPY\nThe amount of interest you can earn on your borrow in a year.\nToken Price\nCurrent price of the asset you want to borrow.\nBorrow Limit\nThe maximum amount of assets you can borrow after you borrow the selected amount. The more assets you borrow, the lower the borrow limit becomes, proportionate to the collateral ratio.\nBorrow limit before borrow >> after borrow $46.64 >> $23.43 (if you borrow $23.20)\nUsed Borrow Limit\nThe changed used borrow limit in percentage after you borrow the selected amount.\nUsed borrow limit before borrow >> after borrow 0.48% >> 50.24%\n3. Repaying Assets \nClick Repay to pay back your assets. Repay amount excludes the amount of interest you need to pay back. Select the amount you wish to repay.\nThe asset must be enabled to be repaid. Enabling assets incur gas fees, so you need to hold be holding ETH to pay on Ethereum BiFi and BNB to pay on BSC BiFi.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/lending/borrow"
  },
  {
    "title": "BiFi Rewards",
    "content": "LENDING & REWARDS\nBiFi Rewards\nClaiming BiFi Tokens\nYou can claim all your BiFi token rewards from depositing and lending at once. Click Claim BiFi. You can claim your BiFi token rewards at any time. If you haven't yet added BiFi tokens to your MetaMask, click Add Token to add BiFi tokens. \nYou can claim your BiFi token rewards from BSC BiFi Lending when Bifrost multichain wallet launches in 2021. Learn about it on our Medium.\nVideo Tutorial\nBiFi Rewards\nA total of 400,000,000 BiFi tokens will be distributed as a reward for Lending over the course of 4 years. This distribution may change through governance in the future.\nTotal Rewards\nTotal amount of BiFi tokens distributed for Lending\nDaily Distribution\nAmount of BiFi tokens distributed daily for Lending\nReamining Rewards\nAmount of remaining BiFi tokens as a reward for Lending\nMarket Distribution\nAmount of BiFi token rewards per each asset and the corresponding APY on Lending\nDeposit APY\nThe total amount of interest you can earn per year from depositing each asset. This amount includes both the interest on your deposited assets and the interest of BiFi tokens.\nLearn how to earn more than just interest from depositing assets! \nBorrow APY\nThe total amount of interest you can earn per year from borrowing each asset. Earning BiFi token rewards from borrowing can make up for the interest you need to pay on your borrowed assets.\nLearn how to make profit by borrowing assets!\nMaximum APY\nYou can deposit and borrow with your initial deposit for a maximum 8 times.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/lending/reward"
  },
  {
    "title": "Pooling on Ethereum",
    "content": "POOLING & STAKING\nPooling on Ethereum\nOverview\nBiFi Pooling service rewards users who add liquidity to BFC-ETH and BiFi-ETH pools on BiFi. When you add liquidity to BFC-ETH and BiFi-ETH pairs on Uniswap, you will receive Liquidity Pool (LP) Tokens in return. Deposit these LP Tokens on BiFi Pooling and you will receive BiFi Tokens as a reward. You can withdraw the LP Tokens from BiFi and redeem this on Uniswap to get your liquidity back (plus your portion of the 0.3% swap fee accumulated in the pool).\nWhy is BiFi rewarding me when I deposit BFC-ETH and BiFi-ETH tokens on Uniswap?\nUniswap is a decentralized exchange (DEX) that allows you to swap (trade) ETH for BFC and/or BFC for ETH. For people to trade BFC and BiFi on Uniswap, there must be enough liquidity in each BFC-ETH and BiFi-ETH pools. That way, users are able to trade BFC and BiFi with their ETH on Uniswap whenever they want! As a token of gratitude, we have created our own Pooling service to reward users who provide liquidity for our tokens.\nLearn more Uniswap\n1. Setting MetaMask to Ethereum Mainnet\nClick the MetaMask extension on your browser and set the network to Ethereum Mainnet. Then set BiFi to Ethereum Mainnet.\nBiFi supports both Ethereum and BSC mainnet. If you set BiFi to Ethereum Mainnet, but have your MetaMask set to a different network, you will see an error. Make sure you set the same network for both MetaMask and BiFi.\n2. How to migrate your LP tokens to SushiSwap\nTo continue earning rewards on your Uniswap LP tokens, you will need to withdraw your Uniswap LP tokens and migrate them to SushiSwap liquidity.\nStep 1. Withdrawing LP tokens from BiFi Pooling\n1. Go to app.bifi.finance/pool. Click Withdraw below My Deposited LP Tokens.\n2. Set the withdraw amount to its maximum. Then, click Withdraw.\n3. Withdrawing LP tokens will incur Ethereum gas fees. Click Confirm on your MetaMask to confirm spending the gas fees.\n4. You have now successfully withdrawn your UNI-V2 LP tokens to your MetaMask.\nStep 2. Migrating Uniswap Liquidity to SushiSwap\n1. Go to app.sushi.com/migrate.\n2. Click Connect to a wallet and connect your MetaMask.\n3. Click Non-hardware Wallet and your Uniswap Liquidity pool will be shown.\n4. Click BFC/WETH or BiFi/WETH. If you have both, you must migrate for both pools separately.\n5. Select MAX. Then click Migrate.\n6. Click Sign to confirm Signature Request on your MetaMask.\n7. Migrating LP tokens will incur Ethereum gas fees. Click Confirm on your MetaMask to confirm spending the gas fees.\n8. You have now successfully migrated your BFC-ETH LP tokens to SushiSwap. If you have BiFi-ETH LP tokens on BiFi Pooling, repeat Step 1 to migrate the liquidity.\nStep 3. Adding SushiSwap LP (SLP) tokens to MetaMask\n1. Click Add Token on the bottom-right of the BiFi page.\n2. Select BFC-ETH or BiFi-ETH pair.\n3. Select Add Token to complete adding the SushiSwap LP (SLP) token.\nYou are now ready to deposit SLP tokens on BiFi Pooling. Go to app.bifi.finance/pool and start earning BiFi rewards!\n3. Adding New Liquidity on SushiSwap to receive SLP tokens\n1. Go to https://app.bifi.finance/pool/ and click Add Liquidity to BFC-ETH Pair on SushiSwap. Or, go to https://app.sushi.com/add/ETH and click Select a token.\n2. Search BFC or BiFi and select the token.\n3. To add liquidity, input the same amount of ETH and BFC. Then, click Approve BFC.\n4. Click Confirm on your MetaMask.\n5. Click Confirm Adding Liquidity.\n6. Click Confirm Supply.\n7. Adding liquidty to SushiSwap will incur Ethereum gas fees. Click Confirm on your MetaMask to confirm spending the gas fees.\n8. Transaction has been submitted. You can view the transaction on Etherscan by clicking View on explorer.\n9. Once the transaction is complete, ‘Add ETH and BFC’ will appear on the top right corner.\nYou are now ready to deposit SLP tokens on BiFi Pooling. Go to app.bifi.finance/pool and start earning BiFi rewards!\n4. Depositing LP Tokens in BiFi Pooling\nAfter you have received SLP Tokens from SushiSwap, you can now deposit them into BiFi Pooling service. If this is your first deposit, you must approve the token first on BiFi.\nGas fees are required to activate the token. This step needs to be done only once.\n5. Depositing tokens in BiFi-ETH on SushiSwap\nIn addition to the BFC-ETH pool, SushiSwap also has a BiFi-ETH pool. The same process goes for depositing BiFi-ETH LP Tokens as BFC-ETH SLP Tokens. Provide liquidity in the SushiSwap BiFi-ETH pool, deposit LP Tokens on BiFi, and get BiFi Token rewards!\n6. BFC-ETH Pooling Page Overview\nBFC-ETH Liquidity Provider Earnings\nBiFi Pooling was created to reward users who provide liquidity in the BFC-ETH and BiFi-ETH SushiSwap pool. When users deposit the LP Tokens they receive from providing liquidity on Uniswap, BiFi rewards BiFi Tokens in return.\nTotal Deposited\nNumber of BFC-ETH LP Tokens currently deposited in BiFi Pooling\nEarnings Rate\nNumber of BiFi Tokens to be distributed in a given week\nAPY\nEstimated Annual Percentage Yield (APY) of BiFi Tokens on BiFi\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/pooling-staking/pooling"
  },
  {
    "title": "Staking on Ethereum",
    "content": "POOLING & STAKING\nStaking on Ethereum\nOverview\nStaking service rewards users who have purchased BFC Tokens and deposits them in BiFi Staking in return for providing liquidity. Earn BiFi Tokens by simply depositing BFC Tokens on BiFi Staking. \nBuy BFC\n1. Setting MetaMask to Ethereum Mainnet\nClick the MetaMask extension on your browser and set the network to Ethereum Mainnet. Then set BiFi to Ethereum Mainnet.\nBiFi supports both Ethereum and BSC mainnet. If you set BiFi to Ethereum Mainnet, but have your MetaMask set to a different network, you will see an error. Make sure you set the same network for both MetaMask and BiFi.\n2. Depositing BFC tokens in Staking\nOnce you have purchased BFC Tokens on Uniswap, you can deposit them in BiFi by clicking Stake BFC. If this is your first deposit, you must approve the token first.\nGas fees are required to activate the token. This step needs to be done only once.\n3. BFC Staking Page Overview\nTotal Deposited\nNumber of BFC Tokens currently deposited in BiFi Staking\nEarnings Rate\nNumber of BiFi Tokens to be distributed in a given week\nAPY\nEstimated Annual Percentage Yield (APY) of BiFi Tokens on BiFi\nMy Staked BFC\nThe number and price of BFC Tokens you have deposited in Staking. Deposit BFC Tokens by clicking Stake BFC. Deposited tokens can be withdrawn at any time by clicking Withdraw.\nMy Claimable Staking Earnings\nThe number of BiFi tokens you can receive in a given week with your deposited BFC tokens and the number you have received so far. Claim your BiFi Token rewards at any time by clicking Claim BiFi.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/pooling-staking/staking"
  },
  {
    "title": "How To Buy BFC",
    "content": "TOKEN PURCHASE\nHow To Buy BFC\nOverview\nBFC exchange listings: https://linktr.ee/bifrost_bifi\nOnce you have finished setting up MetaMask, you can easily purchase BFC and BiFi Tokens on MetaMask. You only need to install Metamask on Ethereum mainnet to purchase the tokens.\nUse this version if you are unable to purchase BFC tokens at Upbit, Uniswap, or other exchanges. Using Metamask Swap service to purchase tokens will incur an additional 0.875% fee than when purchasing on Uniswap.\n1. Click the MetaMask extension on your browser and log in.\n2. Set the MetaMask network to Ethereum Mainnet.\nBiFi supports both Ethereum and BSC mainnet. If you set BiFi webpage to Ethereum Mainnet but have MetaMask set to a different network, there will be an error. Make sure you set the same network for both MetaMask and BiFi.\n3. Click Swap on the first screen of Metamask.\n4. After clicking Select A Token, search for \"BFC\".\n5. Click Etherscan to make sure it is the correct BFC token.\nMake sure the Etherscan link leads to the same BFC token address link as below.\nBFC Token Address: https://etherscan.io/token/0x0c7d5ae016f806603cb1782bea29ac69471cab9c\n6. Once you have confirmed that the BFC token address is correct, click Continue.\n7. Enter the amount of ETH you want to swap BFC Tokens for.\nThen, clickReview Swap to review your swap.\n8. Please wait for Metamask to find a quote for the current price on Uniswap.\n9. Review the estimated network fee for your swap exchange.\nThen, clickSwap.\nBifrost and BiFi will not receive any of these network fees. All fees are for the Ethereum network and Metamask wallet fees.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/purchasing-guide/buy-bfc"
  },
  {
    "title": "How to Buy BiFi",
    "content": "TOKEN PURCHASE\nHow to Buy BiFi\nThere are several ways to buy BiFi.\nBiFi exchange listings: https://linktr.ee/bifrost_bifi\nBiFi Rewards: You can earn BiFi by using lending, pooling, and staking.\nMetaMask Swap: MetaMask offers native swap service. Read below.\nCurrently on BSC, BiFi tokens can only be earned as rewards. It will be added to a DEX on BSC in the near future.\nOverview\nHave you installed your MetaMask yet? Learn how to set MetaMask to Ethereum mainnet and purchase BFC and BiFi tokens!\nHow to Buy BFC (Simple Version)\nUse this version if you are unable to purchase BFC tokens at Upbit, Uniswap, or other exchanges. Using Metamask Swap service to purchase tokens will incur an additional 0.875% fee than when using Uniswap.\n1. Click the MetaMask extension on your browser and log in.\n2. Set the MetaMask network to Ethereum Mainnet.\nBiFi supports both Ethereum and BSC mainnet. If you set BiFi webpage to Ethereum Mainnet but have MetaMask set to a different network, there will be an error. Make sure you set the same network for both MetaMask and BiFi.\n3. Click Swap on the first screen of Metamask.\n4. After clicking Select A Token, search for \"BiFi\".\n5. Click Etherscan to make sure it is the correct BiFi token.\nMake sure the Etherscan link leads to the same BFC token address link as below.\nBFC Token Address: https://etherscan.io/token/0x0c7d5ae016f806603cb1782bea29ac69471cab9c\n6. Once you have confirmed that the BiFi token address is correct, click Continue.\n7. Enter the amount of ETH you want to swap BFC Tokens for.\nThen, clickReview Swap to review your swap.\n8. Please wait for Metamask to find a quote for the current price on Uniswap.\n9. Review the estimated network fee for your swap exchange.\nThen, clickSwap.\nBifrost and BiFi will not receive any of these network fees. All fees are for Ethereum network and Metamask wallet fees.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/purchasing-guide/buy-bifi"
  },
  {
    "title": "Bridging Tokens to Avalanche Network",
    "content": "BRIDGING\nBridging Tokens to Avalanche Network\nIn this section, you will learn how to transfer ERC-20 tokens from Ethereum network to Avalanche’s C-Chain.\nTo use your tokens on Avalanche network, you can use the Avalanche Bridge to transfer ERC-20 tokens from Ethereum network to Avalanche's C-Chain. Here is how it works:\nStep 1\nVisit Avalanche Bridge.\nVisit Avalanche Bridge.\nConnect your wallet using MetaMask or Coinbase Wallet, then log in.\nConnect your wallet using MetaMask or Coinbase Wallet, then log in.\nMake sure you have added Avalanche network to your MetaMask wallet. To learn how to set up MetaMask Wallet, go to our MetaMask Guide.\nStep 2\nAfter connecting your Metamask wallet, make sure that the \"From\" tab shows Ethereum.\nAfter connecting your Metamask wallet, make sure that the \"From\" tab shows Ethereum.\nChoose the token to swap to Avalanche network and enter the amount of tokens.\nChoose the token to swap to Avalanche network and enter the amount of tokens.\nClick \"Transfer\".\nClick \"Transfer\".\nStep 3\nClick \"Confirm\" on MetaMask to proceed with the transaction.\nStep 4\nWait until the transaction on both Ethereum and Avalanche Mainnnet is complete. It usually takes about 10 minutes on Ethereum and 30 seconds on Avalanche.\nStep 5\nYou have completed swapping tokens to Avalanche network.\nTransaction fees are paid in AVAX tokens when you bridge Avalanche network-based tokens to Ethereum network-based tokens.\nTransaction fees are paid in AVAX tokens when you bridge Avalanche network-based tokens to Ethereum network-based tokens.\nBridge transfers are only allowed to the same address on the other network.\nBridge transfers are only allowed to the same address on the other network.\nOnly the supported ERC20 tokens can be transferred on the bridge.\nOnly the supported ERC20 tokens can be transferred on the bridge.\nLast updated 2 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/bridging/bridging-tokens-to-avalanche-network"
  },
  {
    "title": "Bridging BiFi From Ethereum to Avalanche Network",
    "content": "BRIDGING\nBridging BiFi From Ethereum to Avalanche Network\nIn this section, you will learn how to bridge your BiFi tokens from Ethereum Network to Avalanche Network using Anyswap App.\nStep 1\nLaunch Anyswap App and click on \"Bridge\" on the left menu bar.\nStep 2\nClick \"Connect to a wallet\" and choose MetaMask.\nStep 3\nClick \"Next\" to connect to MetaMask wallet.\nStep 4\nClick on the token button and search \"BiFi\". Set BiFi tokens on both \"From\" and \"To\".\nStep 5\nYou must have BiFi tokens on your connected MetaMask wallet to proceed.\nMake sure the \"From\" shows ETH mainnet and \"To\" tab shows AVAX mainnet.\nMake sure the \"From\" shows ETH mainnet and \"To\" tab shows AVAX mainnet.\nEnter the amount of BiFi tokens to bridge from ETH mainnet to AVAX mainnet.\nEnter the amount of BiFi tokens to bridge from ETH mainnet to AVAX mainnet.\nClick \"Swap\".\nClick \"Swap\".\nStep 6\nConfirm the transaction on MetaMask.\nStep 7\nBridging BiFi tokens from Ethereum network to Avalanche network is complete. You can view your transaction in Anyswap Explorer.\n0.1% fee is charged when transferring from Avalanche to Ethereum network via Anyswap Bridge. The minimum fee is $30 and the maximum fee is $1,000.\nLast updated 2 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/bridging/bridging-bifi-from-ethereum-to-avalanche-network"
  },
  {
    "title": "Bridging BiFi From Ethereum to Klaytn Network",
    "content": "BRIDGING\nBridging BiFi From Ethereum to Klaytn Network\nIn this section, you will learn how to bridge your BiFi tokens from Ethereum Network to Klaytn Network using Orbit Bridge.\nStep 1\nVisit Orbit Bridge.\nStep 2\nChoose BiFi token to exchange network.\nStep 3\nChoose the current network of BiFi in “From Chain” section.\nStep 4\nChoose a wallet to connect and connect your wallet.\nYour wallet is successfully connected.\nStep 5\nChoose a network to exchange from “To Chain” section.\nStep 6\nIf you are done up to step 5, the screen will view the current amount of your selected asset.\nType in the number of tokens to exchange network.\nStep 7\nType in your wallet address to receive the exchanged tokens and click “CONVERT NOW”\nClick “CONVERT NOW” and confirm your transaction from your connected wallet.\nBridging BiFi tokens from Ethereum network to Klaytn network has been completed.\nStep 9\nVisit Orbit Explorer to view your status.\nLast updated 2 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/bridging/bridging-bifi-from-ethereum-to-klaytn-network"
  },
  {
    "title": "BDAO",
    "content": "MORE\nBDAO\nBiFi Decentralized Autonomous Organization\nIntroduction\nBDAO is a governance protocol of BiFi made to allow BiFi token holders to suggest, express, and implement the changes of the BiFi.\nDeFi governance tokens allow token holders to govern a blockchain protocol, and in some cases enable them to capture value directly from DeFi application usage. DeFi governance tokens function as a distinguished role: the issuing project creates special polls that allow the token holders to vote on a specific proposal and determine the primary focus of the project’s development resources. It is especially important for projects in the decentralized ecosystem like BiFi to \"Decentrailze\" the freedom to control the system to users to maintain the original cryptocurrency ideals of decentralization and democratization. In this context, BiFi is now starting the governance protocol, BDAO, to give power to BiFi holders to determine the future of BiFi.\nHow to use BDAO\nFirst, swap BiFi tokens to GBiFi tokens.\nIn order to vote in proposals of BDAO, you must swap your BiFi tokens to GBiFi tokens beforehand.\nStep 1‌\nClick \"GBiFi Swap\" button on BiFi website.\nStep 2‌\nYour voting power is determined by the number of GBiFi tokens you have. Enter the number of BiFi and GiBiFi tokens to swap and click \"SWAP\".\nStep 3\nIf you are swapping GBiFi tokens for the first time you have to approve the transaction.\nApprove transaction on MetaMask and your swap is successfully done.\nPlease swap your BiFi tokens to GBiFi tokens before the poll starts in BDAO for your voting power.\nNow, prepare vote in Tally(BDAO)\nStep 1‌\nAfter swapping BiFi tokens to GBiFi tokens, go to BiFi website and click on \"BDAO\" button.\nStep 2\nClick on the BiFi section of Tally governance.\nStep 3 - For the first time voters\nClick on \"Delegate Vote\"\nIn order to cast your first vote, you must go through \"Delegate\" process. This process is only applicable for first-time voters and will not be needed for future votes.\nStep 4 - For the first time voters\nClick \"Delegate to self\"\nNote: \nGBiFi tokens must be swapped before the BDAO proposal goes through \"active\" phase on Tally. For a BDAO proposal to pass, only 60% of total GBiFi tokens must be used for vote, which enables much faster and flexible process than other DeFi governance system that requires a certain quorum of all token holders must vote. Please be noted that BiFi tokens can be mutually swapped with GBiFi tokens, and you must trade your BiFi tokens to GBiFi tokens BEFORE the proposal starts to pursue your voting power.\nVote in Tally \nStep 1‌\nClick on an active proposal.\nStep 2‌\nClick \"Vote\" and proceed your vote. Click \"Submit\"\nS‌tep 3\nProceed transaction in Metamask and your voting is complete.\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/more/bdao-en"
  },
  {
    "title": "Security",
    "content": "MORE\nSecurity\nThe Bifrost team has always put security at the forefront of our development process. With countless breaches threatening the reputation and stability of the blockchain industry, we believe one of the most important contributions that we can make to the ecosystem as a whole is with a relentless focus on security.\nTo that end, we are happy to share the audit report we received for the smart contract developed for BiFi. The audit was conducted by Theori, and there was no security vulnerability found.\nAudits \nThe BiFi has been audited by Theori and Hexlant. \n01. BiFi Lending Protocol by Theori (Feb 2021)\n02. BiFi Staking & Pooling Protocol by Theori (Dec 2020)\n03. BiFi Token Contract by Hexlant (May 2021)\n04. BiFi Lending Protocol by Sooho (Nov 2020)\n05. BiFi X Protocol by Theori (Jun 2021)\nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/more/security"
  },
  {
    "title": "FAQ",
    "content": "MORE\nFAQ\nWhat is BiFi?\nWhat is BiFi?\nWhat services does BiFi support?\nWhat services does BiFi support?\nHow does multichain DeFi work?\nHow does multichain DeFi work?\nHow are interest rates calculated?\nHow are interest rates calculated?\nHow does liquidation happen?\nHow does liquidation happen?\nWhat is BiFi token?\nWhat is BiFi token?\nIs BiFi secure?\nIs BiFi secure?\nBiFi Roadmap\nBiFi Roadmap\nWhat is BiFi?\nBiFi is the Multichain DeFi Project built on BIFROST, the Universal Multichain Middleware. BiFi aims to create a decentralized financial infrastructure that connects all the capital markets currently isolated on each blockchain and creates new products and services that interoperate across multiple blockchains. Through multichain connectivity, BiFi will connect not only Ethereum but also other blockchains like BNB, DOT, KLAY, and ultimately BTC thereby expanding the DeFi ecosystem currently limited to Ethereum.\n→ Introduction to BiFi\nBifrost is a multichain middleware platform that enables developers to create Decentralized Applications (DApps) on top of multiple protocols. Bifrost is not restrained to a single blockchain and creates a new environment where developers can combine the best protocols. Developers are able to use Bifrost to develop a substantially more scalable and flexible DApp by selecting the target blockchain on Bifrost.\nBIFROST Website: https://thebifrost.io/\nWhat Services Does BiFi Support?\nBiFi enables multichain capability in decentralized finance. BiFi initially offers decentralized lending and staking protocols on Ethereum and Binance Smart Chain (BSC). To expand the DeFi ecosystem, BiFi will connect more chains to create a greater, connected financial ecosystem with the underlying multichain middleware, BIFROST. BIFROST will develop into a DeFi suite and help blockchains expand into a multichain DeFi infrastructure.\nBiFi currently supports three services: Lending, Pooling, and Staking.\n1) Lending\nLending service is an asset deposit and loan service supported by Ethereum and BSC. Users receive interest by depositing assets registered in the Lending service and can borrow other cryptocurrencies as collateral for the deposited assets to take various financial positions.\nLending is a lending and borrowing service supported on Ethereum and Binance Smart Chain (BSC). Users can deposit assets to earn interest. Once users deposit their assets, they can use their deposits as collateral to borrow another asset and take a position.\n→ How to Deposit on BiFi\n2) Pooling\nPooling rewards users who provide liquidity (supply) to BFC-ETH and BiFi-ETH pool on Uniswap with BiFi tokens.\nDeposit into the BFC-ETH and BiFi-ETH pool on Uniswap to receive LP (Liquidity Pool) tokens in return.\nDeposit into the BFC-ETH and BiFi-ETH pool on Uniswap to receive LP (Liquidity Pool) tokens in return.\nDeposit the LP tokens on BiFi Pooling service.\nDeposit the LP tokens on BiFi Pooling service.\nAccrue interest from Uniswap and BiFi tokens as rewards!\nAccrue interest from Uniswap and BiFi tokens as rewards!\n→ How to Use Pooling on Ethereum\n3) Staking\nStaking rewards users who buy and deposit BFC on BiFi with BiFi tokens.\nBuy BFC at Upbit, Liquid, Uniswap, etc.\nBuy BFC at Upbit, Liquid, Uniswap, etc.\nDeposit the BFC tokens on BiFi Staking service.\nDeposit the BFC tokens on BiFi Staking service.\nReceive BiFi tokens as a reward.\nReceive BiFi tokens as a reward.\n→ How to Use Staking on Ethereum\nHow Does Multichain DeFi Work?\nPowering the multichain DeFi can be seen in two vectors: expansion of services and enhancement of capability. BiFi will expand its services by supporting more assets with stable liquidity and market demand. At the same time, it will enhance the capability of blockchains by overcoming the limits of a single blockchain like Ethereum, such as its high gas fees and low transaction throughput.\nBiFi leverages Bifrost to enable multichain capability and ensure its security. To create not only a scalable but also a secure multichain platform, Bifrost implements multiple layers of solutions, offering proprietary message relay and monitoring systems, while incorporating verification processes and third-party interoperability solutions.\nMore information can be found in the BiFi Whitepaper\nBiFi is currently supported on Ethereum and Binance Smart Chain (BSC). BiFi on Ethereum and BSC is a single service, not living on a separate island. BiFi uses Bifrost’s multichain technology to collect and exchange data among different blockchains, enabling a truly multichain ecosystem. This ensures that the rewards are not divided chain by chain, but rather shares the same existing distribution model among chains. BiFi will gradually expand the range of information exchanged on these chains to build a multichain DeFi with collateralized loans from different chains.\nMore information can be found in Medium\nHow Are Interest Rates Calculated?\nInterest rates for deposited and borrowed assets are determined algorithmically by the supply and demand for each asset. Interest is calculated and compounded on each block. Interest is added or to the principals, every time a new withdrawal, loan, and repayment occurs. The interest rate model and smart contract code have been developed to optimize gas fees.\nLearn more about BiFi interest model design in our official document\nHow Does Liquidation Happen?\nWhen the amount of the loaned asset exceeds the collateral ratio of the deposited asset, liquidation occurs automatically. Liquidation can also occur in the following cases:\nIncrease in the price of the asset borrowed as collateral\nIncrease in the price of the asset borrowed as collateral\nDecrease in the price of the asset deposited\nDecrease in the price of the asset deposited\nWhen the value of deposit amount with interest becomes smaller than the value of borrowed amount with interest\nWhen the value of deposit amount with interest becomes smaller than the value of borrowed amount with interest\nA financial service must execute a liquidation process when the value of borrowed amount with interest equals the value of collateral with interest.\nA decentralized financial service cannot execute liquidation by itself. Instead, it creates an economic system that incentivizes the liquidators to quickly repay the outstanding loan and protect the protocol. The average liquidation profit of a typical DeFi ranges from 8 to 15%. This range increases the liquidation risk for the initial borrower. BiFi offers a low liquidation profit of 5%, lowering the risk of liquidation for borrowers with the lowest rate in the market.\nThe collateral ratio of each asset represents the portion that can be used as collateral for loans. This may change based on market conditions.\nCrypto Asset\nCollateral Ratio\nETH\n75%\nUSDT\n70%\nDAI\n75%\nLINK\n60%\nUSDC\n82.5%\nBNB\n75%\nBTCB\n75%\nKLAY and Klaytn-Compatible Tokens\n75%\nCollateral ratio = 75%: When you deposit 1 ETH, you can borrow as much as 0.75 ETH.\nWhat is BiFi Token?\nBiFi is the currency of BiFi platform. BiFi tokens are rewarded to users to use Lending, Pooling, and Staking services, and they become stakeholders of the protocol.\nBiFi tokens can be used in the following ways:\nPay BiFi for using multichain DeFi services\nPay BiFi for using multichain DeFi services\nStake and participate in BiFi’s governance system\nStake and participate in BiFi’s governance system\nBuy BiFi Token\nIs BiFi Secure?\nThe Bifrost team has always put security at the forefront of our development process. With countless breaches threatening the reputation and stability of the blockchain industry, we believe one of the most important contributions that we can make to the ecosystem as a whole is with a relentless focus on security.\nTo that end, we are happy to share the audit report we received for the smart contract developed for BiFi. The audit was conducted by Theori, and there was no security vulnerability found.\nBiFi Lending Audit Report\nBiFi Pooling and Staking Audit Reports\nBiFi Roadmap\nView BIFROST / BiFi Live Roadmap \nLast updated 3 years ago\nWas this helpful?",
    "url": "https://docs.bifi.finance/guide/more/faq"
  },
  {
    "title": "BiFi-White-Paper-V1.0-EN.pdf",
    "content": "Notifications You must be signed in to change notification settings\nFork 13\nStar 27\nCode\nIssues\nPull requests\n1\nActions\nSecurity\nInsights\nBreadcrumbs\nBIFI\n/docs\nBiFi-White-Paper-V1.0-EN.pdf\nLatest commit\nHistory\nFile metadata and controls",
    "url": "https://github.com/bifrost-platform/BIFI/blob/master/docs/BiFi-White-Paper-V1.0-EN.pdf"
  },
  {
    "title": "bifrost_bifi_audit.pdf",
    "content": "Notifications You must be signed in to change notification settings\nFork 13\nStar 27\nCode\nIssues\nPull requests\n1\nActions\nSecurity\nInsights\nBreadcrumbs\nBIFI\n/docs\nbifrost_bifi_audit.pdf\nLatest commit\nHistory\nFile metadata and controls",
    "url": "https://github.com/bifrost-platform/BIFI/blob/master/docs/bifrost_bifi_audit.pdf"
  },
  {
    "title": "theori-audit-rev-2.0.pdf",
    "content": "Notifications You must be signed in to change notification settings\nFork 3\nStar 10\nCode\nIssues\nPull requests\nActions\nSecurity\nInsights\nBreadcrumbs\nBiFi-staking-protocol\n/docs\ntheori-audit-rev-2.0.pdf\nLatest commit\nHistory\nFile metadata and controls",
    "url": "https://github.com/bifrost-platform/BiFi-staking-protocol/blob/main/docs/theori-audit-rev-2.0.pdf"
  }
]